[
    {
        "title": "DocLens : A Tool-Augmented Multi-Agent Framework for Long Visual Document Understanding",
        "summary": "Comprehending long visual documents, where information is distributed across extensive pages of text and visual elements, is a critical but challenging task for modern Vision-Language Models (VLMs). Existing approaches falter on a fundamental challenge: evidence localization. They struggle to retrieve relevant pages and overlook fine-grained details within visual elements, leading to limited performance and model hallucination. To address this, we propose DocLens, a tool-augmented multi-agent framework that effectively ``zooms in'' on evidence like a lens. It first navigates from the full document to specific visual elements on relevant pages, then employs a sampling-adjudication mechanism to generate a single, reliable answer. Paired with Gemini-2.5-Pro, DocLens achieves state-of-the-art performance on MMLongBench-Doc and FinRAGBench-V, surpassing even human experts. The framework's superiority is particularly evident on vision-centric and unanswerable queries, demonstrating the power of its enhanced localization capabilities.",
        "url": "http://arxiv.org/abs/2511.11552v1",
        "published_date": "2025-11-14T18:42:18+00:00",
        "updated_date": "2025-11-14T18:42:18+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Dawei Zhu",
            "Rui Meng",
            "Jiefeng Chen",
            "Sujian Li",
            "Tomas Pfister",
            "Jinsung Yoon"
        ],
        "tldr": "DocLens is a tool-augmented multi-agent framework that enhances long visual document understanding by improving evidence localization, achieving state-of-the-art performance on benchmark datasets and even surpassing human experts.",
        "tldr_zh": "DocLens是一个工具增强的多代理框架，通过提高证据定位能力来增强对长视觉文档的理解，在基准数据集上实现了最先进的性能，甚至超越了人类专家。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]