[
    {
        "title": "Large Learning Rates Simultaneously Achieve Robustness to Spurious Correlations and Compressibility",
        "summary": "Robustness and resource-efficiency are two highly desirable properties for\nmodern machine learning models. However, achieving them jointly remains a\nchallenge. In this paper, we position high learning rates as a facilitator for\nsimultaneously achieving robustness to spurious correlations and network\ncompressibility. We demonstrate that large learning rates also produce\ndesirable representation properties such as invariant feature utilization,\nclass separation, and activation sparsity. Importantly, our findings indicate\nthat large learning rates compare favorably to other hyperparameters and\nregularization methods, in consistently satisfying these properties in tandem.\nIn addition to demonstrating the positive effect of large learning rates across\ndiverse spurious correlation datasets, models, and optimizers, we also present\nstrong evidence that the previously documented success of large learning rates\nin standard classification tasks is likely due to its effect on addressing\nhidden/rare spurious correlations in the training dataset.",
        "url": "http://arxiv.org/abs/2507.17748v1",
        "published_date": "2025-07-23T17:59:02+00:00",
        "updated_date": "2025-07-23T17:59:02+00:00",
        "categories": [
            "cs.LG",
            "cs.AI",
            "cs.CV",
            "stat.ML"
        ],
        "authors": [
            "Melih Barsbey",
            "Lucas Prieto",
            "Stefanos Zafeiriou",
            "Tolga Birdal"
        ]
    },
    {
        "title": "Ultra3D: Efficient and High-Fidelity 3D Generation with Part Attention",
        "summary": "Recent advances in sparse voxel representations have significantly improved\nthe quality of 3D content generation, enabling high-resolution modeling with\nfine-grained geometry. However, existing frameworks suffer from severe\ncomputational inefficiencies due to the quadratic complexity of attention\nmechanisms in their two-stage diffusion pipelines. In this work, we propose\nUltra3D, an efficient 3D generation framework that significantly accelerates\nsparse voxel modeling without compromising quality. Our method leverages the\ncompact VecSet representation to efficiently generate a coarse object layout in\nthe first stage, reducing token count and accelerating voxel coordinate\nprediction. To refine per-voxel latent features in the second stage, we\nintroduce Part Attention, a geometry-aware localized attention mechanism that\nrestricts attention computation within semantically consistent part regions.\nThis design preserves structural continuity while avoiding unnecessary global\nattention, achieving up to 6.7x speed-up in latent generation. To support this\nmechanism, we construct a scalable part annotation pipeline that converts raw\nmeshes into part-labeled sparse voxels. Extensive experiments demonstrate that\nUltra3D supports high-resolution 3D generation at 1024 resolution and achieves\nstate-of-the-art performance in both visual fidelity and user preference.",
        "url": "http://arxiv.org/abs/2507.17745v3",
        "published_date": "2025-07-23T17:57:16+00:00",
        "updated_date": "2025-07-31T15:39:27+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Yiwen Chen",
            "Zhihao Li",
            "Yikai Wang",
            "Hu Zhang",
            "Qin Li",
            "Chi Zhang",
            "Guosheng Lin"
        ]
    },
    {
        "title": "Yume: An Interactive World Generation Model",
        "summary": "Yume aims to use images, text, or videos to create an interactive, realistic,\nand dynamic world, which allows exploration and control using peripheral\ndevices or neural signals. In this report, we present a preview version of\n\\method, which creates a dynamic world from an input image and allows\nexploration of the world using keyboard actions. To achieve this high-fidelity\nand interactive video world generation, we introduce a well-designed framework,\nwhich consists of four main components, including camera motion quantization,\nvideo generation architecture, advanced sampler, and model acceleration. First,\nwe quantize camera motions for stable training and user-friendly interaction\nusing keyboard inputs. Then, we introduce the Masked Video Diffusion\nTransformer~(MVDT) with a memory module for infinite video generation in an\nautoregressive manner. After that, training-free Anti-Artifact Mechanism (AAM)\nand Time Travel Sampling based on Stochastic Differential Equations (TTS-SDE)\nare introduced to the sampler for better visual quality and more precise\ncontrol. Moreover, we investigate model acceleration by synergistic\noptimization of adversarial distillation and caching mechanisms. We use the\nhigh-quality world exploration dataset \\sekai to train \\method, and it achieves\nremarkable results in diverse scenes and applications. All data, codebase, and\nmodel weights are available on https://github.com/stdstu12/YUME. Yume will\nupdate monthly to achieve its original goal. Project page:\nhttps://stdstu12.github.io/YUME-Project/.",
        "url": "http://arxiv.org/abs/2507.17744v1",
        "published_date": "2025-07-23T17:57:09+00:00",
        "updated_date": "2025-07-23T17:57:09+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.HC"
        ],
        "authors": [
            "Xiaofeng Mao",
            "Shaoheng Lin",
            "Zhen Li",
            "Chuanhao Li",
            "Wenshuo Peng",
            "Tong He",
            "Jiangmiao Pang",
            "Mingmin Chi",
            "Yu Qiao",
            "Kaipeng Zhang"
        ]
    },
    {
        "title": "A Comprehensive Evaluation Framework for the Study of the Effects of Facial Filters on Face Recognition Accuracy",
        "summary": "Facial filters are now commonplace for social media users around the world.\nPrevious work has demonstrated that facial filters can negatively impact\nautomated face recognition performance. However, these studies focus on small\nnumbers of hand-picked filters in particular styles. In order to more\neffectively incorporate the wide ranges of filters present on various social\nmedia applications, we introduce a framework that allows for larger-scale study\nof the impact of facial filters on automated recognition. This framework\nincludes a controlled dataset of face images, a principled filter selection\nprocess that selects a representative range of filters for experimentation, and\na set of experiments to evaluate the filters' impact on recognition. We\ndemonstrate our framework with a case study of filters from the American\napplications Instagram and Snapchat and the Chinese applications Meitu and Pitu\nto uncover cross-cultural differences. Finally, we show how the filtering\neffect in a face embedding space can easily be detected and restored to improve\nface recognition performance.",
        "url": "http://arxiv.org/abs/2507.17729v1",
        "published_date": "2025-07-23T17:43:35+00:00",
        "updated_date": "2025-07-23T17:43:35+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Kagan Ozturk",
            "Louisa Conwill",
            "Jacob Gutierrez",
            "Kevin Bowyer",
            "Walter J. Scheirer"
        ]
    },
    {
        "title": "Lumina-mGPT 2.0: Stand-Alone AutoRegressive Image Modeling",
        "summary": "We present Lumina-mGPT 2.0, a stand-alone, decoder-only autoregressive model\nthat revisits and revitalizes the autoregressive paradigm for high-quality\nimage generation and beyond. Unlike existing approaches that rely on pretrained\ncomponents or hybrid architectures, Lumina-mGPT 2.0 is trained entirely from\nscratch, enabling unrestricted architectural design and licensing freedom. It\nachieves generation quality on par with state-of-the-art diffusion models such\nas DALL-E 3 and SANA, while preserving the inherent flexibility and\ncompositionality of autoregressive modeling. Our unified tokenization scheme\nallows the model to seamlessly handle a wide spectrum of tasks-including\nsubject-driven generation, image editing, controllable synthesis, and dense\nprediction-within a single generative framework. To further boost usability, we\nincorporate efficient decoding strategies like inference-time scaling and\nspeculative Jacobi sampling to improve quality and speed, respectively.\nExtensive evaluations on standard text-to-image benchmarks (e.g., GenEval, DPG)\ndemonstrate that Lumina-mGPT 2.0 not only matches but in some cases surpasses\ndiffusion-based models. Moreover, we confirm its multi-task capabilities on the\nGraph200K benchmark, with the native Lumina-mGPT 2.0 performing exceptionally\nwell. These results position Lumina-mGPT 2.0 as a strong, flexible foundation\nmodel for unified multimodal generation. We have released our training details,\ncode, and models at https://github.com/Alpha-VLLM/Lumina-mGPT-2.0.",
        "url": "http://arxiv.org/abs/2507.17801v1",
        "published_date": "2025-07-23T17:42:13+00:00",
        "updated_date": "2025-07-23T17:42:13+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yi Xin",
            "Juncheng Yan",
            "Qi Qin",
            "Zhen Li",
            "Dongyang Liu",
            "Shicheng Li",
            "Victor Shea-Jay Huang",
            "Yupeng Zhou",
            "Renrui Zhang",
            "Le Zhuo",
            "Tiancheng Han",
            "Xiaoqing Sun",
            "Siqi Luo",
            "Mengmeng Wang",
            "Bin Fu",
            "Yuewen Cao",
            "Hongsheng Li",
            "Guangtao Zhai",
            "Xiaohong Liu",
            "Yu Qiao",
            "Peng Gao"
        ]
    },
    {
        "title": "CA-Cut: Crop-Aligned Cutout for Data Augmentation to Learn More Robust Under-Canopy Navigation",
        "summary": "State-of-the-art visual under-canopy navigation methods are designed with\ndeep learning-based perception models to distinguish traversable space from\ncrop rows. While these models have demonstrated successful performance, they\nrequire large amounts of training data to ensure reliability in real-world\nfield deployment. However, data collection is costly, demanding significant\nhuman resources for in-field sampling and annotation. To address this\nchallenge, various data augmentation techniques are commonly employed during\nmodel training, such as color jittering, Gaussian blur, and horizontal flip, to\ndiversify training data and enhance model robustness. In this paper, we\nhypothesize that utilizing only these augmentation techniques may lead to\nsuboptimal performance, particularly in complex under-canopy environments with\nfrequent occlusions, debris, and non-uniform spacing of crops. Instead, we\npropose a novel augmentation method, so-called Crop-Aligned Cutout (CA-Cut)\nwhich masks random regions out in input images that are spatially distributed\naround crop rows on the sides to encourage trained models to capture high-level\ncontextual features even when fine-grained information is obstructed. Our\nextensive experiments with a public cornfield dataset demonstrate that\nmasking-based augmentations are effective for simulating occlusions and\nsignificantly improving robustness in semantic keypoint predictions for visual\nnavigation. In particular, we show that biasing the mask distribution toward\ncrop rows in CA-Cut is critical for enhancing both prediction accuracy and\ngeneralizability across diverse environments achieving up to a 36.9% reduction\nin prediction error. In addition, we conduct ablation studies to determine the\nnumber of masks, the size of each mask, and the spatial distribution of masks\nto maximize overall performance.",
        "url": "http://arxiv.org/abs/2507.17727v2",
        "published_date": "2025-07-23T17:41:55+00:00",
        "updated_date": "2025-07-24T13:55:49+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Robel Mamo",
            "Taeyeong Choi"
        ]
    },
    {
        "title": "On the Interaction of Compressibility and Adversarial Robustness",
        "summary": "Modern neural networks are expected to simultaneously satisfy a host of\ndesirable properties: accurate fitting to training data, generalization to\nunseen inputs, parameter and computational efficiency, and robustness to\nadversarial perturbations. While compressibility and robustness have each been\nstudied extensively, a unified understanding of their interaction still remains\nelusive. In this work, we develop a principled framework to analyze how\ndifferent forms of compressibility - such as neuron-level sparsity and spectral\ncompressibility - affect adversarial robustness. We show that these forms of\ncompression can induce a small number of highly sensitive directions in the\nrepresentation space, which adversaries can exploit to construct effective\nperturbations. Our analysis yields a simple yet instructive robustness bound,\nrevealing how neuron and spectral compressibility impact $L_\\infty$ and $L_2$\nrobustness via their effects on the learned representations. Crucially, the\nvulnerabilities we identify arise irrespective of how compression is achieved -\nwhether via regularization, architectural bias, or implicit learning dynamics.\nThrough empirical evaluations across synthetic and realistic tasks, we confirm\nour theoretical predictions, and further demonstrate that these vulnerabilities\npersist under adversarial training and transfer learning, and contribute to the\nemergence of universal adversarial perturbations. Our findings show a\nfundamental tension between structured compressibility and robustness, and\nsuggest new pathways for designing models that are both efficient and secure.",
        "url": "http://arxiv.org/abs/2507.17725v1",
        "published_date": "2025-07-23T17:35:48+00:00",
        "updated_date": "2025-07-23T17:35:48+00:00",
        "categories": [
            "cs.LG",
            "cs.AI",
            "cs.CV",
            "stat.ML"
        ],
        "authors": [
            "Melih Barsbey",
            "Antônio H. Ribeiro",
            "Umut Şimşekli",
            "Tolga Birdal"
        ]
    },
    {
        "title": "BetterCheck: Towards Safeguarding VLMs for Automotive Perception Systems",
        "summary": "Large language models (LLMs) are growingly extended to process multimodal\ndata such as text and video simultaneously. Their remarkable performance in\nunderstanding what is shown in images is surpassing specialized neural networks\n(NNs) such as Yolo that is supporting only a well-formed but very limited\nvocabulary, ie., objects that they are able to detect. When being\nnon-restricted, LLMs and in particular state-of-the-art vision language models\n(VLMs) show impressive performance to describe even complex traffic situations.\nThis is making them potentially suitable components for automotive perception\nsystems to support the understanding of complex traffic situations or edge case\nsituation. However, LLMs and VLMs are prone to hallucination, which mean to\neither potentially not seeing traffic agents such as vulnerable road users who\nare present in a situation, or to seeing traffic agents who are not there in\nreality. While the latter is unwanted making an ADAS or autonomous driving\nsystems (ADS) to unnecessarily slow down, the former could lead to disastrous\ndecisions from an ADS. In our work, we are systematically assessing the\nperformance of 3 state-of-the-art VLMs on a diverse subset of traffic\nsituations sampled from the Waymo Open Dataset to support safety guardrails for\ncapturing such hallucinations in VLM-supported perception systems. We observe\nthat both, proprietary and open VLMs exhibit remarkable image understanding\ncapabilities even paying thorough attention to fine details sometimes difficult\nto spot for us humans. However, they are also still prone to making up elements\nin their descriptions to date requiring hallucination detection strategies such\nas BetterCheck that we propose in our work.",
        "url": "http://arxiv.org/abs/2507.17722v1",
        "published_date": "2025-07-23T17:32:17+00:00",
        "updated_date": "2025-07-23T17:32:17+00:00",
        "categories": [
            "cs.CV",
            "I.4.m"
        ],
        "authors": [
            "Malsha Ashani Mahawatta Dona",
            "Beatriz Cabrero-Daniel",
            "Yinan Yu",
            "Christian Berger"
        ]
    },
    {
        "title": "Eyes Will Shut: A Vision-Based Next GPS Location Prediction Model by Reinforcement Learning from Visual Map Feed Back",
        "summary": "Next Location Prediction is a fundamental task in the study of human\nmobility, with wide-ranging applications in transportation planning, urban\ngovernance, and epidemic forecasting. In practice, when humans attempt to\npredict the next location in a trajectory, they often visualize the trajectory\non a map and reason based on road connectivity and movement trends. However,\nthe vast majority of existing next-location prediction models do not reason\nover maps \\textbf{in the way that humans do}. Fortunately, the recent\ndevelopment of Vision-Language Models (VLMs) has demonstrated strong\ncapabilities in visual perception and even visual reasoning. This opens up a\nnew possibility: by rendering both the road network and trajectory onto an\nimage and leveraging the reasoning abilities of VLMs, we can enable models to\nperform trajectory inference in a human-like manner. To explore this idea, we\nfirst propose a method called Vision-Guided Location Search (VGLS), which\nevaluates whether a general-purpose VLM is capable of trajectory-based\nreasoning without modifying any of its internal parameters. Based on insights\nfrom the VGLS results, we further propose our main approach: VLMLocPredictor,\nwhich is composed of two stages: In the first stage, we design two Supervised\nFine-Tuning (SFT) tasks that help the VLM understand road network and\ntrajectory structures and acquire basic reasoning ability on such visual\ninputs. In the second stage, we introduce Reinforcement Learning from Visual\nMap Feedback, enabling the model to self-improve its next-location prediction\nability through interaction with the environment. Experiments conducted on\ndatasets from four different cities show that our method achieves\nstate-of-the-art (SOTA) performance and exhibits superior cross-city\ngeneralization compared to other LLM-based approaches.",
        "url": "http://arxiv.org/abs/2507.18661v2",
        "published_date": "2025-07-23T16:58:44+00:00",
        "updated_date": "2025-07-28T04:30:19+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Ruixing Zhang",
            "Yang Zhang",
            "Tongyu Zhu",
            "Leilei Sun",
            "Weifeng Lv"
        ]
    },
    {
        "title": "Joint Asymmetric Loss for Learning with Noisy Labels",
        "summary": "Learning with noisy labels is a crucial task for training accurate deep\nneural networks. To mitigate label noise, prior studies have proposed various\nrobust loss functions, particularly symmetric losses. Nevertheless, symmetric\nlosses usually suffer from the underfitting issue due to the overly strict\nconstraint. To address this problem, the Active Passive Loss (APL) jointly\noptimizes an active and a passive loss to mutually enhance the overall fitting\nability. Within APL, symmetric losses have been successfully extended, yielding\nadvanced robust loss functions. Despite these advancements, emerging\ntheoretical analyses indicate that asymmetric losses, a new class of robust\nloss functions, possess superior properties compared to symmetric losses.\nHowever, existing asymmetric losses are not compatible with advanced\noptimization frameworks such as APL, limiting their potential and\napplicability. Motivated by this theoretical gap and the prospect of asymmetric\nlosses, we extend the asymmetric loss to the more complex passive loss scenario\nand propose the Asymetric Mean Square Error (AMSE), a novel asymmetric loss. We\nrigorously establish the necessary and sufficient condition under which AMSE\nsatisfies the asymmetric condition. By substituting the traditional symmetric\npassive loss in APL with our proposed AMSE, we introduce a novel robust loss\nframework termed Joint Asymmetric Loss (JAL). Extensive experiments demonstrate\nthe effectiveness of our method in mitigating label noise. Code available at:\nhttps://github.com/cswjl/joint-asymmetric-loss",
        "url": "http://arxiv.org/abs/2507.17692v1",
        "published_date": "2025-07-23T16:57:43+00:00",
        "updated_date": "2025-07-23T16:57:43+00:00",
        "categories": [
            "cs.LG",
            "cs.CV"
        ],
        "authors": [
            "Jialiang Wang",
            "Xianming Liu",
            "Xiong Zhou",
            "Gangfeng Hu",
            "Deming Zhai",
            "Junjun Jiang",
            "Xiangyang Ji"
        ]
    },
    {
        "title": "Audio-Vision Contrastive Learning for Phonological Class Recognition",
        "summary": "Accurate classification of articulatory-phonological features plays a vital\nrole in understanding human speech production and developing robust speech\ntechnologies, particularly in clinical contexts where targeted phonemic\nanalysis and therapy can improve disease diagnosis accuracy and personalized\nrehabilitation. In this work, we propose a multimodal deep learning framework\nthat combines real-time magnetic resonance imaging (rtMRI) and speech signals\nto classify three key articulatory dimensions: manner of articulation, place of\narticulation, and voicing. We perform classification on 15 phonological classes\nderived from the aforementioned articulatory dimensions and evaluate the system\nwith four audio/vision configurations: unimodal rtMRI, unimodal audio signals,\nmultimodal middle fusion, and contrastive learning-based audio-vision fusion.\nExperimental results on the USC-TIMIT dataset show that our contrastive\nlearning-based approach achieves state-of-the-art performance, with an average\nF1-score of 0.81, representing an absolute increase of 0.23 over the unimodal\nbaseline. The results confirm the effectiveness of contrastive representation\nlearning for multimodal articulatory analysis. Our code and processed dataset\nwill be made publicly available at\nhttps://github.com/DaE-plz/AC_Contrastive_Phonology to support future research.",
        "url": "http://arxiv.org/abs/2507.17682v1",
        "published_date": "2025-07-23T16:44:22+00:00",
        "updated_date": "2025-07-23T16:44:22+00:00",
        "categories": [
            "cs.SD",
            "cs.CV",
            "cs.MM",
            "eess.AS"
        ],
        "authors": [
            "Daiqi Liu",
            "Tomás Arias-Vergara",
            "Jana Hutter",
            "Andreas Maier",
            "Paula Andrea Pérez-Toro"
        ]
    },
    {
        "title": "MCM: Mamba-based Cardiac Motion Tracking using Sequential Images in MRI",
        "summary": "Myocardial motion tracking is important for assessing cardiac function and\ndiagnosing cardiovascular diseases, for which cine cardiac magnetic resonance\n(CMR) has been established as the gold standard imaging modality. Many existing\nmethods learn motion from single image pairs consisting of a reference frame\nand a randomly selected target frame from the cardiac cycle. However, these\nmethods overlook the continuous nature of cardiac motion and often yield\ninconsistent and non-smooth motion estimations. In this work, we propose a\nnovel Mamba-based cardiac motion tracking network (MCM) that explicitly\nincorporates target image sequence from the cardiac cycle to achieve smooth and\ntemporally consistent motion tracking. By developing a bi-directional Mamba\nblock equipped with a bi-directional scanning mechanism, our method facilitates\nthe estimation of plausible deformation fields. With our proposed motion\ndecoder that integrates motion information from frames adjacent to the target\nframe, our method further enhances temporal coherence. Moreover, by taking\nadvantage of Mamba's structured state-space formulation, the proposed method\nlearns the continuous dynamics of the myocardium from sequential images without\nincreasing computational complexity. We evaluate the proposed method on two\npublic datasets. The experimental results demonstrate that the proposed method\nquantitatively and qualitatively outperforms both conventional and\nstate-of-the-art learning-based cardiac motion tracking methods. The code is\navailable at https://github.com/yjh-0104/MCM.",
        "url": "http://arxiv.org/abs/2507.17678v1",
        "published_date": "2025-07-23T16:40:43+00:00",
        "updated_date": "2025-07-23T16:40:43+00:00",
        "categories": [
            "eess.IV",
            "cs.CV"
        ],
        "authors": [
            "Jiahui Yin",
            "Xinxing Cheng",
            "Jinming Duan",
            "Yan Pang",
            "Declan O'Regan",
            "Hadrien Reynaud",
            "Qingjie Meng"
        ]
    },
    {
        "title": "Improving Multislice Electron Ptychography with a Generative Prior",
        "summary": "Multislice electron ptychography (MEP) is an inverse imaging technique that\ncomputationally reconstructs the highest-resolution images of atomic crystal\nstructures from diffraction patterns. Available algorithms often solve this\ninverse problem iteratively but are both time consuming and produce suboptimal\nsolutions due to their ill-posed nature. We develop MEP-Diffusion, a diffusion\nmodel trained on a large database of crystal structures specifically for MEP to\naugment existing iterative solvers. MEP-Diffusion is easily integrated as a\ngenerative prior into existing reconstruction methods via Diffusion Posterior\nSampling (DPS). We find that this hybrid approach greatly enhances the quality\nof the reconstructed 3D volumes, achieving a 90.50% improvement in SSIM over\nexisting methods.",
        "url": "http://arxiv.org/abs/2507.17800v2",
        "published_date": "2025-07-23T16:35:25+00:00",
        "updated_date": "2025-07-25T03:14:07+00:00",
        "categories": [
            "eess.IV",
            "cond-mat.mtrl-sci",
            "cs.CV",
            "physics.optics"
        ],
        "authors": [
            "Christian K. Belardi",
            "Chia-Hao Lee",
            "Yingheng Wang",
            "Justin Lovelace",
            "Kilian Q. Weinberger",
            "David A. Muller",
            "Carla P. Gomes"
        ]
    },
    {
        "title": "Perspective-Invariant 3D Object Detection",
        "summary": "With the rise of robotics, LiDAR-based 3D object detection has garnered\nsignificant attention in both academia and industry. However, existing datasets\nand methods predominantly focus on vehicle-mounted platforms, leaving other\nautonomous platforms underexplored. To bridge this gap, we introduce Pi3DET,\nthe first benchmark featuring LiDAR data and 3D bounding box annotations\ncollected from multiple platforms: vehicle, quadruped, and drone, thereby\nfacilitating research in 3D object detection for non-vehicle platforms as well\nas cross-platform 3D detection. Based on Pi3DET, we propose a novel\ncross-platform adaptation framework that transfers knowledge from the\nwell-studied vehicle platform to other platforms. This framework achieves\nperspective-invariant 3D detection through robust alignment at both geometric\nand feature levels. Additionally, we establish a benchmark to evaluate the\nresilience and robustness of current 3D detectors in cross-platform scenarios,\nproviding valuable insights for developing adaptive 3D perception systems.\nExtensive experiments validate the effectiveness of our approach on challenging\ncross-platform tasks, demonstrating substantial gains over existing adaptation\nmethods. We hope this work paves the way for generalizable and unified 3D\nperception systems across diverse and complex environments. Our Pi3DET dataset,\ncross-platform benchmark suite, and annotation toolkit have been made publicly\navailable.",
        "url": "http://arxiv.org/abs/2507.17665v1",
        "published_date": "2025-07-23T16:29:57+00:00",
        "updated_date": "2025-07-23T16:29:57+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Ao Liang",
            "Lingdong Kong",
            "Dongyue Lu",
            "Youquan Liu",
            "Jian Fang",
            "Huaici Zhao",
            "Wei Tsang Ooi"
        ]
    },
    {
        "title": "Talk2Event: Grounded Understanding of Dynamic Scenes from Event Cameras",
        "summary": "Event cameras offer microsecond-level latency and robustness to motion blur,\nmaking them ideal for understanding dynamic environments. Yet, connecting these\nasynchronous streams to human language remains an open challenge. We introduce\nTalk2Event, the first large-scale benchmark for language-driven object\ngrounding in event-based perception. Built from real-world driving data, we\nprovide over 30,000 validated referring expressions, each enriched with four\ngrounding attributes -- appearance, status, relation to viewer, and relation to\nother objects -- bridging spatial, temporal, and relational reasoning. To fully\nexploit these cues, we propose EventRefer, an attribute-aware grounding\nframework that dynamically fuses multi-attribute representations through a\nMixture of Event-Attribute Experts (MoEE). Our method adapts to different\nmodalities and scene dynamics, achieving consistent gains over state-of-the-art\nbaselines in event-only, frame-only, and event-frame fusion settings. We hope\nour dataset and approach will establish a foundation for advancing multimodal,\ntemporally-aware, and language-driven perception in real-world robotics and\nautonomy.",
        "url": "http://arxiv.org/abs/2507.17664v1",
        "published_date": "2025-07-23T16:29:52+00:00",
        "updated_date": "2025-07-23T16:29:52+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Lingdong Kong",
            "Dongyue Lu",
            "Ao Liang",
            "Rong Li",
            "Yuhao Dong",
            "Tianshuai Hu",
            "Lai Xing Ng",
            "Wei Tsang Ooi",
            "Benoit R. Cottereau"
        ]
    },
    {
        "title": "Mammo-Mamba: A Hybrid State-Space and Transformer Architecture with Sequential Mixture of Experts for Multi-View Mammography",
        "summary": "Breast cancer (BC) remains one of the leading causes of cancer-related\nmortality among women, despite recent advances in Computer-Aided Diagnosis\n(CAD) systems. Accurate and efficient interpretation of multi-view mammograms\nis essential for early detection, driving a surge of interest in Artificial\nIntelligence (AI)-powered CAD models. While state-of-the-art multi-view\nmammogram classification models are largely based on Transformer architectures,\ntheir computational complexity scales quadratically with the number of image\npatches, highlighting the need for more efficient alternatives. To address this\nchallenge, we propose Mammo-Mamba, a novel framework that integrates Selective\nState-Space Models (SSMs), transformer-based attention, and expert-driven\nfeature refinement into a unified architecture. Mammo-Mamba extends the\nMambaVision backbone by introducing the Sequential Mixture of Experts (SeqMoE)\nmechanism through its customized SecMamba block. The SecMamba is a modified\nMambaVision block that enhances representation learning in high-resolution\nmammographic images by enabling content-adaptive feature refinement. These\nblocks are integrated into the deeper stages of MambaVision, allowing the model\nto progressively adjust feature emphasis through dynamic expert gating,\neffectively mitigating the limitations of traditional Transformer models.\nEvaluated on the CBIS-DDSM benchmark dataset, Mammo-Mamba achieves superior\nclassification performance across all key metrics while maintaining\ncomputational efficiency.",
        "url": "http://arxiv.org/abs/2507.17662v1",
        "published_date": "2025-07-23T16:29:46+00:00",
        "updated_date": "2025-07-23T16:29:46+00:00",
        "categories": [
            "eess.IV",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Farnoush Bayatmakou",
            "Reza Taleei",
            "Nicole Simone",
            "Arash Mohammadi"
        ]
    },
    {
        "title": "Monocular Semantic Scene Completion via Masked Recurrent Networks",
        "summary": "Monocular Semantic Scene Completion (MSSC) aims to predict the voxel-wise\noccupancy and semantic category from a single-view RGB image. Existing methods\nadopt a single-stage framework that aims to simultaneously achieve visible\nregion segmentation and occluded region hallucination, while also being\naffected by inaccurate depth estimation. Such methods often achieve suboptimal\nperformance, especially in complex scenes. We propose a novel two-stage\nframework that decomposes MSSC into coarse MSSC followed by the Masked\nRecurrent Network. Specifically, we propose the Masked Sparse Gated Recurrent\nUnit (MS-GRU) which concentrates on the occupied regions by the proposed mask\nupdating mechanism, and a sparse GRU design is proposed to reduce the\ncomputation cost. Additionally, we propose the distance attention projection to\nreduce projection errors by assigning different attention scores according to\nthe distance to the observed surface. Experimental results demonstrate that our\nproposed unified framework, MonoMRN, effectively supports both indoor and\noutdoor scenes and achieves state-of-the-art performance on the NYUv2 and\nSemanticKITTI datasets. Furthermore, we conduct robustness analysis under\nvarious disturbances, highlighting the role of the Masked Recurrent Network in\nenhancing the model's resilience to such challenges. The source code is\npublicly available.",
        "url": "http://arxiv.org/abs/2507.17661v1",
        "published_date": "2025-07-23T16:29:45+00:00",
        "updated_date": "2025-07-23T16:29:45+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Xuzhi Wang",
            "Xinran Wu",
            "Song Wang",
            "Lingdong Kong",
            "Ziping Zhao"
        ]
    },
    {
        "title": "See the Forest and the Trees: A Synergistic Reasoning Framework for Knowledge-Based Visual Question Answering",
        "summary": "Multimodal Large Language Models (MLLMs) have pushed the frontiers of\nKnowledge-Based Visual Question Answering (KBVQA), yet their reasoning is\nfundamentally bottlenecked by a reliance on uni-dimensional evidence. This\n\"seeing only the trees, but not the forest\" approach prevents robust,\nmulti-faceted understanding. Inspired by the principle of seeing both the\nforest and trees, we propose Synergos-VQA, a novel synergistic reasoning\nframework. At its core, Synergos-VQA concurrently generates and fuses three\ncomplementary evidence streams at inference time: (1) Holistic Evidence to\nperceive the entire scene (the \"forest\"), (2) Structural Evidence from a\nprototype-driven module to identify key objects (the \"trees\"), and (3) Causal\nEvidence from a counterfactual probe to ensure the reasoning is robustly\ngrounded. By synergistically fusing this multi-faceted evidence, our framework\nachieves a more comprehensive and reliable reasoning process. Extensive\nexperiments show that Synergos-VQA decisively establishes a new\nstate-of-the-art on three challenging benchmarks, including OK-VQA and A-OKVQA.\nFurthermore, our approach demonstrates strong plug-and-play capabilities,\nsignificantly boosting various open-source MLLMs and proving that superior\nmethodological design can outperform sheer model scale.",
        "url": "http://arxiv.org/abs/2507.17659v1",
        "published_date": "2025-07-23T16:24:57+00:00",
        "updated_date": "2025-07-23T16:24:57+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Junjie Wang",
            "Yunhan Tang",
            "Yijie Wang",
            "Zhihao Yuan",
            "Huan Wang",
            "Yangfan He",
            "Bin Li"
        ]
    },
    {
        "title": "Attention (as Discrete-Time Markov) Chains",
        "summary": "We introduce a new interpretation of the attention matrix as a discrete-time\nMarkov chain. Our interpretation sheds light on common operations involving\nattention scores such as selection, summation, and averaging in a unified\nframework. It further extends them by considering indirect attention,\npropagated through the Markov chain, as opposed to previous studies that only\nmodel immediate effects. Our main observation is that tokens corresponding to\nsemantically similar regions form a set of metastable states, where the\nattention clusters, while noisy attention scores tend to disperse. Metastable\nstates and their prevalence can be easily computed through simple matrix\nmultiplication and eigenanalysis, respectively. Using these lightweight tools,\nwe demonstrate state-of-the-art zero-shot segmentation. Lastly, we define\nTokenRank -- the steady state vector of the Markov chain, which measures global\ntoken importance. We demonstrate that using it brings improvements in\nunconditional image generation. We believe our framework offers a fresh view of\nhow tokens are being attended in modern visual transformers.",
        "url": "http://arxiv.org/abs/2507.17657v1",
        "published_date": "2025-07-23T16:20:47+00:00",
        "updated_date": "2025-07-23T16:20:47+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yotam Erel",
            "Olaf Dünkel",
            "Rishabh Dabral",
            "Vladislav Golyanik",
            "Christian Theobalt",
            "Amit H. Bermano"
        ]
    },
    {
        "title": "CNS-Bench: Benchmarking Image Classifier Robustness Under Continuous Nuisance Shifts",
        "summary": "An important challenge when using computer vision models in the real world is\nto evaluate their performance in potential out-of-distribution (OOD) scenarios.\nWhile simple synthetic corruptions are commonly applied to test OOD robustness,\nthey often fail to capture nuisance shifts that occur in the real world.\nRecently, diffusion models have been applied to generate realistic images for\nbenchmarking, but they are restricted to binary nuisance shifts. In this work,\nwe introduce CNS-Bench, a Continuous Nuisance Shift Benchmark to quantify OOD\nrobustness of image classifiers for continuous and realistic generative\nnuisance shifts. CNS-Bench allows generating a wide range of individual\nnuisance shifts in continuous severities by applying LoRA adapters to diffusion\nmodels. To address failure cases, we propose a filtering mechanism that\noutperforms previous methods, thereby enabling reliable benchmarking with\ngenerative models. With the proposed benchmark, we perform a large-scale study\nto evaluate the robustness of more than 40 classifiers under various nuisance\nshifts. Through carefully designed comparisons and analyses, we find that model\nrankings can change for varying shifts and shift scales, which cannot be\ncaptured when applying common binary shifts. Additionally, we show that\nevaluating the model performance on a continuous scale allows the\nidentification of model failure points, providing a more nuanced understanding\nof model robustness. Project page including code and data:\nhttps://genintel.github.io/CNS.",
        "url": "http://arxiv.org/abs/2507.17651v1",
        "published_date": "2025-07-23T16:15:48+00:00",
        "updated_date": "2025-07-23T16:15:48+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Olaf Dünkel",
            "Artur Jesslen",
            "Jiahao Xie",
            "Christian Theobalt",
            "Christian Rupprecht",
            "Adam Kortylewski"
        ]
    },
    {
        "title": "The Early Bird Identifies the Worm: You Can't Beat a Head Start in Long-Term Body Re-ID (ECHO-BID)",
        "summary": "Person identification in unconstrained viewing environments presents\nsignificant challenges due to variations in distance, viewpoint, imaging\nconditions, and clothing. We introduce $\\textbf{E}$va $\\textbf{C}$lothes-Change\nfrom $\\textbf{H}$idden $\\textbf{O}$bjects - $\\textbf{B}$ody\n$\\textbf{ID}$entification (ECHO-BID), a class of long-term re-id models built\non object-pretrained EVA-02 Large backbones. We compare ECHO-BID to 9 other\nmodels that vary systematically in backbone architecture, model size, scale of\nobject classification pretraining, and transfer learning protocol. Models were\nevaluated on benchmark datasets across constrained, unconstrained, and occluded\nsettings. ECHO-BID, with transfer learning on the most challenging\nclothes-change data, achieved state-of-the-art results on long-term re-id --\nsubstantially outperforming other methods. ECHO-BID also surpassed other\nmethods by a wide margin in occluded viewing scenarios. A combination of\nincreased model size and Masked Image Modeling during pretraining underlie\nECHO-BID's strong performance on long-term re-id. Notably, a smaller, but more\nchallenging transfer learning dataset, generalized better across datasets than\na larger, less challenging one. However, the larger dataset with an additional\nfine-tuning step proved best on the most difficult data. Selecting the correct\npretrained backbone architecture and transfer learning protocols can drive\nsubstantial gains in long-term re-id performance.",
        "url": "http://arxiv.org/abs/2507.17640v1",
        "published_date": "2025-07-23T16:04:45+00:00",
        "updated_date": "2025-07-23T16:04:45+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Thomas M. Metz",
            "Matthew Q. Hill",
            "Alice J. O'Toole"
        ]
    },
    {
        "title": "Reusing Attention for One-stage Lane Topology Understanding",
        "summary": "Understanding lane toplogy relationships accurately is critical for safe\nautonomous driving. However, existing two-stage methods suffer from\ninefficiencies due to error propagations and increased computational overheads.\nTo address these challenges, we propose a one-stage architecture that\nsimultaneously predicts traffic elements, lane centerlines and topology\nrelationship, improving both the accuracy and inference speed of lane topology\nunderstanding for autonomous driving. Our key innovation lies in reusing\nintermediate attention resources within distinct transformer decoders. This\napproach effectively leverages the inherent relational knowledge within the\nelement detection module to enable the modeling of topology relationships among\ntraffic elements and lanes without requiring additional computationally\nexpensive graph networks. Furthermore, we are the first to demonstrate that\nknowledge can be distilled from models that utilize standard definition (SD)\nmaps to those operates without using SD maps, enabling superior performance\neven in the absence of SD maps. Extensive experiments on the OpenLane-V2\ndataset show that our approach outperforms baseline methods in both accuracy\nand efficiency, achieving superior results in lane detection, traffic element\nidentification, and topology reasoning. Our code is available at\nhttps://github.com/Yang-Li-2000/one-stage.git.",
        "url": "http://arxiv.org/abs/2507.17617v1",
        "published_date": "2025-07-23T15:48:16+00:00",
        "updated_date": "2025-07-23T15:48:16+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yang Li",
            "Zongzheng Zhang",
            "Xuchong Qiu",
            "Xinrun Li",
            "Ziming Liu",
            "Leichen Wang",
            "Ruikai Li",
            "Zhenxin Zhu",
            "Huan-ang Gao",
            "Xiaojian Lin",
            "Zhiyong Cui",
            "Hang Zhao",
            "Hao Zhao"
        ]
    },
    {
        "title": "Vision Transformer attention alignment with human visual perception in aesthetic object evaluation",
        "summary": "Visual attention mechanisms play a crucial role in human perception and\naesthetic evaluation. Recent advances in Vision Transformers (ViTs) have\ndemonstrated remarkable capabilities in computer vision tasks, yet their\nalignment with human visual attention patterns remains underexplored,\nparticularly in aesthetic contexts. This study investigates the correlation\nbetween human visual attention and ViT attention mechanisms when evaluating\nhandcrafted objects. We conducted an eye-tracking experiment with 30\nparticipants (9 female, 21 male, mean age 24.6 years) who viewed 20 artisanal\nobjects comprising basketry bags and ginger jars. Using a Pupil Labs\neye-tracker, we recorded gaze patterns and generated heat maps representing\nhuman visual attention. Simultaneously, we analyzed the same objects using a\npre-trained ViT model with DINO (Self-DIstillation with NO Labels), extracting\nattention maps from each of the 12 attention heads. We compared human and ViT\nattention distributions using Kullback-Leibler divergence across varying\nGaussian parameters (sigma=0.1 to 3.0). Statistical analysis revealed optimal\ncorrelation at sigma=2.4 +-0.03, with attention head #12 showing the strongest\nalignment with human visual patterns. Significant differences were found\nbetween attention heads, with heads #7 and #9 demonstrating the greatest\ndivergence from human attention (p< 0.05, Tukey HSD test). Results indicate\nthat while ViTs exhibit more global attention patterns compared to human focal\nattention, certain attention heads can approximate human visual behavior,\nparticularly for specific object features like buckles in basketry items. These\nfindings suggest potential applications of ViT attention mechanisms in product\ndesign and aesthetic evaluation, while highlighting fundamental differences in\nattention strategies between human perception and current AI models.",
        "url": "http://arxiv.org/abs/2507.17616v1",
        "published_date": "2025-07-23T15:47:34+00:00",
        "updated_date": "2025-07-23T15:47:34+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.LG"
        ],
        "authors": [
            "Miguel Carrasco",
            "César González-Martín",
            "José Aranda",
            "Luis Oliveros"
        ]
    },
    {
        "title": "InvRGB+L: Inverse Rendering of Complex Scenes with Unified Color and LiDAR Reflectance Modeling",
        "summary": "We present InvRGB+L, a novel inverse rendering model that reconstructs large,\nrelightable, and dynamic scenes from a single RGB+LiDAR sequence. Conventional\ninverse graphics methods rely primarily on RGB observations and use LiDAR\nmainly for geometric information, often resulting in suboptimal material\nestimates due to visible light interference. We find that LiDAR's intensity\nvalues-captured with active illumination in a different spectral range-offer\ncomplementary cues for robust material estimation under variable lighting.\nInspired by this, InvRGB+L leverages LiDAR intensity cues to overcome\nchallenges inherent in RGB-centric inverse graphics through two key\ninnovations: (1) a novel physics-based LiDAR shading model and (2) RGB-LiDAR\nmaterial consistency losses. The model produces novel-view RGB and LiDAR\nrenderings of urban and indoor scenes and supports relighting, night\nsimulations, and dynamic object insertions, achieving results that surpass\ncurrent state-of-the-art methods in both scene-level urban inverse rendering\nand LiDAR simulation.",
        "url": "http://arxiv.org/abs/2507.17613v1",
        "published_date": "2025-07-23T15:46:09+00:00",
        "updated_date": "2025-07-23T15:46:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Xiaoxue Chen",
            "Bhargav Chandaka",
            "Chih-Hao Lin",
            "Ya-Qin Zhang",
            "David Forsyth",
            "Hao Zhao",
            "Shenlong Wang"
        ]
    },
    {
        "title": "Explainable AI for Collaborative Assessment of 2D/3D Registration Quality",
        "summary": "As surgery embraces digital transformation--integrating sophisticated\nimaging, advanced algorithms, and robotics to support and automate complex\nsub-tasks--human judgment of system correctness remains a vital safeguard for\npatient safety. This shift introduces new \"operator-type\" roles tasked with\nverifying complex algorithmic outputs, particularly at critical junctures of\nthe procedure, such as the intermediary check before drilling or implant\nplacement. A prime example is 2D/3D registration, a key enabler of image-based\nsurgical navigation that aligns intraoperative 2D images with preoperative 3D\ndata. Although registration algorithms have advanced significantly, they\noccasionally yield inaccurate results. Because even small misalignments can\nlead to revision surgery or irreversible surgical errors, there is a critical\nneed for robust quality assurance. Current visualization-based strategies alone\nhave been found insufficient to enable humans to reliably detect 2D/3D\nregistration misalignments. In response, we propose the first artificial\nintelligence (AI) framework trained specifically for 2D/3D registration quality\nverification, augmented by explainability features that clarify the model's\ndecision-making. Our explainable AI (XAI) approach aims to enhance informed\ndecision-making for human operators by providing a second opinion together with\na rationale behind it. Through algorithm-centric and human-centered\nevaluations, we systematically compare four conditions: AI-only, human-only,\nhuman-AI, and human-XAI. Our findings reveal that while explainability features\nmodestly improve user trust and willingness to override AI errors, they do not\nexceed the standalone AI in aggregate performance. Nevertheless, future work\nextending both the algorithmic design and the human-XAI collaboration elements\nholds promise for more robust quality assurance of 2D/3D registration.",
        "url": "http://arxiv.org/abs/2507.17597v1",
        "published_date": "2025-07-23T15:28:57+00:00",
        "updated_date": "2025-07-23T15:28:57+00:00",
        "categories": [
            "cs.HC",
            "cs.CV"
        ],
        "authors": [
            "Sue Min Cho",
            "Alexander Do",
            "Russell H. Taylor",
            "Mathias Unberath"
        ]
    },
    {
        "title": "PRIX: Learning to Plan from Raw Pixels for End-to-End Autonomous Driving",
        "summary": "While end-to-end autonomous driving models show promising results, their\npractical deployment is often hindered by large model sizes, a reliance on\nexpensive LiDAR sensors and computationally intensive BEV feature\nrepresentations. This limits their scalability, especially for mass-market\nvehicles equipped only with cameras. To address these challenges, we propose\nPRIX (Plan from Raw Pixels). Our novel and efficient end-to-end driving\narchitecture operates using only camera data, without explicit BEV\nrepresentation and forgoing the need for LiDAR. PRIX leverages a visual feature\nextractor coupled with a generative planning head to predict safe trajectories\nfrom raw pixel inputs directly. A core component of our architecture is the\nContext-aware Recalibration Transformer (CaRT), a novel module designed to\neffectively enhance multi-level visual features for more robust planning. We\ndemonstrate through comprehensive experiments that PRIX achieves\nstate-of-the-art performance on the NavSim and nuScenes benchmarks, matching\nthe capabilities of larger, multimodal diffusion planners while being\nsignificantly more efficient in terms of inference speed and model size, making\nit a practical solution for real-world deployment. Our work is open-source and\nthe code will be at https://maxiuw.github.io/prix.",
        "url": "http://arxiv.org/abs/2507.17596v2",
        "published_date": "2025-07-23T15:28:23+00:00",
        "updated_date": "2025-07-24T11:04:42+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.LG",
            "cs.RO"
        ],
        "authors": [
            "Maciej K. Wozniak",
            "Lianhang Liu",
            "Yixi Cai",
            "Patric Jensfelt"
        ]
    },
    {
        "title": "RemixFusion: Residual-based Mixed Representation for Large-scale Online RGB-D Reconstruction",
        "summary": "The introduction of the neural implicit representation has notably propelled\nthe advancement of online dense reconstruction techniques. Compared to\ntraditional explicit representations, such as TSDF, it improves the mapping\ncompleteness and memory efficiency. However, the lack of reconstruction details\nand the time-consuming learning of neural representations hinder the widespread\napplication of neural-based methods to large-scale online reconstruction. We\nintroduce RemixFusion, a novel residual-based mixed representation for scene\nreconstruction and camera pose estimation dedicated to high-quality and\nlarge-scale online RGB-D reconstruction. In particular, we propose a\nresidual-based map representation comprised of an explicit coarse TSDF grid and\nan implicit neural module that produces residuals representing fine-grained\ndetails to be added to the coarse grid. Such mixed representation allows for\ndetail-rich reconstruction with bounded time and memory budget, contrasting\nwith the overly-smoothed results by the purely implicit representations, thus\npaving the way for high-quality camera tracking. Furthermore, we extend the\nresidual-based representation to handle multi-frame joint pose optimization via\nbundle adjustment (BA). In contrast to the existing methods, which optimize\nposes directly, we opt to optimize pose changes. Combined with a novel\ntechnique for adaptive gradient amplification, our method attains better\noptimization convergence and global optimality. Furthermore, we adopt a local\nmoving volume to factorize the mixed scene representation with a\ndivide-and-conquer design to facilitate efficient online learning in our\nresidual-based framework. Extensive experiments demonstrate that our method\nsurpasses all state-of-the-art ones, including those based either on explicit\nor implicit representations, in terms of the accuracy of both mapping and\ntracking on large-scale scenes.",
        "url": "http://arxiv.org/abs/2507.17594v2",
        "published_date": "2025-07-23T15:27:09+00:00",
        "updated_date": "2025-07-28T04:36:23+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yuqing Lan",
            "Chenyang Zhu",
            "Shuaifeng Zhi",
            "Jiazhao Zhang",
            "Zhoufeng Wang",
            "Renjiao Yi",
            "Yijie Wang",
            "Kai Xu"
        ]
    },
    {
        "title": "Fuzzy Theory in Computer Vision: A Review",
        "summary": "Computer vision applications are omnipresent nowadays. The current paper\nexplores the use of fuzzy logic in computer vision, stressing its role in\nhandling uncertainty, noise, and imprecision in image data. Fuzzy logic is able\nto model gradual transitions and human-like reasoning and provides a promising\napproach to computer vision. Fuzzy approaches offer a way to improve object\nrecognition, image segmentation, and feature extraction by providing more\nadaptable and interpretable solutions compared to traditional methods. We\ndiscuss key fuzzy techniques, including fuzzy clustering, fuzzy inference\nsystems, type-2 fuzzy sets, and fuzzy rule-based decision-making. The paper\nalso discusses various applications, including medical imaging, autonomous\nsystems, and industrial inspection. Additionally, we explore the integration of\nfuzzy logic with deep learning models such as convolutional neural networks\n(CNNs) to enhance performance in complex vision tasks. Finally, we examine\nemerging trends such as hybrid fuzzy-deep learning models and explainable AI.",
        "url": "http://arxiv.org/abs/2507.18660v1",
        "published_date": "2025-07-23T15:23:09+00:00",
        "updated_date": "2025-07-23T15:23:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Adilet Yerkin",
            "Ayan Igali",
            "Elnara Kadyrgali",
            "Maksat Shagyrov",
            "Malika Ziyada",
            "Muragul Muratbekova",
            "Pakizar Shamoi"
        ]
    },
    {
        "title": "Dual-branch Prompting for Multimodal Machine Translation",
        "summary": "Multimodal Machine Translation (MMT) typically enhances text-only translation\nby incorporating aligned visual features. Despite the remarkable progress,\nstate-of-the-art MMT approaches often rely on paired image-text inputs at\ninference and are sensitive to irrelevant visual noise, which limits their\nrobustness and practical applicability. To address these issues, we propose\nD2P-MMT, a diffusion-based dual-branch prompting framework for robust\nvision-guided translation. Specifically, D2P-MMT requires only the source text\nand a reconstructed image generated by a pre-trained diffusion model, which\nnaturally filters out distracting visual details while preserving semantic\ncues. During training, the model jointly learns from both authentic and\nreconstructed images using a dual-branch prompting strategy, encouraging rich\ncross-modal interactions. To bridge the modality gap and mitigate\ntraining-inference discrepancies, we introduce a distributional alignment loss\nthat enforces consistency between the output distributions of the two branches.\nExtensive experiments on the Multi30K dataset demonstrate that D2P-MMT achieves\nsuperior translation performance compared to existing state-of-the-art\napproaches.",
        "url": "http://arxiv.org/abs/2507.17588v1",
        "published_date": "2025-07-23T15:22:51+00:00",
        "updated_date": "2025-07-23T15:22:51+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Jie Wang",
            "Zhendong Yang",
            "Liansong Zong",
            "Xiaobo Zhang",
            "Dexian Wang",
            "Ji Zhang"
        ]
    },
    {
        "title": "From Scan to Action: Leveraging Realistic Scans for Embodied Scene Understanding",
        "summary": "Real-world 3D scene-level scans offer realism and can enable better\nreal-world generalizability for downstream applications. However, challenges\nsuch as data volume, diverse annotation formats, and tool compatibility limit\ntheir use. This paper demonstrates a methodology to effectively leverage these\nscans and their annotations. We propose a unified annotation integration using\nUSD, with application-specific USD flavors. We identify challenges in utilizing\nholistic real-world scan datasets and present mitigation strategies. The\nefficacy of our approach is demonstrated through two downstream applications:\nLLM-based scene editing, enabling effective LLM understanding and adaptation of\nthe data (80% success), and robotic simulation, achieving an 87% success rate\nin policy learning.",
        "url": "http://arxiv.org/abs/2507.17585v1",
        "published_date": "2025-07-23T15:20:31+00:00",
        "updated_date": "2025-07-23T15:20:31+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Anna-Maria Halacheva",
            "Jan-Nico Zaech",
            "Sombit Dey",
            "Luc Van Gool",
            "Danda Pani Paudel"
        ]
    },
    {
        "title": "Boosting Ray Search Procedure of Hard-label Attacks with Transfer-based Priors",
        "summary": "One of the most practical and challenging types of black-box adversarial\nattacks is the hard-label attack, where only the top-1 predicted label is\navailable. One effective approach is to search for the optimal ray direction\nfrom the benign image that minimizes the $\\ell_p$-norm distance to the\nadversarial region. The unique advantage of this approach is that it transforms\nthe hard-label attack into a continuous optimization problem. The objective\nfunction value is the ray's radius, which can be obtained via binary search at\na high query cost. Existing methods use a \"sign trick\" in gradient estimation\nto reduce the number of queries. In this paper, we theoretically analyze the\nquality of this gradient estimation and propose a novel prior-guided approach\nto improve ray search efficiency both theoretically and empirically.\nSpecifically, we utilize the transfer-based priors from surrogate models, and\nour gradient estimators appropriately integrate them by approximating the\nprojection of the true gradient onto the subspace spanned by these priors and\nrandom directions, in a query-efficient manner. We theoretically derive the\nexpected cosine similarities between the obtained gradient estimators and the\ntrue gradient, and demonstrate the improvement achieved by incorporating\npriors. Extensive experiments on the ImageNet and CIFAR-10 datasets show that\nour approach significantly outperforms 11 state-of-the-art methods in terms of\nquery efficiency.",
        "url": "http://arxiv.org/abs/2507.17577v1",
        "published_date": "2025-07-23T15:11:25+00:00",
        "updated_date": "2025-07-23T15:11:25+00:00",
        "categories": [
            "cs.CV",
            "cs.CR",
            "cs.LG",
            "I.2.6; I.5.1; G.1.6"
        ],
        "authors": [
            "Chen Ma",
            "Xinjie Xu",
            "Shuyu Cheng",
            "Qi Xuan"
        ]
    },
    {
        "title": "An h-space Based Adversarial Attack for Protection Against Few-shot Personalization",
        "summary": "The versatility of diffusion models in generating customized images from few\nsamples raises significant privacy concerns, particularly regarding\nunauthorized modifications of private content. This concerning issue has\nrenewed the efforts in developing protection mechanisms based on adversarial\nattacks, which generate effective perturbations to poison diffusion models. Our\nwork is motivated by the observation that these models exhibit a high degree of\nabstraction within their semantic latent space (`h-space'), which encodes\ncritical high-level features for generating coherent and meaningful content. In\nthis paper, we propose a novel anti-customization approach, called HAAD\n(h-space based Adversarial Attack for Diffusion models), that leverages\nadversarial attacks to craft perturbations based on the h-space that can\nefficiently degrade the image generation process. Building upon HAAD, we\nfurther introduce a more efficient variant, HAAD-KV, that constructs\nperturbations solely based on the KV parameters of the h-space. This strategy\noffers a stronger protection, that is computationally less expensive. Despite\ntheir simplicity, our methods outperform state-of-the-art adversarial attacks,\nhighlighting their effectiveness.",
        "url": "http://arxiv.org/abs/2507.17554v1",
        "published_date": "2025-07-23T14:43:22+00:00",
        "updated_date": "2025-07-23T14:43:22+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Xide Xu",
            "Sandesh Kamath",
            "Muhammad Atif Butt",
            "Bogdan Raducanu"
        ]
    },
    {
        "title": "Constructing Ophthalmic MLLM for Positioning-diagnosis Collaboration Through Clinical Cognitive Chain Reasoning",
        "summary": "Multimodal large language models (MLLMs) demonstrate significant potential in\nthe field of medical diagnosis. However, they face critical challenges in\nspecialized domains such as ophthalmology, particularly the fragmentation of\nannotation granularity and inconsistencies in clinical reasoning logic, which\nhinder precise cross-modal understanding. This paper introduces FundusExpert,\nan ophthalmology-specific MLLM with integrated positioning-diagnosis reasoning\ncapabilities, along with FundusGen, a dataset constructed through the\nintelligent Fundus-Engine system. Fundus-Engine automates localization and\nleverages MLLM-based semantic expansion to integrate global disease\nclassification, local object detection, and fine-grained feature analysis\nwithin a single fundus image. Additionally, by constructing a clinically\naligned cognitive chain, it guides the model to generate interpretable\nreasoning paths. FundusExpert, fine-tuned with instruction data from FundusGen,\nachieves the best performance in ophthalmic question-answering tasks,\nsurpassing the average accuracy of the 40B MedRegA by 26.6%. It also excels in\nzero-shot report generation tasks, achieving a clinical consistency of 77.0%,\nsignificantly outperforming GPT-4o's 47.6%. Furthermore, we reveal a scaling\nlaw between data quality and model capability ($L \\propto N^{0.068}$),\ndemonstrating that the cognitive alignment annotations in FundusGen enhance\ndata utilization efficiency. By integrating region-level localization with\ndiagnostic reasoning chains, our work develops a scalable, clinically-aligned\nMLLM and explores a pathway toward bridging the visual-language gap in specific\nMLLMs. Our project can be found at https://github.com/MeteorElf/FundusExpert.",
        "url": "http://arxiv.org/abs/2507.17539v1",
        "published_date": "2025-07-23T14:19:30+00:00",
        "updated_date": "2025-07-23T14:19:30+00:00",
        "categories": [
            "cs.AI",
            "cs.CV",
            "eess.IV"
        ],
        "authors": [
            "Xinyao Liu",
            "Diping Song"
        ]
    },
    {
        "title": "Multi-modal Multi-task Pre-training for Improved Point Cloud Understanding",
        "summary": "Recent advances in multi-modal pre-training methods have shown promising\neffectiveness in learning 3D representations by aligning multi-modal features\nbetween 3D shapes and their corresponding 2D counterparts. However, existing\nmulti-modal pre-training frameworks primarily rely on a single pre-training\ntask to gather multi-modal data in 3D applications. This limitation prevents\nthe models from obtaining the abundant information provided by other relevant\ntasks, which can hinder their performance in downstream tasks, particularly in\ncomplex and diverse domains. In order to tackle this issue, we propose MMPT, a\nMulti-modal Multi-task Pre-training framework designed to enhance point cloud\nunderstanding. Specifically, three pre-training tasks are devised: (i)\nToken-level reconstruction (TLR) aims to recover masked point tokens, endowing\nthe model with representative learning abilities. (ii) Point-level\nreconstruction (PLR) is integrated to predict the masked point positions\ndirectly, and the reconstructed point cloud can be considered as a transformed\npoint cloud used in the subsequent task. (iii) Multi-modal contrastive learning\n(MCL) combines feature correspondences within and across modalities, thus\nassembling a rich learning signal from both 3D point cloud and 2D image\nmodalities in a self-supervised manner. Moreover, this framework operates\nwithout requiring any 3D annotations, making it scalable for use with large\ndatasets. The trained encoder can be effectively transferred to various\ndownstream tasks. To demonstrate its effectiveness, we evaluated its\nperformance compared to state-of-the-art methods in various discriminant and\ngenerative applications under widely-used benchmarks.",
        "url": "http://arxiv.org/abs/2507.17533v1",
        "published_date": "2025-07-23T14:13:14+00:00",
        "updated_date": "2025-07-23T14:13:14+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Liwen Liu",
            "Weidong Yang",
            "Lipeng Ma",
            "Ben Fei"
        ]
    },
    {
        "title": "STQE: Spatial-Temporal Quality Enhancement for G-PCC Compressed Dynamic Point Clouds",
        "summary": "Very few studies have addressed quality enhancement for compressed dynamic\npoint clouds. In particular, the effective exploitation of spatial-temporal\ncorrelations between point cloud frames remains largely unexplored. Addressing\nthis gap, we propose a spatial-temporal attribute quality enhancement (STQE)\nnetwork that exploits both spatial and temporal correlations to improve the\nvisual quality of G-PCC compressed dynamic point clouds. Our contributions\ninclude a recoloring-based motion compensation module that remaps reference\nattribute information to the current frame geometry to achieve precise\ninter-frame geometric alignment, a channel-aware temporal attention module that\ndynamically highlights relevant regions across bidirectional reference frames,\na Gaussian-guided neighborhood feature aggregation module that efficiently\ncaptures spatial dependencies between geometry and color attributes, and a\njoint loss function based on the Pearson correlation coefficient, designed to\nalleviate over-smoothing effects typical of point-wise mean squared error\noptimization. When applied to the latest G-PCC test model, STQE achieved\nimprovements of 0.855 dB, 0.682 dB, and 0.828 dB in delta PSNR, with\nBj{\\o}ntegaard Delta rate (BD-rate) reductions of -25.2%, -31.6%, and -32.5%\nfor the Luma, Cb, and Cr components, respectively.",
        "url": "http://arxiv.org/abs/2507.17522v1",
        "published_date": "2025-07-23T14:03:54+00:00",
        "updated_date": "2025-07-23T14:03:54+00:00",
        "categories": [
            "cs.CV",
            "eess.IV"
        ],
        "authors": [
            "Tian Guo",
            "Hui Yuan",
            "Xiaolong Mao",
            "Shiqi Jiang",
            "Raouf Hamzaoui",
            "Sam Kwong"
        ]
    },
    {
        "title": "InstructVLA: Vision-Language-Action Instruction Tuning from Understanding to Manipulation",
        "summary": "To operate effectively in the real world, robots must integrate multimodal\nreasoning with precise action generation. However, existing\nvision-language-action (VLA) models often sacrifice one for the other, narrow\ntheir abilities to task-specific manipulation data, and suffer catastrophic\nforgetting of pre-trained vision-language capabilities. To bridge this gap, we\nintroduce InstructVLA, an end-to-end VLA model that preserves the flexible\nreasoning of large vision-language models (VLMs) while delivering leading\nmanipulation performance. InstructVLA introduces a novel training paradigm,\nVision-Language-Action Instruction Tuning (VLA-IT), which employs multimodal\ntraining with mixture-of-experts adaptation to jointly optimize textual\nreasoning and action generation on both standard VLM corpora and a curated\n650K-sample VLA-IT dataset. On in-domain SimplerEnv tasks, InstructVLA achieves\n30.5% improvement over SpatialVLA. To evaluate generalization, we introduce\nSimplerEnv-Instruct, an 80-task benchmark requiring closed-loop control and\nhigh-level instruction understanding, where it outperforms a fine-tuned OpenVLA\nby 92% and an action expert aided by GPT-4o by 29%. Additionally, InstructVLA\nsurpasses baseline VLMs on multimodal tasks and exhibits inference-time scaling\nby leveraging textual reasoning to boost manipulation performance in both\nsimulated and real-world settings. These results demonstrate InstructVLA's\npotential for bridging intuitive and steerable human-robot interaction with\nefficient policy learning.",
        "url": "http://arxiv.org/abs/2507.17520v1",
        "published_date": "2025-07-23T13:57:06+00:00",
        "updated_date": "2025-07-23T13:57:06+00:00",
        "categories": [
            "cs.RO",
            "cs.CV"
        ],
        "authors": [
            "Shuai Yang",
            "Hao Li",
            "Yilun Chen",
            "Bin Wang",
            "Yang Tian",
            "Tai Wang",
            "Hanqing Wang",
            "Feng Zhao",
            "Yiyi Liao",
            "Jiangmiao Pang"
        ]
    },
    {
        "title": "URPO: A Unified Reward & Policy Optimization Framework for Large Language Models",
        "summary": "Large-scale alignment pipelines typically pair a policy model with a\nseparately trained reward model whose parameters remain frozen during\nreinforcement learning (RL). This separation creates a complex,\nresource-intensive pipeline and suffers from a performance ceiling due to a\nstatic reward signal. We propose a novel framework, Unified Reward & Policy\nOptimization (URPO), that unifies instruction-following (\"player\") and reward\nmodeling (\"referee\") within a single model and a single training phase. Our\nmethod recasts all alignment data-including preference pairs, verifiable\nreasoning, and open-ended instructions-into a unified generative format\noptimized by a single Group-Relative Policy Optimization (GRPO) loop. This\nenables the model to learn from ground-truth preferences and verifiable logic\nwhile simultaneously generating its own rewards for open-ended tasks.\nExperiments on the Qwen2.5-7B model demonstrate URPO's superiority. Our unified\nmodel significantly outperforms a strong baseline using a separate generative\nreward model, boosting the instruction-following score on AlpacaEval from 42.24\nto 44.84 and the composite reasoning average from 32.66 to 35.66. Furthermore,\nURPO cultivates a superior internal evaluator as a byproduct of training,\nachieving a RewardBench score of 85.15 and surpassing the dedicated reward\nmodel it replaces (83.55). By eliminating the need for a separate reward model\nand fostering a co-evolutionary dynamic between generation and evaluation, URPO\npresents a simpler, more efficient, and more effective path towards robustly\naligned language models.",
        "url": "http://arxiv.org/abs/2507.17515v1",
        "published_date": "2025-07-23T13:52:27+00:00",
        "updated_date": "2025-07-23T13:52:27+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Songshuo Lu",
            "Hua Wang",
            "Zhi Chen",
            "Yaohua Tang"
        ]
    },
    {
        "title": "Accelerating Parallel Diffusion Model Serving with Residual Compression",
        "summary": "Diffusion models produce realistic images and videos but require substantial\ncomputational resources, necessitating multi-accelerator parallelism for\nreal-time deployment. However, parallel inference introduces significant\ncommunication overhead from exchanging large activations between devices,\nlimiting efficiency and scalability. We present CompactFusion, a compression\nframework that significantly reduces communication while preserving generation\nquality. Our key observation is that diffusion activations exhibit strong\ntemporal redundancy-adjacent steps produce highly similar activations,\nsaturating bandwidth with near-duplicate data carrying little new information.\nTo address this inefficiency, we seek a more compact representation that\nencodes only the essential information. CompactFusion achieves this via\nResidual Compression that transmits only compressed residuals (step-wise\nactivation differences). Based on empirical analysis and theoretical\njustification, we show that it effectively removes redundant data, enabling\nsubstantial data reduction while maintaining high fidelity. We also integrate\nlightweight error feedback to prevent error accumulation. CompactFusion\nestablishes a new paradigm for parallel diffusion inference, delivering lower\nlatency and significantly higher generation quality than prior methods. On\n4xL20, it achieves 3.0x speedup while greatly improving fidelity. It also\nuniquely supports communication-heavy strategies like sequence parallelism on\nslow networks, achieving 6.7x speedup over prior overlap-based method.\nCompactFusion applies broadly across diffusion models and parallel settings,\nand integrates easily without requiring pipeline rework. Portable\nimplementation demonstrated on xDiT is publicly available at\nhttps://github.com/Cobalt-27/CompactFusion",
        "url": "http://arxiv.org/abs/2507.17511v1",
        "published_date": "2025-07-23T13:49:25+00:00",
        "updated_date": "2025-07-23T13:49:25+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jiajun Luo",
            "Yicheng Xiao",
            "Jianru Xu",
            "Yangxiu You",
            "Rongwei Lu",
            "Chen Tang",
            "Jingyan Jiang",
            "Zhi Wang"
        ]
    },
    {
        "title": "Illicit object detection in X-ray imaging using deep learning techniques: A comparative evaluation",
        "summary": "Automated X-ray inspection is crucial for efficient and unobtrusive security\nscreening in various public settings. However, challenges such as object\nocclusion, variations in the physical properties of items, diversity in X-ray\nscanning devices, and limited training data hinder accurate and reliable\ndetection of illicit items. Despite the large body of research in the field,\nreported experimental evaluations are often incomplete, with frequently\nconflicting outcomes. To shed light on the research landscape and facilitate\nfurther research, a systematic, detailed, and thorough comparative evaluation\nof recent Deep Learning (DL)-based methods for X-ray object detection is\nconducted. For this, a comprehensive evaluation framework is developed,\ncomposed of: a) Six recent, large-scale, and widely used public datasets for\nX-ray illicit item detection (OPIXray, CLCXray, SIXray, EDS, HiXray, and\nPIDray), b) Ten different state-of-the-art object detection schemes covering\nall main categories in the literature, including generic Convolutional Neural\nNetwork (CNN), custom CNN, generic transformer, and hybrid CNN-transformer\narchitectures, and c) Various detection (mAP50 and mAP50:95) and\ntime/computational-complexity (inference time (ms), parameter size (M), and\ncomputational load (GFLOPS)) metrics. A thorough analysis of the results leads\nto critical observations and insights, emphasizing key aspects such as: a)\nOverall behavior of the object detection schemes, b) Object-level detection\nperformance, c) Dataset-specific observations, and d) Time efficiency and\ncomputational complexity analysis. To support reproducibility of the reported\nexperimental results, the evaluation code and model weights are made publicly\navailable at https://github.com/jgenc/xray-comparative-evaluation.",
        "url": "http://arxiv.org/abs/2507.17508v1",
        "published_date": "2025-07-23T13:47:33+00:00",
        "updated_date": "2025-07-23T13:47:33+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jorgen Cani",
            "Christos Diou",
            "Spyridon Evangelatos",
            "Vasileios Argyriou",
            "Panagiotis Radoglou-Grammatikis",
            "Panagiotis Sarigiannidis",
            "Iraklis Varlamis",
            "Georgios Th. Papadopoulos"
        ]
    },
    {
        "title": "DNT: a Deeply Normalized Transformer that can be trained by Momentum SGD",
        "summary": "Transformers have become the de facto backbone of modern deep learning, yet\ntheir training typically demands an advanced optimizer with adaptive learning\nrate like AdamW, rather than a momentum SGDW (mSGDW). Previous works show that\nit is mainly due to a heavy-tailed distribution of the gradients. In this\npaper, we introduce a Deeply Normalized Transformer (DNT), which is\nmeticulously engineered to overcome this limitation enabling seamless training\nwith vanilla mSGDW while yielding comparable performance to the Transformers\ntrained via AdamW. To be specific, in DNT, we strategically integrate\nnormalization techniques at proper positions in the Transformers to effectively\nmodulate the Jacobian matrices of each layer, balance the influence of weights,\nactivations, and their interactions, and thus enable the distributions of\ngradients concentrated. We provide both theoretical justifications of the\nnormalization technique used in our DNT and extensive empirical evaluation on\ntwo popular Transformer architectures to validate that: a) DNT outperforms its\ncounterparts (\\ie, ViT and GPT), and b) DNT can be effectively trained with\nvanilla mSGDW.",
        "url": "http://arxiv.org/abs/2507.17501v1",
        "published_date": "2025-07-23T13:37:23+00:00",
        "updated_date": "2025-07-23T13:37:23+00:00",
        "categories": [
            "cs.LG",
            "cs.CL",
            "cs.CV"
        ],
        "authors": [
            "Xianbiao Qi",
            "Marco Chen",
            "Wenjie Xiao",
            "Jiaquan Ye",
            "Yelin He",
            "Chun-Guang Li",
            "Zhouchen Lin"
        ]
    },
    {
        "title": "DFDNet: Dynamic Frequency-Guided De-Flare Network",
        "summary": "Strong light sources in nighttime photography frequently produce flares in\nimages, significantly degrading visual quality and impacting the performance of\ndownstream tasks. While some progress has been made, existing methods continue\nto struggle with removing large-scale flare artifacts and repairing structural\ndamage in regions near the light source. We observe that these challenging\nflare artifacts exhibit more significant discrepancies from the reference\nimages in the frequency domain compared to the spatial domain. Therefore, this\npaper presents a novel dynamic frequency-guided deflare network (DFDNet) that\ndecouples content information from flare artifacts in the frequency domain,\neffectively removing large-scale flare artifacts. Specifically, DFDNet consists\nmainly of a global dynamic frequency-domain guidance (GDFG) module and a local\ndetail guidance module (LDGM). The GDFG module guides the network to perceive\nthe frequency characteristics of flare artifacts by dynamically optimizing\nglobal frequency domain features, effectively separating flare information from\ncontent information. Additionally, we design an LDGM via a contrastive learning\nstrategy that aligns the local features of the light source with the reference\nimage, reduces local detail damage from flare removal, and improves\nfine-grained image restoration. The experimental results demonstrate that the\nproposed method outperforms existing state-of-the-art methods in terms of\nperformance. The code is available at\n\\href{https://github.com/AXNing/DFDNet}{https://github.com/AXNing/DFDNet}.",
        "url": "http://arxiv.org/abs/2507.17489v1",
        "published_date": "2025-07-23T13:14:59+00:00",
        "updated_date": "2025-07-23T13:14:59+00:00",
        "categories": [
            "cs.CV",
            "eess.IV"
        ],
        "authors": [
            "Minglong Xue",
            "Aoxiang Ning",
            "Shivakumara Palaiahnakote",
            "Mingliang Zhou"
        ]
    },
    {
        "title": "Unsupervised anomaly detection using Bayesian flow networks: application to brain FDG PET in the context of Alzheimer's disease",
        "summary": "Unsupervised anomaly detection (UAD) plays a crucial role in neuroimaging for\nidentifying deviations from healthy subject data and thus facilitating the\ndiagnosis of neurological disorders. In this work, we focus on Bayesian flow\nnetworks (BFNs), a novel class of generative models, which have not yet been\napplied to medical imaging or anomaly detection. BFNs combine the strength of\ndiffusion frameworks and Bayesian inference. We introduce AnoBFN, an extension\nof BFNs for UAD, designed to: i) perform conditional image generation under\nhigh levels of spatially correlated noise, and ii) preserve subject specificity\nby incorporating a recursive feedback from the input image throughout the\ngenerative process. We evaluate AnoBFN on the challenging task of Alzheimer's\ndisease-related anomaly detection in FDG PET images. Our approach outperforms\nother state-of-the-art methods based on VAEs (beta-VAE), GANs (f-AnoGAN), and\ndiffusion models (AnoDDPM), demonstrating its effectiveness at detecting\nanomalies while reducing false positive rates.",
        "url": "http://arxiv.org/abs/2507.17486v1",
        "published_date": "2025-07-23T13:09:57+00:00",
        "updated_date": "2025-07-23T13:09:57+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Hugues Roy",
            "Reuben Dorent",
            "Ninon Burgos"
        ]
    },
    {
        "title": "SRMambaV2: Biomimetic Attention for Sparse Point Cloud Upsampling in Autonomous Driving",
        "summary": "Upsampling LiDAR point clouds in autonomous driving scenarios remains a\nsignificant challenge due to the inherent sparsity and complex 3D structures of\nthe data. Recent studies have attempted to address this problem by converting\nthe complex 3D spatial scenes into 2D image super-resolution tasks. However,\ndue to the sparse and blurry feature representation of range images, accurately\nreconstructing detailed and complex spatial topologies remains a major\ndifficulty. To tackle this, we propose a novel sparse point cloud upsampling\nmethod named SRMambaV2, which enhances the upsampling accuracy in long-range\nsparse regions while preserving the overall geometric reconstruction quality.\nSpecifically, inspired by human driver visual perception, we design a\nbiomimetic 2D selective scanning self-attention (2DSSA) mechanism to model the\nfeature distribution in distant sparse areas. Meanwhile, we introduce a\ndual-branch network architecture to enhance the representation of sparse\nfeatures. In addition, we introduce a progressive adaptive loss (PAL) function\nto further refine the reconstruction of fine-grained details during the\nupsampling process. Experimental results demonstrate that SRMambaV2 achieves\nsuperior performance in both qualitative and quantitative evaluations,\nhighlighting its effectiveness and practical value in automotive sparse point\ncloud upsampling tasks.",
        "url": "http://arxiv.org/abs/2507.17479v1",
        "published_date": "2025-07-23T13:01:19+00:00",
        "updated_date": "2025-07-23T13:01:19+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Chuang Chen",
            "Xiaolin Qin",
            "Jing Hu",
            "Wenyi Ge"
        ]
    },
    {
        "title": "Probing Vision-Language Understanding through the Visual Entailment Task: promises and pitfalls",
        "summary": "This study investigates the extent to which the Visual Entailment (VE) task\nserves as a reliable probe of vision-language understanding in multimodal\nlanguage models, using the LLaMA 3.2 11B Vision model as a test case. Beyond\nreporting performance metrics, we aim to interpret what these results reveal\nabout the underlying possibilities and limitations of the VE task. We conduct a\nseries of experiments across zero-shot, few-shot, and fine-tuning settings,\nexploring how factors such as prompt design, the number and order of in-context\nexamples and access to visual information might affect VE performance. To\nfurther probe the reasoning processes of the model, we used explanation-based\nevaluations. Results indicate that three-shot inference outperforms the\nzero-shot baselines. However, additional examples introduce more noise than\nthey provide benefits. Additionally, the order of the labels in the prompt is a\ncritical factor that influences the predictions. In the absence of visual\ninformation, the model has a strong tendency to hallucinate and imagine\ncontent, raising questions about the model's over-reliance on linguistic\npriors. Fine-tuning yields strong results, achieving an accuracy of 83.3% on\nthe e-SNLI-VE dataset and outperforming the state-of-the-art OFA-X model.\nAdditionally, the explanation evaluation demonstrates that the fine-tuned model\nprovides semantically meaningful explanations similar to those of humans, with\na BERTScore F1-score of 89.2%. We do, however, find comparable BERTScore\nresults in experiments with limited vision, questioning the visual grounding of\nthis task. Overall, our results highlight both the utility and limitations of\nVE as a diagnostic task for vision-language understanding and point to\ndirections for refining multimodal evaluation methods.",
        "url": "http://arxiv.org/abs/2507.17467v1",
        "published_date": "2025-07-23T12:46:51+00:00",
        "updated_date": "2025-07-23T12:46:51+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Elena Pitta",
            "Tom Kouwenhoven",
            "Tessa Verhoef"
        ]
    },
    {
        "title": "ERMV: Editing 4D Robotic Multi-view images to enhance embodied agents",
        "summary": "Robot imitation learning relies on 4D multi-view sequential images. However,\nthe high cost of data collection and the scarcity of high-quality data severely\nconstrain the generalization and application of embodied intelligence policies\nlike Vision-Language-Action (VLA) models. Data augmentation is a powerful\nstrategy to overcome data scarcity, but methods for editing 4D multi-view\nsequential images for manipulation tasks are currently lacking. Thus, we\npropose ERMV (Editing Robotic Multi-View 4D data), a novel data augmentation\nframework that efficiently edits an entire multi-view sequence based on\nsingle-frame editing and robot state conditions. This task presents three core\nchallenges: (1) maintaining geometric and appearance consistency across dynamic\nviews and long time horizons; (2) expanding the working window with low\ncomputational costs; and (3) ensuring the semantic integrity of critical\nobjects like the robot arm. ERMV addresses these challenges through a series of\ninnovations. First, to ensure spatio-temporal consistency in motion blur, we\nintroduce a novel Epipolar Motion-Aware Attention (EMA-Attn) mechanism that\nlearns pixel shift caused by movement before applying geometric constraints.\nSecond, to maximize the editing working window, ERMV pioneers a Sparse\nSpatio-Temporal (STT) module, which decouples the temporal and spatial views\nand remodels a single-frame multi-view problem through sparse sampling of the\nviews to reduce computational demands. Third, to alleviate error accumulation,\nwe incorporate a feedback intervention Mechanism, which uses a Multimodal Large\nLanguage Model (MLLM) to check editing inconsistencies and request targeted\nexpert guidance only when necessary. Extensive experiments demonstrate that\nERMV-augmented data significantly boosts the robustness and generalization of\nVLA models in both simulated and real-world environments.",
        "url": "http://arxiv.org/abs/2507.17462v1",
        "published_date": "2025-07-23T12:41:11+00:00",
        "updated_date": "2025-07-23T12:41:11+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Chang Nie",
            "Guangming Wang",
            "Zhe Lie",
            "Hesheng Wang"
        ]
    },
    {
        "title": "Dynamic Scoring with Enhanced Semantics for Training-Free Human-Object Interaction Detection",
        "summary": "Human-Object Interaction (HOI) detection aims to identify humans and objects\nwithin images and interpret their interactions. Existing HOI methods rely\nheavily on large datasets with manual annotations to learn interactions from\nvisual cues. These annotations are labor-intensive to create, prone to\ninconsistency, and limit scalability to new domains and rare interactions. We\nargue that recent advances in Vision-Language Models (VLMs) offer untapped\npotential, particularly in enhancing interaction representation. While prior\nwork has injected such potential and even proposed training-free methods, there\nremain key gaps. Consequently, we propose a novel training-free HOI detection\nframework for Dynamic Scoring with enhanced semantics (DYSCO) that effectively\nutilizes textual and visual interaction representations within a multimodal\nregistry, enabling robust and nuanced interaction understanding. This registry\nincorporates a small set of visual cues and uses innovative interaction\nsignatures to improve the semantic alignment of verbs, facilitating effective\ngeneralization to rare interactions. Additionally, we propose a unique\nmulti-head attention mechanism that adaptively weights the contributions of the\nvisual and textual features. Experimental results demonstrate that our DYSCO\nsurpasses training-free state-of-the-art models and is competitive with\ntraining-based approaches, particularly excelling in rare interactions. Code is\navailable at https://github.com/francescotonini/dysco.",
        "url": "http://arxiv.org/abs/2507.17456v1",
        "published_date": "2025-07-23T12:30:19+00:00",
        "updated_date": "2025-07-23T12:30:19+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Francesco Tonini",
            "Lorenzo Vaquero",
            "Alessandro Conti",
            "Cigdem Beyan",
            "Elisa Ricci"
        ]
    },
    {
        "title": "VLM-Guided Visual Place Recognition for Planet-Scale Geo-Localization",
        "summary": "Geo-localization from a single image at planet scale (essentially an advanced\nor extreme version of the kidnapped robot problem) is a fundamental and\nchallenging task in applications such as navigation, autonomous driving and\ndisaster response due to the vast diversity of locations, environmental\nconditions, and scene variations. Traditional retrieval-based methods for\ngeo-localization struggle with scalability and perceptual aliasing, while\nclassification-based approaches lack generalization and require extensive\ntraining data. Recent advances in vision-language models (VLMs) offer a\npromising alternative by leveraging contextual understanding and reasoning.\nHowever, while VLMs achieve high accuracy, they are often prone to\nhallucinations and lack interpretability, making them unreliable as standalone\nsolutions. In this work, we propose a novel hybrid geo-localization framework\nthat combines the strengths of VLMs with retrieval-based visual place\nrecognition (VPR) methods. Our approach first leverages a VLM to generate a\nprior, effectively guiding and constraining the retrieval search space. We then\nemploy a retrieval step, followed by a re-ranking mechanism that selects the\nmost geographically plausible matches based on feature similarity and proximity\nto the initially estimated coordinates. We evaluate our approach on multiple\ngeo-localization benchmarks and show that it consistently outperforms prior\nstate-of-the-art methods, particularly at street (up to 4.51%) and city level\n(up to 13.52%). Our results demonstrate that VLM-generated geographic priors in\ncombination with VPR lead to scalable, robust, and accurate geo-localization\nsystems.",
        "url": "http://arxiv.org/abs/2507.17455v1",
        "published_date": "2025-07-23T12:23:03+00:00",
        "updated_date": "2025-07-23T12:23:03+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Sania Waheed",
            "Na Min An",
            "Michael Milford",
            "Sarvapali D. Ramchurn",
            "Shoaib Ehsan"
        ]
    },
    {
        "title": "Dynamic-DINO: Fine-Grained Mixture of Experts Tuning for Real-time Open-Vocabulary Object Detection",
        "summary": "The Mixture of Experts (MoE) architecture has excelled in Large\nVision-Language Models (LVLMs), yet its potential in real-time open-vocabulary\nobject detectors, which also leverage large-scale vision-language datasets but\nsmaller models, remains unexplored. This work investigates this domain,\nrevealing intriguing insights. In the shallow layers, experts tend to cooperate\nwith diverse peers to expand the search space. While in the deeper layers,\nfixed collaborative structures emerge, where each expert maintains 2-3 fixed\npartners and distinct expert combinations are specialized in processing\nspecific patterns. Concretely, we propose Dynamic-DINO, which extends Grounding\nDINO 1.5 Edge from a dense model to a dynamic inference framework via an\nefficient MoE-Tuning strategy. Additionally, we design a granularity\ndecomposition mechanism to decompose the Feed-Forward Network (FFN) of base\nmodel into multiple smaller expert networks, expanding the subnet search space.\nTo prevent performance degradation at the start of fine-tuning, we further\npropose a pre-trained weight allocation strategy for the experts, coupled with\na specific router initialization. During inference, only the input-relevant\nexperts are activated to form a compact subnet. Experiments show that,\npretrained with merely 1.56M open-source data, Dynamic-DINO outperforms\nGrounding DINO 1.5 Edge, pretrained on the private Grounding20M dataset.",
        "url": "http://arxiv.org/abs/2507.17436v1",
        "published_date": "2025-07-23T11:51:06+00:00",
        "updated_date": "2025-07-23T11:51:06+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yehao Lu",
            "Minghe Weng",
            "Zekang Xiao",
            "Rui Jiang",
            "Wei Su",
            "Guangcong Zheng",
            "Ping Lu",
            "Xi Li"
        ]
    },
    {
        "title": "CAPRI-CT: Causal Analysis and Predictive Reasoning for Image Quality Optimization in Computed Tomography",
        "summary": "In computed tomography (CT), achieving high image quality while minimizing\nradiation exposure remains a key clinical challenge. This paper presents\nCAPRI-CT, a novel causal-aware deep learning framework for Causal Analysis and\nPredictive Reasoning for Image Quality Optimization in CT imaging. CAPRI-CT\nintegrates image data with acquisition metadata (such as tube voltage, tube\ncurrent, and contrast agent types) to model the underlying causal relationships\nthat influence image quality. An ensemble of Variational Autoencoders (VAEs) is\nemployed to extract meaningful features and generate causal representations\nfrom observational data, including CT images and associated imaging parameters.\nThese input features are fused to predict the Signal-to-Noise Ratio (SNR) and\nsupport counterfactual inference, enabling what-if simulations, such as changes\nin contrast agents (types and concentrations) or scan parameters. CAPRI-CT is\ntrained and validated using an ensemble learning approach, achieving strong\npredictive performance. By facilitating both prediction and interpretability,\nCAPRI-CT provides actionable insights that could help radiologists and\ntechnicians design more efficient CT protocols without repeated physical scans.\nThe source code and dataset are publicly available at\nhttps://github.com/SnehaGeorge22/capri-ct.",
        "url": "http://arxiv.org/abs/2507.17420v1",
        "published_date": "2025-07-23T11:23:02+00:00",
        "updated_date": "2025-07-23T11:23:02+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Sneha George Gnanakalavathy",
            "Hairil Abdul Razak",
            "Robert Meertens",
            "Jonathan E. Fieldsend",
            "Xujiong Ye",
            "Mohammed M. Abdelsamea"
        ]
    },
    {
        "title": "Content-based 3D Image Retrieval and a ColBERT-inspired Re-ranking for Tumor Flagging and Staging",
        "summary": "The increasing volume of medical images poses challenges for radiologists in\nretrieving relevant cases. Content-based image retrieval (CBIR) systems offer\npotential for efficient access to similar cases, yet lack standardized\nevaluation and comprehensive studies. Building on prior studies for tumor\ncharacterization via CBIR, this study advances CBIR research for volumetric\nmedical images through three key contributions: (1) a framework eliminating\nreliance on pre-segmented data and organ-specific datasets, aligning with large\nand unstructured image archiving systems, i.e. PACS in clinical practice; (2)\nintroduction of C-MIR, a novel volumetric re-ranking method adapting ColBERT's\ncontextualized late interaction mechanism for 3D medical imaging; (3)\ncomprehensive evaluation across four tumor sites using three feature extractors\nand three database configurations. Our evaluations highlight the significant\nadvantages of C-MIR. We demonstrate the successful adaptation of the late\ninteraction principle to volumetric medical images, enabling effective\ncontext-aware re-ranking. A key finding is C-MIR's ability to effectively\nlocalize the region of interest, eliminating the need for pre-segmentation of\ndatasets and offering a computationally efficient alternative to systems\nrelying on expensive data enrichment steps. C-MIR demonstrates promising\nimprovements in tumor flagging, achieving improved performance, particularly\nfor colon and lung tumors (p<0.05). C-MIR also shows potential for improving\ntumor staging, warranting further exploration of its capabilities. Ultimately,\nour work seeks to bridge the gap between advanced retrieval techniques and\ntheir practical applications in healthcare, paving the way for improved\ndiagnostic processes.",
        "url": "http://arxiv.org/abs/2507.17412v1",
        "published_date": "2025-07-23T11:12:52+00:00",
        "updated_date": "2025-07-23T11:12:52+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.IR"
        ],
        "authors": [
            "Farnaz Khun Jush",
            "Steffen Vogler",
            "Matthias Lenga"
        ]
    },
    {
        "title": "Physics-based Human Pose Estimation from a Single Moving RGB Camera",
        "summary": "Most monocular and physics-based human pose tracking methods, while achieving\nstate-of-the-art results, suffer from artifacts when the scene does not have a\nstrictly flat ground plane or when the camera is moving. Moreover, these\nmethods are often evaluated on in-the-wild real world videos without\nground-truth data or on synthetic datasets, which fail to model the real world\nlight transport, camera motion, and pose-induced appearance and geometry\nchanges. To tackle these two problems, we introduce MoviCam, the first\nnon-synthetic dataset containing ground-truth camera trajectories of a\ndynamically moving monocular RGB camera, scene geometry, and 3D human motion\nwith human-scene contact labels. Additionally, we propose PhysDynPose, a\nphysics-based method that incorporates scene geometry and physical constraints\nfor more accurate human motion tracking in case of camera motion and non-flat\nscenes. More precisely, we use a state-of-the-art kinematics estimator to\nobtain the human pose and a robust SLAM method to capture the dynamic camera\ntrajectory, enabling the recovery of the human pose in the world frame. We then\nrefine the kinematic pose estimate using our scene-aware physics optimizer.\nFrom our new benchmark, we found that even state-of-the-art methods struggle\nwith this inherently challenging setting, i.e. a moving camera and non-planar\nenvironments, while our method robustly estimates both human and camera poses\nin world coordinates.",
        "url": "http://arxiv.org/abs/2507.17406v1",
        "published_date": "2025-07-23T11:04:30+00:00",
        "updated_date": "2025-07-23T11:04:30+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Ayce Idil Aytekin",
            "Chuqiao Li",
            "Diogo Luvizon",
            "Rishabh Dabral",
            "Martin Oswald",
            "Marc Habermann",
            "Christian Theobalt"
        ]
    },
    {
        "title": "HLFormer: Enhancing Partially Relevant Video Retrieval with Hyperbolic Learning",
        "summary": "Partially Relevant Video Retrieval (PRVR) addresses the critical challenge of\nmatching untrimmed videos with text queries describing only partial content.\nExisting methods suffer from geometric distortion in Euclidean space that\nsometimes misrepresents the intrinsic hierarchical structure of videos and\noverlooks certain hierarchical semantics, ultimately leading to suboptimal\ntemporal modeling. To address this issue, we propose the first hyperbolic\nmodeling framework for PRVR, namely HLFormer, which leverages hyperbolic space\nlearning to compensate for the suboptimal hierarchical modeling capabilities of\nEuclidean space. Specifically, HLFormer integrates the Lorentz Attention Block\nand Euclidean Attention Block to encode video embeddings in hybrid spaces,\nusing the Mean-Guided Adaptive Interaction Module to dynamically fuse features.\nAdditionally, we introduce a Partial Order Preservation Loss to enforce \"text <\nvideo\" hierarchy through Lorentzian cone constraints. This approach further\nenhances cross-modal matching by reinforcing partial relevance between video\ncontent and text queries. Extensive experiments show that HLFormer outperforms\nstate-of-the-art methods. Code is released at\nhttps://github.com/lijun2005/ICCV25-HLFormer.",
        "url": "http://arxiv.org/abs/2507.17402v2",
        "published_date": "2025-07-23T10:59:46+00:00",
        "updated_date": "2025-07-27T08:26:55+00:00",
        "categories": [
            "cs.CV",
            "cs.IR",
            "cs.MM"
        ],
        "authors": [
            "Jun Li",
            "Jinpeng Wang",
            "Chaolei Tan",
            "Niu Lian",
            "Long Chen",
            "Yaowei Wang",
            "Min Zhang",
            "Shu-Tao Xia",
            "Bin Chen"
        ]
    },
    {
        "title": "HiProbe-VAD: Video Anomaly Detection via Hidden States Probing in Tuning-Free Multimodal LLMs",
        "summary": "Video Anomaly Detection (VAD) aims to identify and locate deviations from\nnormal patterns in video sequences. Traditional methods often struggle with\nsubstantial computational demands and a reliance on extensive labeled datasets,\nthereby restricting their practical applicability. To address these\nconstraints, we propose HiProbe-VAD, a novel framework that leverages\npre-trained Multimodal Large Language Models (MLLMs) for VAD without requiring\nfine-tuning. In this paper, we discover that the intermediate hidden states of\nMLLMs contain information-rich representations, exhibiting higher sensitivity\nand linear separability for anomalies compared to the output layer. To\ncapitalize on this, we propose a Dynamic Layer Saliency Probing (DLSP)\nmechanism that intelligently identifies and extracts the most informative\nhidden states from the optimal intermediate layer during the MLLMs reasoning.\nThen a lightweight anomaly scorer and temporal localization module efficiently\ndetects anomalies using these extracted hidden states and finally generate\nexplanations. Experiments on the UCF-Crime and XD-Violence datasets demonstrate\nthat HiProbe-VAD outperforms existing training-free and most traditional\napproaches. Furthermore, our framework exhibits remarkable cross-model\ngeneralization capabilities in different MLLMs without any tuning, unlocking\nthe potential of pre-trained MLLMs for video anomaly detection and paving the\nway for more practical and scalable solutions.",
        "url": "http://arxiv.org/abs/2507.17394v1",
        "published_date": "2025-07-23T10:41:46+00:00",
        "updated_date": "2025-07-23T10:41:46+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Zhaolin Cai",
            "Fan Li",
            "Ziwei Zheng",
            "Yanjun Qin"
        ]
    },
    {
        "title": "EndoGen: Conditional Autoregressive Endoscopic Video Generation",
        "summary": "Endoscopic video generation is crucial for advancing medical imaging and\nenhancing diagnostic capabilities. However, prior efforts in this field have\neither focused on static images, lacking the dynamic context required for\npractical applications, or have relied on unconditional generation that fails\nto provide meaningful references for clinicians. Therefore, in this paper, we\npropose the first conditional endoscopic video generation framework, namely\nEndoGen. Specifically, we build an autoregressive model with a tailored\nSpatiotemporal Grid-Frame Patterning (SGP) strategy. It reformulates the\nlearning of generating multiple frames as a grid-based image generation\npattern, which effectively capitalizes the inherent global dependency modeling\ncapabilities of autoregressive architectures. Furthermore, we propose a\nSemantic-Aware Token Masking (SAT) mechanism, which enhances the model's\nability to produce rich and diverse content by selectively focusing on\nsemantically meaningful regions during the generation process. Through\nextensive experiments, we demonstrate the effectiveness of our framework in\ngenerating high-quality, conditionally guided endoscopic content, and improves\nthe performance of downstream task of polyp segmentation. Code released at\nhttps://www.github.com/CUHK-AIM-Group/EndoGen.",
        "url": "http://arxiv.org/abs/2507.17388v1",
        "published_date": "2025-07-23T10:32:20+00:00",
        "updated_date": "2025-07-23T10:32:20+00:00",
        "categories": [
            "cs.CV",
            "eess.IV"
        ],
        "authors": [
            "Xinyu Liu",
            "Hengyu Liu",
            "Cheng Wang",
            "Tianming Liu",
            "Yixuan Yuan"
        ]
    },
    {
        "title": "A Conditional Probability Framework for Compositional Zero-shot Learning",
        "summary": "Compositional Zero-Shot Learning (CZSL) aims to recognize unseen combinations\nof known objects and attributes by leveraging knowledge from previously seen\ncompositions. Traditional approaches primarily focus on disentangling\nattributes and objects, treating them as independent entities during learning.\nHowever, this assumption overlooks the semantic constraints and contextual\ndependencies inside a composition. For example, certain attributes naturally\npair with specific objects (e.g., \"striped\" applies to \"zebra\" or \"shirts\" but\nnot \"sky\" or \"water\"), while the same attribute can manifest differently\ndepending on context (e.g., \"young\" in \"young tree\" vs. \"young dog\"). Thus,\ncapturing attribute-object interdependence remains a fundamental yet\nlong-ignored challenge in CZSL. In this paper, we adopt a Conditional\nProbability Framework (CPF) to explicitly model attribute-object dependencies.\nWe decompose the probability of a composition into two components: the\nlikelihood of an object and the conditional likelihood of its attribute. To\nenhance object feature learning, we incorporate textual descriptors to\nhighlight semantically relevant image regions. These enhanced object features\nthen guide attribute learning through a cross-attention mechanism, ensuring\nbetter contextual alignment. By jointly optimizing object likelihood and\nconditional attribute likelihood, our method effectively captures compositional\ndependencies and generalizes well to unseen compositions. Extensive experiments\non multiple CZSL benchmarks demonstrate the superiority of our approach. Code\nis available at here.",
        "url": "http://arxiv.org/abs/2507.17377v1",
        "published_date": "2025-07-23T10:20:52+00:00",
        "updated_date": "2025-07-23T10:20:52+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Peng Wu",
            "Qiuxia Lai",
            "Hao Fang",
            "Guo-Sen Xie",
            "Yilong Yin",
            "Xiankai Lu",
            "Wenguan Wang"
        ]
    },
    {
        "title": "SFUOD: Source-Free Unknown Object Detection",
        "summary": "Source-free object detection adapts a detector pre-trained on a source domain\nto an unlabeled target domain without requiring access to labeled source data.\nWhile this setting is practical as it eliminates the need for the source\ndataset during domain adaptation, it operates under the restrictive assumption\nthat only pre-defined objects from the source domain exist in the target\ndomain. This closed-set setting prevents the detector from detecting undefined\nobjects. To ease this assumption, we propose Source-Free Unknown Object\nDetection (SFUOD), a novel scenario which enables the detector to not only\nrecognize known objects but also detect undefined objects as unknown objects.\nTo this end, we propose CollaPAUL (Collaborative tuning and Principal\nAxis-based Unknown Labeling), a novel framework for SFUOD. Collaborative tuning\nenhances knowledge adaptation by integrating target-dependent knowledge from\nthe auxiliary encoder with source-dependent knowledge from the pre-trained\ndetector through a cross-domain attention mechanism. Additionally, principal\naxes-based unknown labeling assigns pseudo-labels to unknown objects by\nestimating objectness via principal axes projection and confidence scores from\nmodel predictions. The proposed CollaPAUL achieves state-of-the-art\nperformances on SFUOD benchmarks, and extensive experiments validate its\neffectiveness.",
        "url": "http://arxiv.org/abs/2507.17373v1",
        "published_date": "2025-07-23T10:16:25+00:00",
        "updated_date": "2025-07-23T10:16:25+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Keon-Hee Park",
            "Seun-An Choe",
            "Gyeong-Moon Park"
        ]
    },
    {
        "title": "Exploring Spatial Diversity for Region-based Active Learning",
        "summary": "State-of-the-art methods for semantic segmentation are based on deep neural\nnetworks trained on large-scale labeled datasets. Acquiring such datasets would\nincur large annotation costs, especially for dense pixel-level prediction tasks\nlike semantic segmentation. We consider region-based active learning as a\nstrategy to reduce annotation costs while maintaining high performance. In this\nsetting, batches of informative image regions instead of entire images are\nselected for labeling. Importantly, we propose that enforcing local spatial\ndiversity is beneficial for active learning in this case, and to incorporate\nspatial diversity along with the traditional active selection criterion, e.g.,\ndata sample uncertainty, in a unified optimization framework for region-based\nactive learning. We apply this framework to the Cityscapes and PASCAL VOC\ndatasets and demonstrate that the inclusion of spatial diversity effectively\nimproves the performance of uncertainty-based and feature diversity-based\nactive learning methods. Our framework achieves $95\\%$ performance of fully\nsupervised methods with only $5-9\\%$ of the labeled pixels, outperforming all\nstate-of-the-art region-based active learning methods for semantic\nsegmentation.",
        "url": "http://arxiv.org/abs/2507.17367v1",
        "published_date": "2025-07-23T10:04:25+00:00",
        "updated_date": "2025-07-23T10:04:25+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Lile Cai",
            "Xun Xu",
            "Lining Zhang",
            "Chuan-Sheng Foo"
        ]
    },
    {
        "title": "Exploring Active Learning for Semiconductor Defect Segmentation",
        "summary": "The development of X-Ray microscopy (XRM) technology has enabled\nnon-destructive inspection of semiconductor structures for defect\nidentification. Deep learning is widely used as the state-of-the-art approach\nto perform visual analysis tasks. However, deep learning based models require\nlarge amount of annotated data to train. This can be time-consuming and\nexpensive to obtain especially for dense prediction tasks like semantic\nsegmentation. In this work, we explore active learning (AL) as a potential\nsolution to alleviate the annotation burden. We identify two unique challenges\nwhen applying AL on semiconductor XRM scans: large domain shift and severe\nclass-imbalance. To address these challenges, we propose to perform contrastive\npretraining on the unlabelled data to obtain the initialization weights for\neach AL cycle, and a rareness-aware acquisition function that favors the\nselection of samples containing rare classes. We evaluate our method on a\nsemiconductor dataset that is compiled from XRM scans of high bandwidth memory\nstructures composed of logic and memory dies, and demonstrate that our method\nachieves state-of-the-art performance.",
        "url": "http://arxiv.org/abs/2507.17359v1",
        "published_date": "2025-07-23T09:44:11+00:00",
        "updated_date": "2025-07-23T09:44:11+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Lile Cai",
            "Ramanpreet Singh Pahwa",
            "Xun Xu",
            "Jie Wang",
            "Richard Chang",
            "Lining Zhang",
            "Chuan-Sheng Foo"
        ]
    },
    {
        "title": "Exploring Active Learning for Label-Efficient Training of Semantic Neural Radiance Field",
        "summary": "Neural Radiance Field (NeRF) models are implicit neural scene representation\nmethods that offer unprecedented capabilities in novel view synthesis.\nSemantically-aware NeRFs not only capture the shape and radiance of a scene,\nbut also encode semantic information of the scene. The training of\nsemantically-aware NeRFs typically requires pixel-level class labels, which can\nbe prohibitively expensive to collect. In this work, we explore active learning\nas a potential solution to alleviate the annotation burden. We investigate\nvarious design choices for active learning of semantically-aware NeRF,\nincluding selection granularity and selection strategies. We further propose a\nnovel active learning strategy that takes into account 3D geometric constraints\nin sample selection. Our experiments demonstrate that active learning can\neffectively reduce the annotation cost of training semantically-aware NeRF,\nachieving more than 2X reduction in annotation cost compared to random\nsampling.",
        "url": "http://arxiv.org/abs/2507.17351v1",
        "published_date": "2025-07-23T09:34:09+00:00",
        "updated_date": "2025-07-23T09:34:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yuzhe Zhu",
            "Lile Cai",
            "Kangkang Lu",
            "Fayao Liu",
            "Xulei Yang"
        ]
    },
    {
        "title": "Swin-TUNA : A Novel PEFT Approach for Accurate Food Image Segmentation",
        "summary": "In the field of food image processing, efficient semantic segmentation\ntechniques are crucial for industrial applications. However, existing\nlarge-scale Transformer-based models (such as FoodSAM) face challenges in\nmeeting practical deploymentrequirements due to their massive parameter counts\nand high computational resource demands. This paper introduces TUNable Adapter\nmodule (Swin-TUNA), a Parameter Efficient Fine-Tuning (PEFT) method that\nintegrates multiscale trainable adapters into the Swin Transformer\narchitecture, achieving high-performance food image segmentation by updating\nonly 4% of the parameters. The core innovation of Swin-TUNA lies in its\nhierarchical feature adaptation mechanism: it designs separable convolutions in\ndepth and dimensional mappings of varying scales to address the differences in\nfeatures between shallow and deep networks, combined with a dynamic balancing\nstrategy for tasks-agnostic and task-specific features. Experiments demonstrate\nthat this method achieves mIoU of 50.56% and 74.94% on the FoodSeg103 and\nUECFoodPix Complete datasets, respectively, surpassing the fully parameterized\nFoodSAM model while reducing the parameter count by 98.7% (to only 8.13M).\nFurthermore, Swin-TUNA exhibits faster convergence and stronger generalization\ncapabilities in low-data scenarios, providing an efficient solution for\nassembling lightweight food image.",
        "url": "http://arxiv.org/abs/2507.17347v3",
        "published_date": "2025-07-23T09:28:25+00:00",
        "updated_date": "2025-07-28T08:44:20+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Haotian Chen",
            "Zhiyong Xiao"
        ]
    },
    {
        "title": "Principled Multimodal Representation Learning",
        "summary": "Multimodal representation learning seeks to create a unified representation\nspace by integrating diverse data modalities to improve multimodal\nunderstanding. Traditional methods often depend on pairwise contrastive\nlearning, which relies on a predefined anchor modality, restricting alignment\nacross all modalities. Recent advances have investigated the simultaneous\nalignment of multiple modalities, yet several challenges remain, such as\nlimitations imposed by fixed anchor points and instability arising from\noptimizing the product of singular values. To address the challenges, in this\npaper, we propose Principled Multimodal Representation Learning (PMRL), a novel\nframework that achieves simultaneous alignment of multiple modalities without\nanchor dependency in a more stable manner. Specifically, grounded in the\ntheoretical insight that full alignment corresponds to a rank-1 Gram matrix,\nPMRL optimizes the dominant singular value of the representation matrix to\nalign modalities along a shared leading direction. We propose a softmax-based\nloss function that treats singular values as logits to prioritize the largest\nsingular value. Besides, instance-wise contrastive regularization on the\nleading eigenvectors maintains inter-instance separability and prevents\nrepresentation collapse. Extensive experiments across diverse tasks demonstrate\nPMRL's superiority compared to baseline methods. The source code will be\npublicly available.",
        "url": "http://arxiv.org/abs/2507.17343v1",
        "published_date": "2025-07-23T09:12:25+00:00",
        "updated_date": "2025-07-23T09:12:25+00:00",
        "categories": [
            "cs.CV",
            "cs.LG",
            "cs.MM"
        ],
        "authors": [
            "Xiaohao Liu",
            "Xiaobo Xia",
            "See-Kiong Ng",
            "Tat-Seng Chua"
        ]
    },
    {
        "title": "DeMo++: Motion Decoupling for Autonomous Driving",
        "summary": "Motion forecasting and planning are tasked with estimating the trajectories\nof traffic agents and the ego vehicle, respectively, to ensure the safety and\nefficiency of autonomous driving systems in dynamically changing environments.\nState-of-the-art methods typically adopt a one-query-one-trajectory paradigm,\nwhere each query corresponds to a unique trajectory for predicting multi-mode\ntrajectories. While this paradigm can produce diverse motion intentions, it\noften falls short in modeling the intricate spatiotemporal evolution of\ntrajectories, which can lead to collisions or suboptimal outcomes. To overcome\nthis limitation, we propose DeMo++, a framework that decouples motion\nestimation into two distinct components: holistic motion intentions to capture\nthe diverse potential directions of movement, and fine spatiotemporal states to\ntrack the agent's dynamic progress within the scene and enable a\nself-refinement capability. Further, we introduce a cross-scene trajectory\ninteraction mechanism to explore the relationships between motions in adjacent\nscenes. This allows DeMo++ to comprehensively model both the diversity of\nmotion intentions and the spatiotemporal evolution of each trajectory. To\neffectively implement this framework, we developed a hybrid model combining\nAttention and Mamba. This architecture leverages the strengths of both\nmechanisms for efficient scene information aggregation and precise trajectory\nstate sequence modeling. Extensive experiments demonstrate that DeMo++ achieves\nstate-of-the-art performance across various benchmarks, including motion\nforecasting (Argoverse 2 and nuScenes), motion planning (nuPlan), and\nend-to-end planning (NAVSIM).",
        "url": "http://arxiv.org/abs/2507.17342v1",
        "published_date": "2025-07-23T09:11:25+00:00",
        "updated_date": "2025-07-23T09:11:25+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Bozhou Zhang",
            "Nan Song",
            "Xiatian Zhu",
            "Li Zhang"
        ]
    },
    {
        "title": "TransLPRNet: Lite Vision-Language Network for Single/Dual-line Chinese License Plate Recognition",
        "summary": "License plate recognition in open environments is widely applicable across\nvarious domains; however, the diversity of license plate types and imaging\nconditions presents significant challenges. To address the limitations\nencountered by CNN and CRNN-based approaches in license plate recognition, this\npaper proposes a unified solution that integrates a lightweight visual encoder\nwith a text decoder, within a pre-training framework tailored for single and\ndouble-line Chinese license plates. To mitigate the scarcity of double-line\nlicense plate datasets, we constructed a single/double-line license plate\ndataset by synthesizing images, applying texture mapping onto real scenes, and\nblending them with authentic license plate images. Furthermore, to enhance the\nsystem's recognition accuracy, we introduce a perspective correction network\n(PTN) that employs license plate corner coordinate regression as an implicit\nvariable, supervised by license plate view classification information. This\nnetwork offers improved stability, interpretability, and low annotation costs.\nThe proposed algorithm achieves an average recognition accuracy of 99.34% on\nthe corrected CCPD test set under coarse localization disturbance. When\nevaluated under fine localization disturbance, the accuracy further improves to\n99.58%. On the double-line license plate test set, it achieves an average\nrecognition accuracy of 98.70%, with processing speeds reaching up to 167\nframes per second, indicating strong practical applicability.",
        "url": "http://arxiv.org/abs/2507.17335v1",
        "published_date": "2025-07-23T09:03:01+00:00",
        "updated_date": "2025-07-23T09:03:01+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Guangzhu Xu",
            "Zhi Ke",
            "Pengcheng Zuo",
            "Bangjun Lei"
        ]
    },
    {
        "title": "Temporal Point-Supervised Signal Reconstruction: A Human-Annotation-Free Framework for Weak Moving Target Detection",
        "summary": "In low-altitude surveillance and early warning systems, detecting weak moving\ntargets remains a significant challenge due to low signal energy, small spatial\nextent, and complex background clutter. Existing methods struggle with\nextracting robust features and suffer from the lack of reliable annotations. To\naddress these limitations, we propose a novel Temporal Point-Supervised (TPS)\nframework that enables high-performance detection of weak targets without any\nmanual annotations.Instead of conventional frame-based detection, our framework\nreformulates the task as a pixel-wise temporal signal modeling problem, where\nweak targets manifest as short-duration pulse-like responses. A Temporal Signal\nReconstruction Network (TSRNet) is developed under the TPS paradigm to\nreconstruct these transient signals.TSRNet adopts an encoder-decoder\narchitecture and integrates a Dynamic Multi-Scale Attention (DMSAttention)\nmodule to enhance its sensitivity to diverse temporal patterns. Additionally, a\ngraph-based trajectory mining strategy is employed to suppress false alarms and\nensure temporal consistency.Extensive experiments on a purpose-built low-SNR\ndataset demonstrate that our framework outperforms state-of-the-art methods\nwhile requiring no human annotations. It achieves strong detection performance\nand operates at over 1000 FPS, underscoring its potential for real-time\ndeployment in practical scenarios.",
        "url": "http://arxiv.org/abs/2507.17334v1",
        "published_date": "2025-07-23T09:02:09+00:00",
        "updated_date": "2025-07-23T09:02:09+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Weihua Gao",
            "Chunxu Ren",
            "Wenlong Niu",
            "Xiaodong Peng"
        ]
    },
    {
        "title": "PARTE: Part-Guided Texturing for 3D Human Reconstruction from a Single Image",
        "summary": "The misaligned human texture across different human parts is one of the main\nlimitations of existing 3D human reconstruction methods. Each human part, such\nas a jacket or pants, should maintain a distinct texture without blending into\nothers. The structural coherence of human parts serves as a crucial cue to\ninfer human textures in the invisible regions of a single image. However, most\nexisting 3D human reconstruction methods do not explicitly exploit such part\nsegmentation priors, leading to misaligned textures in their reconstructions.\nIn this regard, we present PARTE, which utilizes 3D human part information as a\nkey guide to reconstruct 3D human textures. Our framework comprises two core\ncomponents. First, to infer 3D human part information from a single image, we\npropose a 3D part segmentation module (PartSegmenter) that initially\nreconstructs a textureless human surface and predicts human part labels based\non the textureless surface. Second, to incorporate part information into\ntexture reconstruction, we introduce a part-guided texturing module\n(PartTexturer), which acquires prior knowledge from a pre-trained image\ngeneration network on texture alignment of human parts. Extensive experiments\ndemonstrate that our framework achieves state-of-the-art quality in 3D human\nreconstruction. The project page is available at\nhttps://hygenie1228.github.io/PARTE/.",
        "url": "http://arxiv.org/abs/2507.17332v4",
        "published_date": "2025-07-23T09:00:13+00:00",
        "updated_date": "2025-07-30T08:43:58+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Hyeongjin Nam",
            "Donghwan Kim",
            "Gyeongsik Moon",
            "Kyoung Mu Lee"
        ]
    },
    {
        "title": "CartoonAlive: Towards Expressive Live2D Modeling from Single Portraits",
        "summary": "With the rapid advancement of large foundation models, AIGC, cloud rendering,\nand real-time motion capture technologies, digital humans are now capable of\nachieving synchronized facial expressions and body movements, engaging in\nintelligent dialogues driven by natural language, and enabling the fast\ncreation of personalized avatars. While current mainstream approaches to\ndigital humans primarily focus on 3D models and 2D video-based representations,\ninteractive 2D cartoon-style digital humans have received relatively less\nattention. Compared to 3D digital humans that require complex modeling and high\nrendering costs, and 2D video-based solutions that lack flexibility and\nreal-time interactivity, 2D cartoon-style Live2D models offer a more efficient\nand expressive alternative. By simulating 3D-like motion through layered\nsegmentation without the need for traditional 3D modeling, Live2D enables\ndynamic and real-time manipulation. In this technical report, we present\nCartoonAlive, an innovative method for generating high-quality Live2D digital\nhumans from a single input portrait image. CartoonAlive leverages the shape\nbasis concept commonly used in 3D face modeling to construct facial blendshapes\nsuitable for Live2D. It then infers the corresponding blendshape weights based\non facial keypoints detected from the input image. This approach allows for the\nrapid generation of a highly expressive and visually accurate Live2D model that\nclosely resembles the input portrait, within less than half a minute. Our work\nprovides a practical and scalable solution for creating interactive 2D cartoon\ncharacters, opening new possibilities in digital content creation and virtual\ncharacter animation. The project homepage is\nhttps://human3daigc.github.io/CartoonAlive_webpage/.",
        "url": "http://arxiv.org/abs/2507.17327v1",
        "published_date": "2025-07-23T08:52:48+00:00",
        "updated_date": "2025-07-23T08:52:48+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Chao He",
            "Jianqiang Ren",
            "Jianjing Xiang",
            "Xiejie Shen"
        ]
    },
    {
        "title": "CasP: Improving Semi-Dense Feature Matching Pipeline Leveraging Cascaded Correspondence Priors for Guidance",
        "summary": "Semi-dense feature matching methods have shown strong performance in\nchallenging scenarios. However, the existing pipeline relies on a global search\nacross the entire feature map to establish coarse matches, limiting further\nimprovements in accuracy and efficiency. Motivated by this limitation, we\npropose a novel pipeline, CasP, which leverages cascaded correspondence priors\nfor guidance. Specifically, the matching stage is decomposed into two\nprogressive phases, bridged by a region-based selective cross-attention\nmechanism designed to enhance feature discriminability. In the second phase,\none-to-one matches are determined by restricting the search range to the\none-to-many prior areas identified in the first phase. Additionally, this\npipeline benefits from incorporating high-level features, which helps reduce\nthe computational costs of low-level feature extraction. The acceleration gains\nof CasP increase with higher resolution, and our lite model achieves a speedup\nof $\\sim2.2\\times$ at a resolution of 1152 compared to the most efficient\nmethod, ELoFTR. Furthermore, extensive experiments demonstrate its superiority\nin geometric estimation, particularly with impressive cross-domain\ngeneralization. These advantages highlight its potential for latency-sensitive\nand high-robustness applications, such as SLAM and UAV systems. Code is\navailable at https://github.com/pq-chen/CasP.",
        "url": "http://arxiv.org/abs/2507.17312v1",
        "published_date": "2025-07-23T08:29:26+00:00",
        "updated_date": "2025-07-23T08:29:26+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Peiqi Chen",
            "Lei Yu",
            "Yi Wan",
            "Yingying Pei",
            "Xinyi Liu",
            "Yongxiang Yao",
            "Yingying Zhang",
            "Lixiang Ru",
            "Liheng Zhong",
            "Jingdong Chen",
            "Ming Yang",
            "Yongjun Zhang"
        ]
    },
    {
        "title": "Learning-based Stage Verification System in Manual Assembly Scenarios",
        "summary": "In the context of Industry 4.0, effective monitoring of multiple targets and\nstates during assembly processes is crucial, particularly when constrained to\nusing only visual sensors. Traditional methods often rely on either multiple\nsensor types or complex hardware setups to achieve high accuracy in monitoring,\nwhich can be cost-prohibitive and difficult to implement in dynamic industrial\nenvironments. This study presents a novel approach that leverages multiple\nmachine learning models to achieve precise monitoring under the limitation of\nusing a minimal number of visual sensors. By integrating state information from\nidentical timestamps, our method detects and confirms the current stage of the\nassembly process with an average accuracy exceeding 92%. Furthermore, our\napproach surpasses conventional methods by offering enhanced error detection\nand visuali-zation capabilities, providing real-time, actionable guidance to\noperators. This not only improves the accuracy and efficiency of assembly\nmonitoring but also re-duces dependency on expensive hardware solutions, making\nit a more practical choice for modern industrial applications.",
        "url": "http://arxiv.org/abs/2507.17304v1",
        "published_date": "2025-07-23T08:10:27+00:00",
        "updated_date": "2025-07-23T08:10:27+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Xingjian Zhang",
            "Yutong Duan",
            "Zaishu Chen"
        ]
    },
    {
        "title": "A Versatile Pathology Co-pilot via Reasoning Enhanced Multimodal Large Language Model",
        "summary": "Multimodal large language models (MLLMs) have emerged as powerful tools for\ncomputational pathology, offering unprecedented opportunities to integrate\npathological images with language context for comprehensive diagnostic\nanalysis. These models hold particular promise for automating complex tasks\nthat traditionally require expert interpretation of pathologists. However,\ncurrent MLLM approaches in pathology demonstrate significantly constrained\nreasoning capabilities, primarily due to their reliance on expensive\nchain-of-thought annotations. Additionally, existing methods remain limited to\nsimplex application of visual question answering (VQA) at region-of-interest\n(ROI) level, failing to address the full spectrum of diagnostic needs such as\nROI classification, detection, segmentation, whole-slide-image (WSI)\nclassification and VQA in clinical practice. In this study, we present\nSmartPath-R1, a versatile MLLM capable of simultaneously addressing both\nROI-level and WSI-level tasks while demonstrating robust pathological reasoning\ncapability. Our framework combines scale-dependent supervised fine-tuning and\ntask-aware reinforcement fine-tuning, which circumvents the requirement for\nchain-of-thought supervision by leveraging the intrinsic knowledge within MLLM.\nFurthermore, SmartPath-R1 integrates multiscale and multitask analysis through\na mixture-of-experts mechanism, enabling dynamic processing for diverse tasks.\nWe curate a large-scale dataset comprising 2.3M ROI samples and 188K WSI\nsamples for training and evaluation. Extensive experiments across 72 tasks\nvalidate the effectiveness and superiority of the proposed approach. This work\nrepresents a significant step toward developing versatile, reasoning-enhanced\nAI systems for precision pathology.",
        "url": "http://arxiv.org/abs/2507.17303v1",
        "published_date": "2025-07-23T08:09:42+00:00",
        "updated_date": "2025-07-23T08:09:42+00:00",
        "categories": [
            "eess.IV",
            "cs.AI",
            "cs.CV"
        ],
        "authors": [
            "Zhe Xu",
            "Ziyi Liu",
            "Junlin Hou",
            "Jiabo Ma",
            "Cheng Jin",
            "Yihui Wang",
            "Zhixuan Chen",
            "Zhengyu Zhang",
            "Zhengrui Guo",
            "Fengtao Zhou",
            "Yingxue Xu",
            "Xi Wang",
            "Ronald Cheong Kin Chan",
            "Li Liang",
            "Hao Chen"
        ]
    },
    {
        "title": "PointLAMA: Latent Attention meets Mamba for Efficient Point Cloud Pretraining",
        "summary": "Mamba has recently gained widespread attention as a backbone model for point\ncloud modeling, leveraging a state-space architecture that enables efficient\nglobal sequence modeling with linear complexity. However, its lack of local\ninductive bias limits its capacity to capture fine-grained geometric structures\nin 3D data. To address this limitation, we propose \\textbf{PointLAMA}, a point\ncloud pretraining framework that combines task-aware point cloud serialization,\na hybrid encoder with integrated Latent Attention and Mamba blocks, and a\nconditional diffusion mechanism built upon the Mamba backbone. Specifically,\nthe task-aware point cloud serialization employs Hilbert/Trans-Hilbert\nspace-filling curves and axis-wise sorting to structurally align point tokens\nfor classification and segmentation tasks, respectively. Our lightweight Latent\nAttention block features a Point-wise Multi-head Latent Attention (PMLA)\nmodule, which is specifically designed to align with the Mamba architecture by\nleveraging the shared latent space characteristics of PMLA and Mamba. This\nenables enhanced local context modeling while preserving overall efficiency. To\nfurther enhance representation learning, we incorporate a conditional diffusion\nmechanism during pretraining, which denoises perturbed feature sequences\nwithout relying on explicit point-wise reconstruction. Experimental results\ndemonstrate that PointLAMA achieves competitive performance on multiple\nbenchmark datasets with minimal parameter count and FLOPs, validating its\neffectiveness for efficient point cloud pretraining.",
        "url": "http://arxiv.org/abs/2507.17296v1",
        "published_date": "2025-07-23T07:57:35+00:00",
        "updated_date": "2025-07-23T07:57:35+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Xuanyu Lin",
            "Xiaona Zeng",
            "Xianwei Zheng",
            "Xutao Li"
        ]
    },
    {
        "title": "Fully Automated SAM for Single-source Domain Generalization in Medical Image Segmentation",
        "summary": "Although SAM-based single-source domain generalization models for medical\nimage segmentation can mitigate the impact of domain shift on the model in\ncross-domain scenarios, these models still face two major challenges. First,\nthe segmentation of SAM is highly dependent on domain-specific expert-annotated\nprompts, which prevents SAM from achieving fully automated medical image\nsegmentation and therefore limits its application in clinical settings. Second,\nproviding poor prompts (such as bounding boxes that are too small or too large)\nto the SAM prompt encoder can mislead SAM into generating incorrect mask\nresults. Therefore, we propose the FA-SAM, a single-source domain\ngeneralization framework for medical image segmentation that achieves fully\nautomated SAM. FA-SAM introduces two key innovations: an Auto-prompted\nGeneration Model (AGM) branch equipped with a Shallow Feature Uncertainty\nModeling (SUFM) module, and an Image-Prompt Embedding Fusion (IPEF) module\nintegrated into the SAM mask decoder. Specifically, AGM models the uncertainty\ndistribution of shallow features through the SUFM module to generate bounding\nbox prompts for the target domain, enabling fully automated segmentation with\nSAM. The IPEF module integrates multiscale information from SAM image\nembeddings and prompt embeddings to capture global and local details of the\ntarget object, enabling SAM to mitigate the impact of poor prompts. Extensive\nexperiments on publicly available prostate and fundus vessel datasets validate\nthe effectiveness of FA-SAM and highlight its potential to address the above\nchallenges.",
        "url": "http://arxiv.org/abs/2507.17281v1",
        "published_date": "2025-07-23T07:37:39+00:00",
        "updated_date": "2025-07-23T07:37:39+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Huanli Zhuo",
            "Leilei Ma",
            "Haifeng Zhao",
            "Shiwei Zhou",
            "Dengdi Sun",
            "Yanping Fu"
        ]
    },
    {
        "title": "MyGO: Make your Goals Obvious, Avoiding Semantic Confusion in Prostate Cancer Lesion Region Segmentation",
        "summary": "Early diagnosis and accurate identification of lesion location and\nprogression in prostate cancer (PCa) are critical for assisting clinicians in\nformulating effective treatment strategies. However, due to the high semantic\nhomogeneity between lesion and non-lesion areas, existing medical image\nsegmentation methods often struggle to accurately comprehend lesion semantics,\nresulting in the problem of semantic confusion. To address this challenge, we\npropose a novel Pixel Anchor Module, which guides the model to discover a\nsparse set of feature anchors that serve to capture and interpret global\ncontextual information. This mechanism enhances the model's nonlinear\nrepresentation capacity and improves segmentation accuracy within lesion\nregions. Moreover, we design a self-attention-based Top_k selection strategy to\nfurther refine the identification of these feature anchors, and incorporate a\nfocal loss function to mitigate class imbalance, thereby facilitating more\nprecise semantic interpretation across diverse regions. Our method achieves\nstate-of-the-art performance on the PI-CAI dataset, demonstrating 69.73% IoU\nand 74.32% Dice scores, and significantly improving prostate cancer lesion\ndetection.",
        "url": "http://arxiv.org/abs/2507.17269v1",
        "published_date": "2025-07-23T07:10:07+00:00",
        "updated_date": "2025-07-23T07:10:07+00:00",
        "categories": [
            "eess.IV",
            "cs.CV"
        ],
        "authors": [
            "Zhengcheng Lin",
            "Zuobin Ying",
            "Zhenyu Li",
            "Zhenyu Liu",
            "Jian Lu",
            "Weiping Ding"
        ]
    },
    {
        "title": "PolarAnything: Diffusion-based Polarimetric Image Synthesis",
        "summary": "Polarization images facilitate image enhancement and 3D reconstruction tasks,\nbut the limited accessibility of polarization cameras hinders their broader\napplication. This gap drives the need for synthesizing photorealistic\npolarization images. The existing polarization simulator Mitsuba relies on a\nparametric polarization image formation model and requires extensive 3D assets\ncovering shape and PBR materials, preventing it from generating large-scale\nphotorealistic images. To address this problem, we propose PolarAnything,\ncapable of synthesizing polarization images from a single RGB input with both\nphotorealism and physical accuracy, eliminating the dependency on 3D asset\ncollections. Drawing inspiration from the zero-shot performance of pretrained\ndiffusion models, we introduce a diffusion-based generative framework with an\neffective representation strategy that preserves the fidelity of polarization\nproperties. Experiments show that our model generates high-quality polarization\nimages and supports downstream tasks like shape from polarization.",
        "url": "http://arxiv.org/abs/2507.17268v2",
        "published_date": "2025-07-23T07:09:10+00:00",
        "updated_date": "2025-07-24T04:33:14+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Kailong Zhang",
            "Youwei Lyu",
            "Heng Guo",
            "Si Li",
            "Zhanyu Ma",
            "Boxin Shi"
        ]
    },
    {
        "title": "VisionTrap: Unanswerable Questions On Visual Data",
        "summary": "Visual Question Answering (VQA) has been a widely studied topic, with\nextensive research focusing on how VLMs respond to answerable questions based\non real-world images. However, there has been limited exploration of how these\nmodels handle unanswerable questions, particularly in cases where they should\nabstain from providing a response. This research investigates VQA performance\non unrealistically generated images or asking unanswerable questions, assessing\nwhether models recognize the limitations of their knowledge or attempt to\ngenerate incorrect answers. We introduced a dataset, VisionTrap, comprising\nthree categories of unanswerable questions across diverse image types: (1)\nhybrid entities that fuse objects and animals, (2) objects depicted in\nunconventional or impossible scenarios, and (3) fictional or non-existent\nfigures. The questions posed are logically structured yet inherently\nunanswerable, testing whether models can correctly recognize their limitations.\nOur findings highlight the importance of incorporating such questions into VQA\nbenchmarks to evaluate whether models tend to answer, even when they should\nabstain.",
        "url": "http://arxiv.org/abs/2507.17262v1",
        "published_date": "2025-07-23T07:00:19+00:00",
        "updated_date": "2025-07-23T07:00:19+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Asir Saadat",
            "Syem Aziz",
            "Shahriar Mahmud",
            "Abdullah Ibne Masud Mahi",
            "Sabbir Ahmed"
        ]
    },
    {
        "title": "Unsupervised Exposure Correction",
        "summary": "Current exposure correction methods have three challenges, labor-intensive\npaired data annotation, limited generalizability, and performance degradation\nin low-level computer vision tasks. In this work, we introduce an innovative\nUnsupervised Exposure Correction (UEC) method that eliminates the need for\nmanual annotations, offers improved generalizability, and enhances performance\nin low-level downstream tasks. Our model is trained using freely available\npaired data from an emulated Image Signal Processing (ISP) pipeline. This\napproach does not need expensive manual annotations, thereby minimizing\nindividual style biases from the annotation and consequently improving its\ngeneralizability. Furthermore, we present a large-scale Radiometry Correction\nDataset, specifically designed to emphasize exposure variations, to facilitate\nunsupervised learning. In addition, we develop a transformation function that\npreserves image details and outperforms state-of-the-art supervised methods\n[12], while utilizing only 0.01% of their parameters. Our work further\ninvestigates the broader impact of exposure correction on downstream tasks,\nincluding edge detection, demonstrating its effectiveness in mitigating the\nadverse effects of poor exposure on low-level features. The source code and\ndataset are publicly available at https://github.com/BeyondHeaven/uec_code.",
        "url": "http://arxiv.org/abs/2507.17252v1",
        "published_date": "2025-07-23T06:46:22+00:00",
        "updated_date": "2025-07-23T06:46:22+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Ruodai Cui",
            "Li Niu",
            "Guosheng Hu"
        ]
    },
    {
        "title": "Perceptual Classifiers: Detecting Generative Images using Perceptual Features",
        "summary": "Image Quality Assessment (IQA) models are employed in many practical image\nand video processing pipelines to reduce storage, minimize transmission costs,\nand improve the Quality of Experience (QoE) of millions of viewers. These\nmodels are sensitive to a diverse range of image distortions and can accurately\npredict image quality as judged by human viewers. Recent advancements in\ngenerative models have resulted in a significant influx of \"GenAI\" content on\nthe internet. Existing methods for detecting GenAI content have progressed\nsignificantly with improved generalization performance on images from unseen\ngenerative models. Here, we leverage the capabilities of existing IQA models,\nwhich effectively capture the manifold of real images within a bandpass\nstatistical space, to distinguish between real and AI-generated images. We\ninvestigate the generalization ability of these perceptual classifiers to the\ntask of GenAI image detection and evaluate their robustness against various\nimage degradations. Our results show that a two-layer network trained on the\nfeature space of IQA models demonstrates state-of-the-art performance in\ndetecting fake images across generative models, while maintaining significant\nrobustness against image degradations.",
        "url": "http://arxiv.org/abs/2507.17240v1",
        "published_date": "2025-07-23T06:18:09+00:00",
        "updated_date": "2025-07-23T06:18:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Krishna Srikar Durbha",
            "Asvin Kumar Venkataramanan",
            "Rajesh Sureddi",
            "Alan C. Bovik"
        ]
    },
    {
        "title": "MaskedCLIP: Bridging the Masked and CLIP Space for Semi-Supervised Medical Vision-Language Pre-training",
        "summary": "Foundation models have recently gained tremendous popularity in medical image\nanalysis. State-of-the-art methods leverage either paired image-text data via\nvision-language pre-training or unpaired image data via self-supervised\npre-training to learn foundation models with generalizable image features to\nboost downstream task performance. However, learning foundation models\nexclusively on either paired or unpaired image data limits their ability to\nlearn richer and more comprehensive image features. In this paper, we\ninvestigate a novel task termed semi-supervised vision-language pre-training,\naiming to fully harness the potential of both paired and unpaired image data\nfor foundation model learning. To this end, we propose MaskedCLIP, a\nsynergistic masked image modeling and contrastive language-image pre-training\nframework for semi-supervised vision-language pre-training. The key challenge\nin combining paired and unpaired image data for learning a foundation model\nlies in the incompatible feature spaces derived from these two types of data.\nTo address this issue, we propose to connect the masked feature space with the\nCLIP feature space with a bridge transformer. In this way, the more semantic\nspecific CLIP features can benefit from the more general masked features for\nsemantic feature extraction. We further propose a masked knowledge distillation\nloss to distill semantic knowledge of original image features in CLIP feature\nspace back to the predicted masked image features in masked feature space. With\nthis mutually interactive design, our framework effectively leverages both\npaired and unpaired image data to learn more generalizable image features for\ndownstream tasks. Extensive experiments on retinal image analysis demonstrate\nthe effectiveness and data efficiency of our method.",
        "url": "http://arxiv.org/abs/2507.17239v1",
        "published_date": "2025-07-23T06:15:54+00:00",
        "updated_date": "2025-07-23T06:15:54+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Lei Zhu",
            "Jun Zhou",
            "Rick Siow Mong Goh",
            "Yong Liu"
        ]
    },
    {
        "title": "Dataset Distillation as Data Compression: A Rate-Utility Perspective",
        "summary": "Driven by the ``scale-is-everything'' paradigm, modern machine learning\nincreasingly demands ever-larger datasets and models, yielding prohibitive\ncomputational and storage requirements. Dataset distillation mitigates this by\ncompressing an original dataset into a small set of synthetic samples, while\npreserving its full utility. Yet, existing methods either maximize performance\nunder fixed storage budgets or pursue suitable synthetic data representations\nfor redundancy removal, without jointly optimizing both objectives. In this\nwork, we propose a joint rate-utility optimization method for dataset\ndistillation. We parameterize synthetic samples as optimizable latent codes\ndecoded by extremely lightweight networks. We estimate the Shannon entropy of\nquantized latents as the rate measure and plug any existing distillation loss\nas the utility measure, trading them off via a Lagrange multiplier. To enable\nfair, cross-method comparisons, we introduce bits per class (bpc), a precise\nstorage metric that accounts for sample, label, and decoder parameter costs. On\nCIFAR-10, CIFAR-100, and ImageNet-128, our method achieves up to $170\\times$\ngreater compression than standard distillation at comparable accuracy. Across\ndiverse bpc budgets, distillation losses, and backbone architectures, our\napproach consistently establishes better rate-utility trade-offs.",
        "url": "http://arxiv.org/abs/2507.17221v1",
        "published_date": "2025-07-23T05:40:52+00:00",
        "updated_date": "2025-07-23T05:40:52+00:00",
        "categories": [
            "cs.LG",
            "cs.CV"
        ],
        "authors": [
            "Youneng Bao",
            "Yiping Liu",
            "Zhuo Chen",
            "Yongsheng Liang",
            "Mu Li",
            "Kede Ma"
        ]
    },
    {
        "title": "PIG-Nav: Key Insights for Pretrained Image Goal Navigation Models",
        "summary": "Recent studies have explored pretrained (foundation) models for vision-based\nrobotic navigation, aiming to achieve generalizable navigation and positive\ntransfer across diverse environments while enhancing zero-shot performance in\nunseen settings. In this work, we introduce PIG-Nav (Pretrained Image-Goal\nNavigation), a new approach that further investigates pretraining strategies\nfor vision-based navigation models and contributes in two key areas.\nModel-wise, we identify two critical design choices that consistently improve\nthe performance of pretrained navigation models: (1) integrating an\nearly-fusion network structure to combine visual observations and goal images\nvia appropriately pretrained Vision Transformer (ViT) image encoder, and (2)\nintroducing suitable auxiliary tasks to enhance global navigation\nrepresentation learning, thus further improving navigation performance.\nDataset-wise, we propose a novel data preprocessing pipeline for efficiently\nlabeling large-scale game video datasets for navigation model training. We\ndemonstrate that augmenting existing open navigation datasets with diverse\ngameplay videos improves model performance. Our model achieves an average\nimprovement of 22.6% in zero-shot settings and a 37.5% improvement in\nfine-tuning settings over existing visual navigation foundation models in two\ncomplex simulated environments and one real-world environment. These results\nadvance the state-of-the-art in pretrained image-goal navigation models.\nNotably, our model maintains competitive performance while requiring\nsignificantly less fine-tuning data, highlighting its potential for real-world\ndeployment with minimal labeled supervision.",
        "url": "http://arxiv.org/abs/2507.17220v1",
        "published_date": "2025-07-23T05:34:20+00:00",
        "updated_date": "2025-07-23T05:34:20+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Jiansong Wan",
            "Chengming Zhou",
            "Jinkua Liu",
            "Xiangge Huang",
            "Xiaoyu Chen",
            "Xiaohan Yi",
            "Qisen Yang",
            "Baiting Zhu",
            "Xin-Qiang Cai",
            "Lixing Liu",
            "Rushuai Yang",
            "Chuheng Zhang",
            "Sherif Abdelfattah",
            "Hayong Shin",
            "Pushi Zhang",
            "Li Zhao",
            "Jiang Bian"
        ]
    },
    {
        "title": "A Low-Cost Machine Learning Approach for Timber Diameter Estimation",
        "summary": "The wood processing industry, particularly in facilities such as sawmills and\nMDF production lines, requires accurate and efficient identification of species\nand thickness of the wood. Although traditional methods rely heavily on expert\nhuman labor, they are slow, inconsistent, and prone to error, especially when\nprocessing large volumes. This study focuses on practical and cost-effective\nmachine learning frameworks that automate the estimation of timber log diameter\nusing standard RGB images captured under real-world working conditions. We\nemploy the YOLOv5 object detection algorithm, fine-tuned on a public dataset\n(TimberSeg 1.0), to detect individual timber logs and estimate thickness\nthrough bounding-box dimensions. Unlike previous methods that require expensive\nsensors or controlled environments, this model is trained on images taken in\ntypical industrial sheds during timber delivery. Experimental results show that\nthe model achieves a mean Average Precision (mAP@0.5) of 0.64, demonstrating\nreliable log detection even with modest computing resources. This lightweight,\nscalable solution holds promise for practical integration into existing\nworkflows, including on-site inventory management and preliminary sorting,\nparticularly in small and medium-sized operations.",
        "url": "http://arxiv.org/abs/2507.17219v1",
        "published_date": "2025-07-23T05:29:28+00:00",
        "updated_date": "2025-07-23T05:29:28+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Fatemeh Hasanzadeh Fard",
            "Sanaz Hasanzadeh Fard",
            "Mehdi Jonoobi"
        ]
    },
    {
        "title": "VBCD: A Voxel-Based Framework for Personalized Dental Crown Design",
        "summary": "The design of restorative dental crowns from intraoral scans is\nlabor-intensive for dental technicians. To address this challenge, we propose a\nnovel voxel-based framework for automated dental crown design (VBCD). The VBCD\nframework generates an initial coarse dental crown from voxelized intraoral\nscans, followed by a fine-grained refiner incorporating distance-aware\nsupervision to improve accuracy and quality. During the training stage, we\nemploy the Curvature and Margin line Penalty Loss (CMPL) to enhance the\nalignment of the generated crown with the margin line. Additionally, a\npositional prompt based on the FDI tooth numbering system is introduced to\nfurther improve the accuracy of the generated dental crowns. Evaluation on a\nlarge-scale dataset of intraoral scans demonstrated that our approach\noutperforms existing methods, providing a robust solution for personalized\ndental crown design.",
        "url": "http://arxiv.org/abs/2507.17205v1",
        "published_date": "2025-07-23T04:53:38+00:00",
        "updated_date": "2025-07-23T04:53:38+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Linda Wei",
            "Chang Liu",
            "Wenran Zhang",
            "Zengji Zhang",
            "Shaoting Zhang",
            "Hongsheng Li"
        ]
    },
    {
        "title": "DesignLab: Designing Slides Through Iterative Detection and Correction",
        "summary": "Designing high-quality presentation slides can be challenging for non-experts\ndue to the complexity involved in navigating various design choices. Numerous\nautomated tools can suggest layouts and color schemes, yet often lack the\nability to refine their own output, which is a key aspect in real-world\nworkflows. We propose DesignLab, which separates the design process into two\nroles, the design reviewer, who identifies design-related issues, and the\ndesign contributor who corrects them. This decomposition enables an iterative\nloop where the reviewer continuously detects issues and the contributor\ncorrects them, allowing a draft to be further polished with each iteration,\nreaching qualities that were unattainable. We fine-tune large language models\nfor these roles and simulate intermediate drafts by introducing controlled\nperturbations, enabling the design reviewer learn design errors and the\ncontributor learn how to fix them. Our experiments show that DesignLab\noutperforms existing design-generation methods, including a commercial tool, by\nembracing the iterative nature of designing which can result in polished,\nprofessional slides.",
        "url": "http://arxiv.org/abs/2507.17202v1",
        "published_date": "2025-07-23T04:49:48+00:00",
        "updated_date": "2025-07-23T04:49:48+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Jooyeol Yun",
            "Heng Wang",
            "Yotaro Shimose",
            "Jaegul Choo",
            "Shingo Takamatsu"
        ]
    },
    {
        "title": "Vec2Face+ for Face Dataset Generation",
        "summary": "When synthesizing identities as face recognition training data, it is\ngenerally believed that large inter-class separability and intra-class\nattribute variation are essential for synthesizing a quality dataset. % This\nbelief is generally correct, and this is what we aim for. However, when\nincreasing intra-class variation, existing methods overlook the necessity of\nmaintaining intra-class identity consistency. % To address this and generate\nhigh-quality face training data, we propose Vec2Face+, a generative model that\ncreates images directly from image features and allows for continuous and easy\ncontrol of face identities and attributes. Using Vec2Face+, we obtain datasets\nwith proper inter-class separability and intra-class variation and identity\nconsistency using three strategies: 1) we sample vectors sufficiently different\nfrom others to generate well-separated identities; 2) we propose an AttrOP\nalgorithm for increasing general attribute variations; 3) we propose LoRA-based\npose control for generating images with profile head poses, which is more\nefficient and identity-preserving than AttrOP. % Our system generates VFace10K,\na synthetic face dataset with 10K identities, which allows an FR model to\nachieve state-of-the-art accuracy on seven real-world test sets. Scaling the\nsize to 4M and 12M images, the corresponding VFace100K and VFace300K datasets\nyield higher accuracy than the real-world training dataset, CASIA-WebFace, on\nfive real-world test sets. This is the first time a synthetic dataset beats the\nCASIA-WebFace in average accuracy. In addition, we find that only 1 out of 11\nsynthetic datasets outperforms random guessing (\\emph{i.e., 50\\%}) in twin\nverification and that models trained with synthetic identities are more biased\nthan those trained with real identities. Both are important aspects for future\ninvestigation. Code is available at https://github.com/HaiyuWu/Vec2Face_plus",
        "url": "http://arxiv.org/abs/2507.17192v2",
        "published_date": "2025-07-23T04:34:56+00:00",
        "updated_date": "2025-07-28T00:57:20+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Haiyu Wu",
            "Jaskirat Singh",
            "Sicong Tian",
            "Liang Zheng",
            "Kevin W. Bowyer"
        ]
    },
    {
        "title": "Asymmetric Lesion Detection with Geometric Patterns and CNN-SVM Classification",
        "summary": "In dermoscopic images, which allow visualization of surface skin structures\nnot visible to the naked eye, lesion shape offers vital insights into skin\ndiseases. In clinically practiced methods, asymmetric lesion shape is one of\nthe criteria for diagnosing melanoma. Initially, we labeled data for a\nnon-annotated dataset with symmetrical information based on clinical\nassessments. Subsequently, we propose a supporting technique, a supervised\nlearning image processing algorithm, to analyze the geometrical pattern of\nlesion shape, aiding non-experts in understanding the criteria of an asymmetric\nlesion. We then utilize a pre-trained convolutional neural network (CNN) to\nextract shape, color, and texture features from dermoscopic images for training\na multiclass support vector machine (SVM) classifier, outperforming\nstate-of-the-art methods from the literature. In the geometry-based experiment,\nwe achieved a 99.00% detection rate for dermatological asymmetric lesions. In\nthe CNN-based experiment, the best performance is found with 94% Kappa Score,\n95% Macro F1-score, and 97% Weighted F1-score for classifying lesion shapes\n(Asymmetric, Half-Symmetric, and Symmetric).",
        "url": "http://arxiv.org/abs/2507.17185v1",
        "published_date": "2025-07-23T04:17:57+00:00",
        "updated_date": "2025-07-23T04:17:57+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "M. A. Rasel",
            "Sameem Abdul Kareem",
            "Zhenli Kwan",
            "Nik Aimee Azizah Faheem",
            "Winn Hui Han",
            "Rebecca Kai Jan Choong",
            "Shin Shen Yong",
            "Unaizah Obaidellah"
        ]
    },
    {
        "title": "Hierarchical Fusion and Joint Aggregation: A Multi-Level Feature Representation Method for AIGC Image Quality Assessment",
        "summary": "The quality assessment of AI-generated content (AIGC) faces multi-dimensional\nchallenges, that span from low-level visual perception to high-level semantic\nunderstanding. Existing methods generally rely on single-level visual features,\nlimiting their ability to capture complex distortions in AIGC images. To\naddress this limitation, a multi-level visual representation paradigm is\nproposed with three stages, namely multi-level feature extraction, hierarchical\nfusion, and joint aggregation. Based on this paradigm, two networks are\ndeveloped. Specifically, the Multi-Level Global-Local Fusion Network (MGLF-Net)\nis designed for the perceptual quality assessment, extracting complementary\nlocal and global features via dual CNN and Transformer visual backbones. The\nMulti-Level Prompt-Embedded Fusion Network (MPEF-Net) targets Text-to-Image\ncorrespondence by embedding prompt semantics into the visual feature fusion\nprocess at each feature level. The fused multi-level features are then\naggregated for final evaluation. Experiments on benchmarks demonstrate\noutstanding performance on both tasks, validating the effectiveness of the\nproposed multi-level visual assessment paradigm.",
        "url": "http://arxiv.org/abs/2507.17182v1",
        "published_date": "2025-07-23T04:12:32+00:00",
        "updated_date": "2025-07-23T04:12:32+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Linghe Meng",
            "Jiarun Song"
        ]
    },
    {
        "title": "Multi-Scale PCB Defect Detection with YOLOv8 Network Improved via Pruning and Lightweight Network",
        "summary": "With the high density of printed circuit board (PCB) design and the high\nspeed of production, the traditional PCB defect detection model is difficult to\ntake into account the accuracy and computational cost, and cannot meet the\nrequirements of high accuracy and real-time detection of tiny defects.\nTherefore, in this paper, a multi-scale PCB defect detection method is improved\nwith YOLOv8 using a comprehensive strategy of tiny target sensitivity strategy,\nnetwork lightweighting and adaptive pruning, which is able to improve the\ndetection speed and accuracy by optimizing the backbone network, the neck\nnetwork and the detection head, the loss function and the adaptive pruning\nrate. Firstly, a Ghost-HGNetv2 structure with fewer parameters is used in the\nbackbone network, and multilevel features are used to extract image semantic\nfeatures to discover accurate defects. Secondly, we integrate C2f-Faster with\nsmall number of parameters in the neck section to enhance the ability of\nmulti-level feature fusion. Next, in the Head part, we design a new GCDetect\ndetection head, which allows the prediction of bounding boxes and categories to\nshare the weights of GroupConv, and uses a small number of grouping\nconvolutions to accomplish the regression and classification tasks, which\nsignificantly reduces the number of parameters while maintaining the accuracy\nof detection. We also design the Inner-MPDIoU boundary loss function to improve\nthe detection and localization of tiny targets. Finally, the model was pruned\nby an optimized adaptive pruning rate to further reduce the complexity of the\nmodel. Experimental results show that the model exhibits advantages in terms of\naccuracy and speed. On the publicly available PCB defect dataset, mAP0.5\nreaches 99.32% and mAP0.5:0.9 reaches 75.18%, which is 10.13% higher compared\nto YOLOv8n.",
        "url": "http://arxiv.org/abs/2507.17176v1",
        "published_date": "2025-07-23T03:47:00+00:00",
        "updated_date": "2025-07-23T03:47:00+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Li Pingzhen",
            "Xu Sheng",
            "Chen Jing",
            "Su Chengyue"
        ]
    },
    {
        "title": "DOOMGAN:High-Fidelity Dynamic Identity Obfuscation Ocular Generative Morphing",
        "summary": "Ocular biometrics in the visible spectrum have emerged as a prominent\nmodality due to their high accuracy, resistance to spoofing, and non-invasive\nnature. However, morphing attacks, synthetic biometric traits created by\nblending features from multiple individuals, threaten biometric system\nintegrity. While extensively studied for near-infrared iris and face\nbiometrics, morphing in visible-spectrum ocular data remains underexplored.\nSimulating such attacks demands advanced generation models that handle\nuncontrolled conditions while preserving detailed ocular features like iris\nboundaries and periocular textures. To address this gap, we introduce DOOMGAN,\nthat encompasses landmark-driven encoding of visible ocular anatomy,\nattention-guided generation for realistic morph synthesis, and dynamic\nweighting of multi-faceted losses for optimized convergence. DOOMGAN achieves\nover 20% higher attack success rates than baseline methods under stringent\nthresholds, along with 20% better elliptical iris structure generation and 30%\nimproved gaze consistency. We also release the first comprehensive ocular\nmorphing dataset to support further research in this domain.",
        "url": "http://arxiv.org/abs/2507.17158v1",
        "published_date": "2025-07-23T02:43:49+00:00",
        "updated_date": "2025-07-23T02:43:49+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Bharath Krishnamurthy",
            "Ajita Rattani"
        ]
    },
    {
        "title": "UNICE: Training A Universal Image Contrast Enhancer",
        "summary": "Existing image contrast enhancement methods are typically designed for\nspecific tasks such as under-/over-exposure correction, low-light and backlit\nimage enhancement, etc. The learned models, however, exhibit poor\ngeneralization performance across different tasks, even across different\ndatasets of a specific task. It is important to explore whether we can learn a\nuniversal and generalized model for various contrast enhancement tasks. In this\nwork, we observe that the common key factor of these tasks lies in the need of\nexposure and contrast adjustment, which can be well-addressed if high-dynamic\nrange (HDR) inputs are available. We hence collect 46,928 HDR raw images from\npublic sources, and render 328,496 sRGB images to build multi-exposure\nsequences (MES) and the corresponding pseudo sRGB ground-truths via\nmulti-exposure fusion. Consequently, we train a network to generate an MES from\na single sRGB image, followed by training another network to fuse the generated\nMES into an enhanced image. Our proposed method, namely UNiversal Image\nContrast Enhancer (UNICE), is free of costly human labeling. However, it\ndemonstrates significantly stronger generalization performance than existing\nimage contrast enhancement methods across and within different tasks, even\noutperforming manually created ground-truths in multiple no-reference image\nquality metrics. The dataset, code and model are available at\nhttps://github.com/BeyondHeaven/UNICE.",
        "url": "http://arxiv.org/abs/2507.17157v1",
        "published_date": "2025-07-23T02:43:09+00:00",
        "updated_date": "2025-07-23T02:43:09+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Ruodai Cui",
            "Lei Zhang"
        ]
    },
    {
        "title": "ScSAM: Debiasing Morphology and Distributional Variability in Subcellular Semantic Segmentation",
        "summary": "The significant morphological and distributional variability among\nsubcellular components poses a long-standing challenge for learning-based\norganelle segmentation models, significantly increasing the risk of biased\nfeature learning. Existing methods often rely on single mapping relationships,\noverlooking feature diversity and thereby inducing biased training. Although\nthe Segment Anything Model (SAM) provides rich feature representations, its\napplication to subcellular scenarios is hindered by two key challenges: (1) The\nvariability in subcellular morphology and distribution creates gaps in the\nlabel space, leading the model to learn spurious or biased features. (2) SAM\nfocuses on global contextual understanding and often ignores fine-grained\nspatial details, making it challenging to capture subtle structural alterations\nand cope with skewed data distributions. To address these challenges, we\nintroduce ScSAM, a method that enhances feature robustness by fusing\npre-trained SAM with Masked Autoencoder (MAE)-guided cellular prior knowledge\nto alleviate training bias from data imbalance. Specifically, we design a\nfeature alignment and fusion module to align pre-trained embeddings to the same\nfeature space and efficiently combine different representations. Moreover, we\npresent a cosine similarity matrix-based class prompt encoder to activate\nclass-specific features to recognize subcellular categories. Extensive\nexperiments on diverse subcellular image datasets demonstrate that ScSAM\noutperforms state-of-the-art methods.",
        "url": "http://arxiv.org/abs/2507.17149v1",
        "published_date": "2025-07-23T02:28:43+00:00",
        "updated_date": "2025-07-23T02:28:43+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.LG",
            "I.4.6"
        ],
        "authors": [
            "Bo Fang",
            "Jianan Fan",
            "Dongnan Liu",
            "Hang Chang",
            "Gerald J. Shami",
            "Filip Braet",
            "Weidong Cai"
        ]
    },
    {
        "title": "VGS-ATD: Robust Distributed Learning for Multi-Label Medical Image Classification Under Heterogeneous and Imbalanced Conditions",
        "summary": "In recent years, advanced deep learning architectures have shown strong\nperformance in medical imaging tasks. However, the traditional centralized\nlearning paradigm poses serious privacy risks as all data is collected and\ntrained on a single server. To mitigate this challenge, decentralized\napproaches such as federated learning and swarm learning have emerged, allowing\nmodel training on local nodes while sharing only model weights. While these\nmethods enhance privacy, they struggle with heterogeneous and imbalanced data\nand suffer from inefficiencies due to frequent communication and the\naggregation of weights. More critically, the dynamic and complex nature of\nclinical environments demands scalable AI systems capable of continuously\nlearning from diverse modalities and multilabels. Yet, both centralized and\ndecentralized models are prone to catastrophic forgetting during system\nexpansion, often requiring full model retraining to incorporate new data. To\naddress these limitations, we propose VGS-ATD, a novel distributed learning\nframework. To validate VGS-ATD, we evaluate it in experiments spanning 30\ndatasets and 80 independent labels across distributed nodes, VGS-ATD achieved\nan overall accuracy of 92.7%, outperforming centralized learning (84.9%) and\nswarm learning (72.99%), while federated learning failed under these conditions\ndue to high requirements on computational resources. VGS-ATD also demonstrated\nstrong scalability, with only a 1% drop in accuracy on existing nodes after\nexpansion, compared to a 20% drop in centralized learning, highlighting its\nresilience to catastrophic forgetting. Additionally, it reduced computational\ncosts by up to 50% relative to both centralized and swarm learning, confirming\nits superior efficiency and scalability.",
        "url": "http://arxiv.org/abs/2507.18657v2",
        "published_date": "2025-07-23T02:27:31+00:00",
        "updated_date": "2025-07-28T03:40:05+00:00",
        "categories": [
            "cs.CV",
            "cs.CR"
        ],
        "authors": [
            "Zehui Zhao",
            "Laith Alzubaidi",
            "Haider A. Alwzwazy",
            "Jinglan Zhang",
            "Yuantong Gu"
        ]
    },
    {
        "title": "SADA: Stability-guided Adaptive Diffusion Acceleration",
        "summary": "Diffusion models have achieved remarkable success in generative tasks but\nsuffer from high computational costs due to their iterative sampling process\nand quadratic attention costs. Existing training-free acceleration strategies\nthat reduce per-step computation cost, while effectively reducing sampling\ntime, demonstrate low faithfulness compared to the original baseline. We\nhypothesize that this fidelity gap arises because (a) different prompts\ncorrespond to varying denoising trajectory, and (b) such methods do not\nconsider the underlying ODE formulation and its numerical solution. In this\npaper, we propose Stability-guided Adaptive Diffusion Acceleration (SADA), a\nnovel paradigm that unifies step-wise and token-wise sparsity decisions via a\nsingle stability criterion to accelerate sampling of ODE-based generative\nmodels (Diffusion and Flow-matching). For (a), SADA adaptively allocates\nsparsity based on the sampling trajectory. For (b), SADA introduces principled\napproximation schemes that leverage the precise gradient information from the\nnumerical ODE solver. Comprehensive evaluations on SD-2, SDXL, and Flux using\nboth EDM and DPM++ solvers reveal consistent $\\ge 1.8\\times$ speedups with\nminimal fidelity degradation (LPIPS $\\leq 0.10$ and FID $\\leq 4.5$) compared to\nunmodified baselines, significantly outperforming prior methods. Moreover, SADA\nadapts seamlessly to other pipelines and modalities: It accelerates ControlNet\nwithout any modifications and speeds up MusicLDM by $1.8\\times$ with $\\sim\n0.01$ spectrogram LPIPS.",
        "url": "http://arxiv.org/abs/2507.17135v1",
        "published_date": "2025-07-23T02:15:45+00:00",
        "updated_date": "2025-07-23T02:15:45+00:00",
        "categories": [
            "cs.LG",
            "cs.AI",
            "cs.CV"
        ],
        "authors": [
            "Ting Jiang",
            "Yixiao Wang",
            "Hancheng Ye",
            "Zishan Shao",
            "Jingwei Sun",
            "Jingyang Zhang",
            "Zekai Chen",
            "Jianyi Zhang",
            "Yiran Chen",
            "Hai Li"
        ]
    },
    {
        "title": "Addressing High Class Imbalance in Multi-Class Diabetic Retinopathy Severity Grading with Augmentation and Transfer Learning",
        "summary": "Diabetic retinopathy (DR) is a leading cause of vision loss worldwide, and\nearly diagnosis through automated retinal image analysis can significantly\nreduce the risk of blindness. This paper presents a robust deep learning\nframework for both binary and five-class DR classification, leveraging transfer\nlearning and extensive data augmentation to address the challenges of class\nimbalance and limited training data. We evaluate a range of pretrained\nconvolutional neural network architectures, including variants of ResNet and\nEfficientNet, on the APTOS 2019 dataset.\n  For binary classification, our proposed model achieves a state-of-the-art\naccuracy of 98.9%, with a precision of 98.6%, recall of 99.3%, F1-score of\n98.9%, and an AUC of 99.4%. In the more challenging five-class severity\nclassification task, our model obtains a competitive accuracy of 84.6% and an\nAUC of 94.1%, outperforming several existing approaches. Our findings also\ndemonstrate that EfficientNet-B0 and ResNet34 offer optimal trade-offs between\naccuracy and computational efficiency across both tasks.\n  These results underscore the effectiveness of combining class-balanced\naugmentation with transfer learning for high-performance DR diagnosis. The\nproposed framework provides a scalable and accurate solution for DR screening,\nwith potential for deployment in real-world clinical environments.",
        "url": "http://arxiv.org/abs/2507.17121v2",
        "published_date": "2025-07-23T01:52:27+00:00",
        "updated_date": "2025-07-28T23:58:31+00:00",
        "categories": [
            "cs.CV",
            "cs.LG",
            "F.2.2; I.2.7"
        ],
        "authors": [
            "Faisal Ahmed"
        ]
    },
    {
        "title": "IONext: Unlocking the Next Era of Inertial Odometry",
        "summary": "Researchers have increasingly adopted Transformer-based models for inertial\nodometry. While Transformers excel at modeling long-range dependencies, their\nlimited sensitivity to local, fine-grained motion variations and lack of\ninherent inductive biases often hinder localization accuracy and\ngeneralization. Recent studies have shown that incorporating large-kernel\nconvolutions and Transformer-inspired architectural designs into CNN can\neffectively expand the receptive field, thereby improving global motion\nperception. Motivated by these insights, we propose a novel CNN-based module\ncalled the Dual-wing Adaptive Dynamic Mixer (DADM), which adaptively captures\nboth global motion patterns and local, fine-grained motion features from\ndynamic inputs. This module dynamically generates selective weights based on\nthe input, enabling efficient multi-scale feature aggregation. To further\nimprove temporal modeling, we introduce the Spatio-Temporal Gating Unit (STGU),\nwhich selectively extracts representative and task-relevant motion features in\nthe temporal domain. This unit addresses the limitations of temporal modeling\nobserved in existing CNN approaches. Built upon DADM and STGU, we present a new\nCNN-based inertial odometry backbone, named Next Era of Inertial Odometry\n(IONext). Extensive experiments on six public datasets demonstrate that IONext\nconsistently outperforms state-of-the-art (SOTA) Transformer- and CNN-based\nmethods. For instance, on the RNIN dataset, IONext reduces the average ATE by\n10% and the average RTE by 12% compared to the representative model iMOT.",
        "url": "http://arxiv.org/abs/2507.17089v1",
        "published_date": "2025-07-23T00:09:36+00:00",
        "updated_date": "2025-07-23T00:09:36+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Shanshan Zhang",
            "Siyue Wang",
            "Tianshui Wen",
            "Qi Zhang",
            "Ziheng Zhou",
            "Lingxiang Zheng",
            "Yu Yang"
        ]
    },
    {
        "title": "FedVLM: Scalable Personalized Vision-Language Models through Federated Learning",
        "summary": "Vision-language models (VLMs) demonstrate impressive zero-shot and few-shot\nlearning capabilities, making them essential for several downstream tasks.\nHowever, fine-tuning these models at scale remains challenging, particularly in\nfederated environments where data is decentralized and non-iid across clients.\nExisting parameter-efficient tuning methods like LoRA (Low-Rank Adaptation)\nreduce computational overhead but struggle with heterogeneous client data,\nleading to suboptimal generalization. To address these challenges, we propose\nFedVLM, a federated LoRA fine-tuning framework that enables decentralized\nadaptation of VLMs while preserving model privacy and reducing reliance on\ncentralized training. To further tackle data heterogeneity, we introduce\npersonalized LoRA (pLoRA), which dynamically adapts LoRA parameters to each\nclient's unique data distribution, significantly improving local adaptation\nwhile maintaining global model aggregation. Experiments on the RLAIF-V dataset\nshow that pLoRA improves client-specific performance by 24.5% over standard\nLoRA, demonstrating superior adaptation in non-iid settings. FedVLM provides a\nscalable and efficient solution for fine-tuning VLMs in federated settings,\nadvancing personalized adaptation in distributed learning scenarios.",
        "url": "http://arxiv.org/abs/2507.17088v1",
        "published_date": "2025-07-23T00:05:02+00:00",
        "updated_date": "2025-07-23T00:05:02+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Arkajyoti Mitra",
            "Afia Anjum",
            "Paul Agbaje",
            "Mert Pesé",
            "Habeeb Olufowobi"
        ]
    },
    {
        "title": "SDGOCC: Semantic and Depth-Guided Bird's-Eye View Transformation for 3D Multimodal Occupancy Prediction",
        "summary": "Multimodal 3D occupancy prediction has garnered significant attention for its\npotential in autonomous driving. However, most existing approaches are\nsingle-modality: camera-based methods lack depth information, while LiDAR-based\nmethods struggle with occlusions. Current lightweight methods primarily rely on\nthe Lift-Splat-Shoot (LSS) pipeline, which suffers from inaccurate depth\nestimation and fails to fully exploit the geometric and semantic information of\n3D LiDAR points. Therefore, we propose a novel multimodal occupancy prediction\nnetwork called SDG-OCC, which incorporates a joint semantic and depth-guided\nview transformation coupled with a fusion-to-occupancy-driven active\ndistillation. The enhanced view transformation constructs accurate depth\ndistributions by integrating pixel semantics and co-point depth through\ndiffusion and bilinear discretization. The fusion-to-occupancy-driven active\ndistillation extracts rich semantic information from multimodal data and\nselectively transfers knowledge to image features based on LiDAR-identified\nregions. Finally, for optimal performance, we introduce SDG-Fusion, which uses\nfusion alone, and SDG-KL, which integrates both fusion and distillation for\nfaster inference. Our method achieves state-of-the-art (SOTA) performance with\nreal-time processing on the Occ3D-nuScenes dataset and shows comparable\nperformance on the more challenging SurroundOcc-nuScenes dataset, demonstrating\nits effectiveness and robustness. The code will be released at\nhttps://github.com/DzpLab/SDGOCC.",
        "url": "http://arxiv.org/abs/2507.17083v1",
        "published_date": "2025-07-22T23:49:40+00:00",
        "updated_date": "2025-07-22T23:49:40+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Zaipeng Duan",
            "Chenxu Dang",
            "Xuzhong Hu",
            "Pei An",
            "Junfeng Ding",
            "Jie Zhan",
            "Yunbiao Xu",
            "Jie Ma"
        ]
    },
    {
        "title": "VL-CLIP: Enhancing Multimodal Recommendations via Visual Grounding and LLM-Augmented CLIP Embeddings",
        "summary": "Multimodal learning plays a critical role in e-commerce recommendation\nplatforms today, enabling accurate recommendations and product understanding.\nHowever, existing vision-language models, such as CLIP, face key challenges in\ne-commerce recommendation systems: 1) Weak object-level alignment, where global\nimage embeddings fail to capture fine-grained product attributes, leading to\nsuboptimal retrieval performance; 2) Ambiguous textual representations, where\nproduct descriptions often lack contextual clarity, affecting cross-modal\nmatching; and 3) Domain mismatch, as generic vision-language models may not\ngeneralize well to e-commerce-specific data. To address these limitations, we\npropose a framework, VL-CLIP, that enhances CLIP embeddings by integrating\nVisual Grounding for fine-grained visual understanding and an LLM-based agent\nfor generating enriched text embeddings. Visual Grounding refines image\nrepresentations by localizing key products, while the LLM agent enhances\ntextual features by disambiguating product descriptions. Our approach\nsignificantly improves retrieval accuracy, multimodal retrieval effectiveness,\nand recommendation quality across tens of millions of items on one of the\nlargest e-commerce platforms in the U.S., increasing CTR by 18.6%, ATC by\n15.5%, and GMV by 4.0%. Additional experimental results show that our framework\noutperforms vision-language models, including CLIP, FashionCLIP, and GCL, in\nboth precision and semantic alignment, demonstrating the potential of combining\nobject-aware visual grounding and LLM-enhanced text representation for robust\nmultimodal recommendations.",
        "url": "http://arxiv.org/abs/2507.17080v1",
        "published_date": "2025-07-22T23:45:43+00:00",
        "updated_date": "2025-07-22T23:45:43+00:00",
        "categories": [
            "cs.IR",
            "cs.AI",
            "cs.CV"
        ],
        "authors": [
            "Ramin Giahi",
            "Kehui Yao",
            "Sriram Kollipara",
            "Kai Zhao",
            "Vahid Mirjalili",
            "Jianpeng Xu",
            "Topojoy Biswas",
            "Evren Korpeoglu",
            "Kannan Achan"
        ]
    },
    {
        "title": "Few-Shot Learning in Video and 3D Object Detection: A Survey",
        "summary": "Few-shot learning (FSL) enables object detection models to recognize novel\nclasses given only a few annotated examples, thereby reducing expensive manual\ndata labeling. This survey examines recent FSL advances for video and 3D object\ndetection. For video, FSL is especially valuable since annotating objects\nacross frames is more laborious than for static images. By propagating\ninformation across frames, techniques like tube proposals and temporal matching\nnetworks can detect new classes from a couple examples, efficiently leveraging\nspatiotemporal structure. FSL for 3D detection from LiDAR or depth data faces\nchallenges like sparsity and lack of texture. Solutions integrate FSL with\nspecialized point cloud networks and losses tailored for class imbalance.\nFew-shot 3D detection enables practical autonomous driving deployment by\nminimizing costly 3D annotation needs. Core issues in both domains include\nbalancing generalization and overfitting, integrating prototype matching, and\nhandling data modality properties. In summary, FSL shows promise for reducing\nannotation requirements and enabling real-world video, 3D, and other\napplications by efficiently leveraging information across feature, temporal,\nand data modalities. By comprehensively surveying recent advancements, this\npaper illuminates FSL's potential to minimize supervision needs and enable\ndeployment across video, 3D, and other real-world applications.",
        "url": "http://arxiv.org/abs/2507.17079v1",
        "published_date": "2025-07-22T23:37:20+00:00",
        "updated_date": "2025-07-22T23:37:20+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Md Meftahul Ferdaus",
            "Kendall N. Niles",
            "Joe Tom",
            "Mahdi Abdelguerfi",
            "Elias Ioup"
        ]
    },
    {
        "title": "Toward Scalable Video Narration: A Training-free Approach Using Multimodal Large Language Models",
        "summary": "In this paper, we introduce VideoNarrator, a novel training-free pipeline\ndesigned to generate dense video captions that offer a structured snapshot of\nvideo content. These captions offer detailed narrations with precise\ntimestamps, capturing the nuances present in each segment of the video. Despite\nadvancements in multimodal large language models (MLLMs) for video\ncomprehension, these models often struggle with temporally aligned narrations\nand tend to hallucinate, particularly in unfamiliar scenarios. VideoNarrator\naddresses these challenges by leveraging a flexible pipeline where\noff-the-shelf MLLMs and visual-language models (VLMs) can function as caption\ngenerators, context providers, or caption verifiers. Our experimental results\ndemonstrate that the synergistic interaction of these components significantly\nenhances the quality and accuracy of video narrations, effectively reducing\nhallucinations and improving temporal alignment. This structured approach not\nonly enhances video understanding but also facilitates downstream tasks such as\nvideo summarization and video question answering, and can be potentially\nextended for advertising and marketing applications.",
        "url": "http://arxiv.org/abs/2507.17050v1",
        "published_date": "2025-07-22T22:16:37+00:00",
        "updated_date": "2025-07-22T22:16:37+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Tz-Ying Wu",
            "Tahani Trigui",
            "Sharath Nittur Sridhar",
            "Anand Bodas",
            "Subarna Tripathi"
        ]
    },
    {
        "title": "Controllable Hybrid Captioner for Improved Long-form Video Understanding",
        "summary": "Video data, especially long-form video, is extremely dense and\nhigh-dimensional. Text-based summaries of video content offer a way to\nrepresent query-relevant content in a much more compact manner than raw video.\nIn addition, textual representations are easily ingested by state-of-the-art\nlarge language models (LLMs), which enable reasoning over video content to\nanswer complex natural language queries. To solve this issue, we rely on the\nprogressive construction of a text-based memory by a video captioner operating\non shorter chunks of the video, where spatio-temporal modeling is\ncomputationally feasible. We explore ways to improve the quality of the\nactivity log comprised solely of short video captions. Because the video\ncaptions tend to be focused on human actions, and questions may pertain to\nother information in the scene, we seek to enrich the memory with static scene\ndescriptions using Vision Language Models (VLMs). Our video understanding\nsystem relies on the LaViLa video captioner in combination with a LLM to answer\nquestions about videos. We first explored different ways of partitioning the\nvideo into meaningful segments such that the textual descriptions more\naccurately reflect the structure of the video content. Furthermore, we\nincorporated static scene descriptions into the captioning pipeline using LLaVA\nVLM, resulting in a more detailed and complete caption log and expanding the\nspace of questions that are answerable from the textual memory. Finally, we\nhave successfully fine-tuned the LaViLa video captioner to produce both action\nand scene captions, significantly improving the efficiency of the captioning\npipeline compared to using separate captioning models for the two tasks. Our\nmodel, controllable hybrid captioner, can alternate between different types of\ncaptions according to special input tokens that signals scene changes detected\nin the video.",
        "url": "http://arxiv.org/abs/2507.17047v1",
        "published_date": "2025-07-22T22:09:00+00:00",
        "updated_date": "2025-07-22T22:09:00+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Kuleen Sasse",
            "Efsun Sarioglu Kayi",
            "Arun Reddy"
        ]
    },
    {
        "title": "Transformer Based Building Boundary Reconstruction using Attraction Field Maps",
        "summary": "In recent years, the number of remote satellites orbiting the Earth has grown\nsignificantly, streaming vast amounts of high-resolution visual data to support\ndiverse applications across civil, public, and military domains. Among these\napplications, the generation and updating of spatial maps of the built\nenvironment have become critical due to the extensive coverage and detailed\nimagery provided by satellites. However, reconstructing spatial maps from\nsatellite imagery is a complex computer vision task, requiring the creation of\nhigh-level object representations, such as primitives, to accurately capture\nthe built environment. While the past decade has witnessed remarkable\nadvancements in object detection and representation using visual data,\nprimitives-based object representation remains a persistent challenge in\ncomputer vision. Consequently, high-quality spatial maps often rely on\nlabor-intensive and manual processes. This paper introduces a novel deep\nlearning methodology leveraging Graph Convolutional Networks (GCNs) to address\nthese challenges in building footprint reconstruction. The proposed approach\nenhances performance by incorporating geometric regularity into building\nboundaries, integrating multi-scale and multi-resolution features, and\nembedding Attraction Field Maps into the network. These innovations provide a\nscalable and precise solution for automated building footprint extraction from\na single satellite image, paving the way for impactful applications in urban\nplanning, disaster management, and large-scale spatial analysis. Our model,\nDecoupled-PolyGCN, outperforms existing methods by 6% in AP and 10% in AR,\ndemonstrating its ability to deliver accurate and regularized building\nfootprints across diverse and challenging scenarios.",
        "url": "http://arxiv.org/abs/2507.17038v1",
        "published_date": "2025-07-22T21:53:03+00:00",
        "updated_date": "2025-07-22T21:53:03+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Muhammad Kamran",
            "Mohammad Moein Sheikholeslami",
            "Andreas Wichmann",
            "Gunho Sohn"
        ]
    },
    {
        "title": "StreamME: Simplify 3D Gaussian Avatar within Live Stream",
        "summary": "We propose StreamME, a method focuses on fast 3D avatar reconstruction. The\nStreamME synchronously records and reconstructs a head avatar from live video\nstreams without any pre-cached data, enabling seamless integration of the\nreconstructed appearance into downstream applications. This exceptionally fast\ntraining strategy, which we refer to as on-the-fly training, is central to our\napproach. Our method is built upon 3D Gaussian Splatting (3DGS), eliminating\nthe reliance on MLPs in deformable 3DGS and relying solely on geometry, which\nsignificantly improves the adaptation speed to facial expression. To further\nensure high efficiency in on-the-fly training, we introduced a simplification\nstrategy based on primary points, which distributes the point clouds more\nsparsely across the facial surface, optimizing points number while maintaining\nrendering quality. Leveraging the on-the-fly training capabilities, our method\nprotects the facial privacy and reduces communication bandwidth in VR system or\nonline conference. Additionally, it can be directly applied to downstream\napplication such as animation, toonify, and relighting. Please refer to our\nproject page for more details: https://songluchuan.github.io/StreamME/.",
        "url": "http://arxiv.org/abs/2507.17029v1",
        "published_date": "2025-07-22T21:33:30+00:00",
        "updated_date": "2025-07-22T21:33:30+00:00",
        "categories": [
            "cs.GR",
            "cs.AI",
            "cs.CV"
        ],
        "authors": [
            "Luchuan Song",
            "Yang Zhou",
            "Zhan Xu",
            "Yi Zhou",
            "Deepali Aneja",
            "Chenliang Xu"
        ]
    },
    {
        "title": "Bringing Balance to Hand Shape Classification: Mitigating Data Imbalance Through Generative Models",
        "summary": "Most sign language handshape datasets are severely limited and unbalanced,\nposing significant challenges to effective model training. In this paper, we\nexplore the effectiveness of augmenting the training data of a handshape\nclassifier by generating synthetic data. We use an EfficientNet classifier\ntrained on the RWTH German sign language handshape dataset, which is small and\nheavily unbalanced, applying different strategies to combine generated and real\nimages. We compare two Generative Adversarial Networks (GAN) architectures for\ndata generation: ReACGAN, which uses label information to condition the data\ngeneration process through an auxiliary classifier, and SPADE, which utilizes\nspatially-adaptive normalization to condition the generation on pose\ninformation. ReACGAN allows for the generation of realistic images that align\nwith specific handshape labels, while SPADE focuses on generating images with\naccurate spatial handshape configurations. Our proposed techniques improve the\ncurrent state-of-the-art accuracy on the RWTH dataset by 5%, addressing the\nlimitations of small and unbalanced datasets. Additionally, our method\ndemonstrates the capability to generalize across different sign language\ndatasets by leveraging pose-based generation trained on the extensive HaGRID\ndataset. We achieve comparable performance to single-source trained classifiers\nwithout the need for retraining the generator.",
        "url": "http://arxiv.org/abs/2507.17008v1",
        "published_date": "2025-07-22T20:41:29+00:00",
        "updated_date": "2025-07-22T20:41:29+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Gaston Gustavo Rios",
            "Pedro Dal Bianco",
            "Franco Ronchetti",
            "Facundo Quiroga",
            "Oscar Stanchi",
            "Santiago Ponte Ahón",
            "Waldo Hasperué"
        ]
    },
    {
        "title": "Divisive Decisions: Improving Salience-Based Training for Generalization in Binary Classification Tasks",
        "summary": "Existing saliency-guided training approaches improve model generalization by\nincorporating a loss term that compares the model's class activation map (CAM)\nfor a sample's true-class ({\\it i.e.}, correct-label class) against a human\nreference saliency map. However, prior work has ignored the false-class CAM(s),\nthat is the model's saliency obtained for incorrect-label class. We hypothesize\nthat in binary tasks the true and false CAMs should diverge on the important\nclassification features identified by humans (and reflected in human saliency\nmaps). We use this hypothesis to motivate three new saliency-guided training\nmethods incorporating both true- and false-class model's CAM into the training\nstrategy and a novel post-hoc tool for identifying important features. We\nevaluate all introduced methods on several diverse binary close-set and\nopen-set classification tasks, including synthetic face detection, biometric\npresentation attack detection, and classification of anomalies in chest X-ray\nscans, and find that the proposed methods improve generalization capabilities\nof deep learning models over traditional (true-class CAM only) saliency-guided\ntraining approaches. We offer source codes and model weights\\footnote{GitHub\nrepository link removed to preserve anonymity} to support reproducible\nresearch.",
        "url": "http://arxiv.org/abs/2507.17000v1",
        "published_date": "2025-07-22T20:17:08+00:00",
        "updated_date": "2025-07-22T20:17:08+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Jacob Piland",
            "Chris Sweet",
            "Adam Czajka"
        ]
    },
    {
        "title": "ShrinkBox: Backdoor Attack on Object Detection to Disrupt Collision Avoidance in Machine Learning-based Advanced Driver Assistance Systems",
        "summary": "Advanced Driver Assistance Systems (ADAS) significantly enhance road safety\nby detecting potential collisions and alerting drivers. However, their reliance\non expensive sensor technologies such as LiDAR and radar limits accessibility,\nparticularly in low- and middle-income countries. Machine learning-based ADAS\n(ML-ADAS), leveraging deep neural networks (DNNs) with only standard camera\ninput, offers a cost-effective alternative. Critical to ML-ADAS is the\ncollision avoidance feature, which requires the ability to detect objects and\nestimate their distances accurately. This is achieved with specialized DNNs\nlike YOLO, which provides real-time object detection, and a lightweight,\ndetection-wise distance estimation approach that relies on key features\nextracted from the detections like bounding box dimensions and size. However,\nthe robustness of these systems is undermined by security vulnerabilities in\nobject detectors. In this paper, we introduce ShrinkBox, a novel backdoor\nattack targeting object detection in collision avoidance ML-ADAS. Unlike\nexisting attacks that manipulate object class labels or presence, ShrinkBox\nsubtly shrinks ground truth bounding boxes. This attack remains undetected in\ndataset inspections and standard benchmarks while severely disrupting\ndownstream distance estimation. We demonstrate that ShrinkBox can be realized\nin the YOLOv9m object detector at an Attack Success Rate (ASR) of 96%, with\nonly a 4% poisoning ratio in the training instances of the KITTI dataset.\nFurthermore, given the low error targets introduced in our relaxed poisoning\nstrategy, we find that ShrinkBox increases the Mean Absolute Error (MAE) in\ndownstream distance estimation by more than 3x on poisoned samples, potentially\nresulting in delays or prevention of collision warnings altogether.",
        "url": "http://arxiv.org/abs/2507.18656v1",
        "published_date": "2025-07-22T20:04:29+00:00",
        "updated_date": "2025-07-22T20:04:29+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Muhammad Zaeem Shahzad",
            "Muhammad Abdullah Hanif",
            "Bassem Ouni",
            "Muhammad Shafique"
        ]
    },
    {
        "title": "Part Segmentation of Human Meshes via Multi-View Human Parsing",
        "summary": "Recent advances in point cloud deep learning have led to models that achieve\nhigh per-part labeling accuracy on large-scale point clouds, using only the raw\ngeometry of unordered point sets. In parallel, the field of human parsing\nfocuses on predicting body part and clothing/accessory labels from images. This\nwork aims to bridge these two domains by enabling per-vertex semantic\nsegmentation of large-scale human meshes. To achieve this, a pseudo-ground\ntruth labeling pipeline is developed for the Thuman2.1 dataset: meshes are\nfirst aligned to a canonical pose, segmented from multiple viewpoints, and the\nresulting point-level labels are then backprojected onto the original mesh to\nproduce per-point pseudo ground truth annotations. Subsequently, a novel,\nmemory-efficient sampling strategy is introduced, a windowed iterative farthest\npoint sampling (FPS) with space-filling curve-based serialization to\neffectively downsample the point clouds. This is followed by a purely geometric\nsegmentation using PointTransformer, enabling semantic parsing of human meshes\nwithout relying on texture information. Experimental results confirm the\neffectiveness and accuracy of the proposed approach.",
        "url": "http://arxiv.org/abs/2507.18655v2",
        "published_date": "2025-07-22T19:42:34+00:00",
        "updated_date": "2025-07-28T01:06:32+00:00",
        "categories": [
            "cs.CV",
            "eess.IV"
        ],
        "authors": [
            "James Dickens",
            "Kamyar Hamad"
        ]
    },
    {
        "title": "Diffusion Models for Solving Inverse Problems via Posterior Sampling with Piecewise Guidance",
        "summary": "Diffusion models are powerful tools for sampling from high-dimensional\ndistributions by progressively transforming pure noise into structured data\nthrough a denoising process. When equipped with a guidance mechanism, these\nmodels can also generate samples from conditional distributions. In this paper,\na novel diffusion-based framework is introduced for solving inverse problems\nusing a piecewise guidance scheme. The guidance term is defined as a piecewise\nfunction of the diffusion timestep, facilitating the use of different\napproximations during high-noise and low-noise phases. This design is shown to\neffectively balance computational efficiency with the accuracy of the guidance\nterm. Unlike task-specific approaches that require retraining for each problem,\nthe proposed method is problem-agnostic and readily adaptable to a variety of\ninverse problems. Additionally, it explicitly incorporates measurement noise\ninto the reconstruction process. The effectiveness of the proposed framework is\ndemonstrated through extensive experiments on image restoration tasks,\nspecifically image inpainting and super-resolution. Using a class conditional\ndiffusion model for recovery, compared to the \\pgdm baseline, the proposed\nframework achieves a reduction in inference time of \\(25\\%\\) for inpainting\nwith both random and center masks, and \\(23\\%\\) and \\(24\\%\\) for \\(4\\times\\)\nand \\(8\\times\\) super-resolution tasks, respectively, while incurring only\nnegligible loss in PSNR and SSIM.",
        "url": "http://arxiv.org/abs/2507.18654v1",
        "published_date": "2025-07-22T19:35:14+00:00",
        "updated_date": "2025-07-22T19:35:14+00:00",
        "categories": [
            "cs.LG",
            "cs.CV"
        ],
        "authors": [
            "Saeed Mohseni-Sehdeh",
            "Walid Saad",
            "Kei Sakaguchi",
            "Tao Yu"
        ]
    },
    {
        "title": "Harmonization in Magnetic Resonance Imaging: A Survey of Acquisition, Image-level, and Feature-level Methods",
        "summary": "Modern medical imaging technologies have greatly advanced neuroscience\nresearch and clinical diagnostics. However, imaging data collected across\ndifferent scanners, acquisition protocols, or imaging sites often exhibit\nsubstantial heterogeneity, known as \"batch effects\" or \"site effects\". These\nnon-biological sources of variability can obscure true biological signals,\nreduce reproducibility and statistical power, and severely impair the\ngeneralizability of learning-based models across datasets. Image harmonization\naims to eliminate or mitigate such site-related biases while preserving\nmeaningful biological information, thereby improving data comparability and\nconsistency. This review provides a comprehensive overview of key concepts,\nmethodological advances, publicly available datasets, current challenges, and\nfuture directions in the field of medical image harmonization, with a focus on\nmagnetic resonance imaging (MRI). We systematically cover the full imaging\npipeline, and categorize harmonization approaches into prospective acquisition\nand reconstruction strategies, retrospective image-level and feature-level\nmethods, and traveling-subject-based techniques. Rather than providing an\nexhaustive survey, we focus on representative methods, with particular emphasis\non deep learning-based approaches. Finally, we summarize the major challenges\nthat remain and outline promising avenues for future research.",
        "url": "http://arxiv.org/abs/2507.16962v1",
        "published_date": "2025-07-22T19:06:02+00:00",
        "updated_date": "2025-07-22T19:06:02+00:00",
        "categories": [
            "eess.IV",
            "cs.CV",
            "physics.med-ph"
        ],
        "authors": [
            "Qinqin Yang",
            "Firoozeh Shomal-Zadeh",
            "Ali Gholipour"
        ]
    },
    {
        "title": "A Hybrid CNN-VSSM model for Multi-View, Multi-Task Mammography Analysis: Robust Diagnosis with Attention-Based Fusion",
        "summary": "Early and accurate interpretation of screening mammograms is essential for\neffective breast cancer detection, yet it remains a complex challenge due to\nsubtle imaging findings and diagnostic ambiguity. Many existing AI approaches\nfall short by focusing on single view inputs or single-task outputs, limiting\ntheir clinical utility. To address these limitations, we propose a novel\nmulti-view, multitask hybrid deep learning framework that processes all four\nstandard mammography views and jointly predicts diagnostic labels and BI-RADS\nscores for each breast. Our architecture integrates a hybrid CNN VSSM backbone,\ncombining convolutional encoders for rich local feature extraction with Visual\nState Space Models (VSSMs) to capture global contextual dependencies. To\nimprove robustness and interpretability, we incorporate a gated attention-based\nfusion module that dynamically weights information across views, effectively\nhandling cases with missing data. We conduct extensive experiments across\ndiagnostic tasks of varying complexity, benchmarking our proposed hybrid models\nagainst baseline CNN architectures and VSSM models in both single task and\nmulti task learning settings. Across all tasks, the hybrid models consistently\noutperform the baselines. In the binary BI-RADS 1 vs. 5 classification task,\nthe shared hybrid model achieves an AUC of 0.9967 and an F1 score of 0.9830.\nFor the more challenging ternary classification, it attains an F1 score of\n0.7790, while in the five-class BI-RADS task, the best F1 score reaches 0.4904.\nThese results highlight the effectiveness of the proposed hybrid framework and\nunderscore both the potential and limitations of multitask learning for\nimproving diagnostic performance and enabling clinically meaningful mammography\nanalysis.",
        "url": "http://arxiv.org/abs/2507.16955v1",
        "published_date": "2025-07-22T18:52:18+00:00",
        "updated_date": "2025-07-22T18:52:18+00:00",
        "categories": [
            "eess.IV",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Yalda Zafari",
            "Roaa Elalfy",
            "Mohamed Mabrok",
            "Somaya Al-Maadeed",
            "Tamer Khattab",
            "Essam A. Rashed"
        ]
    },
    {
        "title": "Adapt, But Don't Forget: Fine-Tuning and Contrastive Routing for Lane Detection under Distribution Shift",
        "summary": "Lane detection models are often evaluated in a closed-world setting, where\ntraining and testing occur on the same dataset. We observe that, even within\nthe same domain, cross-dataset distribution shifts can cause severe\ncatastrophic forgetting during fine-tuning. To address this, we first train a\nbase model on a source distribution and then adapt it to each new target\ndistribution by creating separate branches, fine-tuning only selected\ncomponents while keeping the original source branch fixed. Based on a\ncomponent-wise analysis, we identify effective fine-tuning strategies for\ntarget distributions that enable parameter-efficient adaptation. At inference\ntime, we propose using a supervised contrastive learning model to identify the\ninput distribution and dynamically route it to the corresponding branch. Our\nframework achieves near-optimal F1-scores while using significantly fewer\nparameters than training separate models for each distribution.",
        "url": "http://arxiv.org/abs/2507.18653v1",
        "published_date": "2025-07-22T18:39:15+00:00",
        "updated_date": "2025-07-22T18:39:15+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Mohammed Abdul Hafeez Khan",
            "Parth Ganeriwala",
            "Sarah M. Lehman",
            "Siddhartha Bhattacharyya",
            "Amy Alvarez",
            "Natasha Neogi"
        ]
    },
    {
        "title": "Toward Long-Tailed Online Anomaly Detection through Class-Agnostic Concepts",
        "summary": "Anomaly detection (AD) identifies the defect regions of a given image. Recent\nworks have studied AD, focusing on learning AD without abnormal images, with\nlong-tailed distributed training data, and using a unified model for all\nclasses. In addition, online AD learning has also been explored. In this work,\nwe expand in both directions to a realistic setting by considering the novel\ntask of long-tailed online AD (LTOAD). We first identified that the offline\nstate-of-the-art LTAD methods cannot be directly applied to the online setting.\nSpecifically, LTAD is class-aware, requiring class labels that are not\navailable in the online setting. To address this challenge, we propose a\nclass-agnostic framework for LTAD and then adapt it to our online learning\nsetting. Our method outperforms the SOTA baselines in most offline LTAD\nsettings, including both the industrial manufacturing and the medical domain.\nIn particular, we observe +4.63% image-AUROC on MVTec even compared to methods\nthat have access to class labels and the number of classes. In the most\nchallenging long-tailed online setting, we achieve +0.53% image-AUROC compared\nto baselines. Our LTOAD benchmark is released here:\nhttps://doi.org/10.5281/zenodo.16283852 .",
        "url": "http://arxiv.org/abs/2507.16946v1",
        "published_date": "2025-07-22T18:35:50+00:00",
        "updated_date": "2025-07-22T18:35:50+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Chiao-An Yang",
            "Kuan-Chuan Peng",
            "Raymond A. Yeh"
        ]
    },
    {
        "title": "AURA: A Multi-Modal Medical Agent for Understanding, Reasoning & Annotation",
        "summary": "Recent advancements in Large Language Models (LLMs) have catalyzed a paradigm\nshift from static prediction systems to agentic AI agents capable of reasoning,\ninteracting with tools, and adapting to complex tasks. While LLM-based agentic\nsystems have shown promise across many domains, their application to medical\nimaging remains in its infancy. In this work, we introduce AURA, the first\nvisual linguistic explainability agent designed specifically for comprehensive\nanalysis, explanation, and evaluation of medical images. By enabling dynamic\ninteractions, contextual explanations, and hypothesis testing, AURA represents\na significant advancement toward more transparent, adaptable, and clinically\naligned AI systems. We highlight the promise of agentic AI in transforming\nmedical image analysis from static predictions to interactive decision support.\nLeveraging Qwen-32B, an LLM-based architecture, AURA integrates a modular\ntoolbox comprising: (i) a segmentation suite with phase grounding, pathology\nsegmentation, and anatomy segmentation to localize clinically meaningful\nregions; (ii) a counterfactual image-generation module that supports reasoning\nthrough image-level explanations; and (iii) a set of evaluation tools including\npixel-wise difference-map analysis, classification, and advanced\nstate-of-the-art components to assess diagnostic relevance and visual\ninterpretability.",
        "url": "http://arxiv.org/abs/2507.16940v1",
        "published_date": "2025-07-22T18:24:18+00:00",
        "updated_date": "2025-07-22T18:24:18+00:00",
        "categories": [
            "cs.CV",
            "cs.LG",
            "cs.MA"
        ],
        "authors": [
            "Nima Fathi",
            "Amar Kumar",
            "Tal Arbel"
        ]
    }
]