[
    {
        "title": "ERGO: Efficient High-Resolution Visual Understanding for Vision-Language Models",
        "summary": "Efficient processing of high-resolution images is crucial for real-world\nvision-language applications. However, existing Large Vision-Language Models\n(LVLMs) incur substantial computational overhead due to the large number of\nvision tokens. With the advent of \"thinking with images\" models, reasoning now\nextends beyond text to the visual domain. This capability motivates our\ntwo-stage \"coarse-to-fine\" reasoning pipeline: first, a downsampled image is\nanalyzed to identify task-relevant regions; then, only these regions are\ncropped at full resolution and processed in a subsequent reasoning stage. This\napproach reduces computational cost while preserving fine-grained visual\ndetails where necessary. A major challenge lies in inferring which regions are\ntruly relevant to a given query. Recent related methods often fail in the first\nstage after input-image downsampling, due to perception-driven reasoning, where\nclear visual information is required for effective reasoning. To address this\nissue, we propose ERGO (Efficient Reasoning & Guided Observation) that performs\nreasoning-driven perception-leveraging multimodal context to determine where to\nfocus. Our model can account for perceptual uncertainty, expanding the cropped\nregion to cover visually ambiguous areas for answering questions. To this end,\nwe develop simple yet effective reward components in a reinforcement learning\nframework for coarse-to-fine perception. Across multiple datasets, our approach\ndelivers higher accuracy than the original model and competitive methods, with\ngreater efficiency. For instance, ERGO surpasses Qwen2.5-VL-7B on the V*\nbenchmark by 4.7 points while using only 23% of the vision tokens, achieving a\n3x inference speedup. The code and models can be found at:\nhttps://github.com/nota-github/ERGO.",
        "url": "http://arxiv.org/abs/2509.21991v1",
        "published_date": "2025-09-26T07:15:19+00:00",
        "updated_date": "2025-09-26T07:15:19+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL",
            "cs.LG"
        ],
        "authors": [
            "Jewon Lee",
            "Wooksu Shin",
            "Seungmin Yang",
            "Ki-Ung Song",
            "DongUk Lim",
            "Jaeyeon Kim",
            "Tae-Ho Kim",
            "Bo-Kyeong Kim"
        ],
        "tldr": "The paper introduces ERGO, a two-stage vision-language model that uses reinforcement learning to selectively process high-resolution image regions, achieving higher accuracy and greater efficiency compared to existing LVLMs by using significantly fewer vision tokens.",
        "tldr_zh": "该论文介绍了ERGO，一种两阶段视觉语言模型，它使用强化学习来选择性地处理高分辨率图像区域，通过使用明显更少的视觉tokens，与现有的LVLM相比，实现了更高的准确性和更高的效率。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 9,
        "overall_priority_score": 9
    },
    {
        "title": "See, Point, Fly: A Learning-Free VLM Framework for Universal Unmanned Aerial Navigation",
        "summary": "We present See, Point, Fly (SPF), a training-free aerial vision-and-language\nnavigation (AVLN) framework built atop vision-language models (VLMs). SPF is\ncapable of navigating to any goal based on any type of free-form instructions\nin any kind of environment. In contrast to existing VLM-based approaches that\ntreat action prediction as a text generation task, our key insight is to\nconsider action prediction for AVLN as a 2D spatial grounding task. SPF\nharnesses VLMs to decompose vague language instructions into iterative\nannotation of 2D waypoints on the input image. Along with the predicted\ntraveling distance, SPF transforms predicted 2D waypoints into 3D displacement\nvectors as action commands for UAVs. Moreover, SPF also adaptively adjusts the\ntraveling distance to facilitate more efficient navigation. Notably, SPF\nperforms navigation in a closed-loop control manner, enabling UAVs to follow\ndynamic targets in dynamic environments. SPF sets a new state of the art in DRL\nsimulation benchmark, outperforming the previous best method by an absolute\nmargin of 63%. In extensive real-world evaluations, SPF outperforms strong\nbaselines by a large margin. We also conduct comprehensive ablation studies to\nhighlight the effectiveness of our design choice. Lastly, SPF shows remarkable\ngeneralization to different VLMs. Project page: https://spf-web.pages.dev",
        "url": "http://arxiv.org/abs/2509.22653v1",
        "published_date": "2025-09-26T17:59:59+00:00",
        "updated_date": "2025-09-26T17:59:59+00:00",
        "categories": [
            "cs.RO",
            "cs.AI",
            "cs.CL",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Chih Yao Hu",
            "Yang-Sen Lin",
            "Yuna Lee",
            "Chih-Hai Su",
            "Jie-Ying Lee",
            "Shr-Ruei Tsai",
            "Chin-Yang Lin",
            "Kuan-Wen Chen",
            "Tsung-Wei Ke",
            "Yu-Lun Liu"
        ],
        "tldr": "The paper introduces See, Point, Fly (SPF), a training-free VLM framework for UAV navigation that uses 2D spatial grounding for action prediction, achieving state-of-the-art performance in simulation and real-world settings.",
        "tldr_zh": "该论文介绍了一种名为See, Point, Fly (SPF)的无人机导航训练框架，该框架使用2D空间定位进行动作预测，并在模拟和现实环境中实现了最先进的性能。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "RefAM: Attention Magnets for Zero-Shot Referral Segmentation",
        "summary": "Most existing approaches to referring segmentation achieve strong performance\nonly through fine-tuning or by composing multiple pre-trained models, often at\nthe cost of additional training and architectural modifications. Meanwhile,\nlarge-scale generative diffusion models encode rich semantic information,\nmaking them attractive as general-purpose feature extractors. In this work, we\nintroduce a new method that directly exploits features, attention scores, from\ndiffusion transformers for downstream tasks, requiring neither architectural\nmodifications nor additional training. To systematically evaluate these\nfeatures, we extend benchmarks with vision-language grounding tasks spanning\nboth images and videos. Our key insight is that stop words act as attention\nmagnets: they accumulate surplus attention and can be filtered to reduce noise.\nMoreover, we identify global attention sinks (GAS) emerging in deeper layers\nand show that they can be safely suppressed or redirected onto auxiliary\ntokens, leading to sharper and more accurate grounding maps. We further propose\nan attention redistribution strategy, where appended stop words partition\nbackground activations into smaller clusters, yielding sharper and more\nlocalized heatmaps. Building on these findings, we develop RefAM, a simple\ntraining-free grounding framework that combines cross-attention maps, GAS\nhandling, and redistribution. Across zero-shot referring image and video\nsegmentation benchmarks, our approach consistently outperforms prior methods,\nestablishing a new state of the art without fine-tuning or additional\ncomponents.",
        "url": "http://arxiv.org/abs/2509.22650v1",
        "published_date": "2025-09-26T17:59:57+00:00",
        "updated_date": "2025-09-26T17:59:57+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Anna Kukleva",
            "Enis Simsar",
            "Alessio Tonioni",
            "Muhammad Ferjad Naeem",
            "Federico Tombari",
            "Jan Eric Lenssen",
            "Bernt Schiele"
        ],
        "tldr": "The paper introduces RefAM, a training-free approach for zero-shot referring image and video segmentation that leverages attention mechanisms within diffusion transformers, achieving state-of-the-art performance without fine-tuning.",
        "tldr_zh": "本文介绍了一种名为RefAM的免训练方法，用于零样本指代图像和视频分割。该方法利用扩散Transformer中的注意力机制，无需微调即可实现最先进的性能。",
        "relevance_score": 7,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "CapRL: Stimulating Dense Image Caption Capabilities via Reinforcement Learning",
        "summary": "Image captioning is a fundamental task that bridges the visual and linguistic\ndomains, playing a critical role in pre-training Large Vision-Language Models\n(LVLMs). Current state-of-the-art captioning models are typically trained with\nSupervised Fine-Tuning (SFT), a paradigm that relies on expensive, non-scalable\ndata annotated by humans or proprietary models. This approach often leads to\nmodels that memorize specific ground-truth answers, limiting their generality\nand ability to generate diverse, creative descriptions. To overcome the\nlimitation of SFT, we propose applying the Reinforcement Learning with\nVerifiable Rewards (RLVR) paradigm to the open-ended task of image captioning.\nA primary challenge, however, is designing an objective reward function for the\ninherently subjective nature of what constitutes a \"good\" caption. We introduce\nCaptioning Reinforcement Learning (CapRL), a novel training framework that\nredefines caption quality through its utility: a high-quality caption should\nenable a non-visual language model to accurately answer questions about the\ncorresponding image. CapRL employs a decoupled two-stage pipeline where an LVLM\ngenerates a caption, and the objective reward is derived from the accuracy of a\nseparate, vision-free LLM answering Multiple-Choice Questions based solely on\nthat caption. As the first study to apply RLVR to the subjective image\ncaptioning task, we demonstrate that CapRL significantly enhances multiple\nsettings. Pretraining on the CapRL-5M caption dataset annotated by CapRL-3B\nresults in substantial gains across 12 benchmarks. Moreover, within the Prism\nFramework for caption quality evaluation, CapRL achieves performance comparable\nto Qwen2.5-VL-72B, while exceeding the baseline by an average margin of 8.4%.\nCode is available here: https://github.com/InternLM/CapRL.",
        "url": "http://arxiv.org/abs/2509.22647v1",
        "published_date": "2025-09-26T17:59:55+00:00",
        "updated_date": "2025-09-26T17:59:55+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL"
        ],
        "authors": [
            "Long Xing",
            "Xiaoyi Dong",
            "Yuhang Zang",
            "Yuhang Cao",
            "Jianze Liang",
            "Qidong Huang",
            "Jiaqi Wang",
            "Feng Wu",
            "Dahua Lin"
        ],
        "tldr": "The paper introduces CapRL, a reinforcement learning framework for image captioning that utilizes a vision-free LLM to evaluate caption quality based on its ability to answer questions about the image, achieving strong performance across multiple benchmarks.",
        "tldr_zh": "该论文介绍了CapRL，一种用于图像描述的强化学习框架，它利用无视觉LLM根据回答图像相关问题的能力来评估描述质量，并在多个基准测试中取得了优异的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Hierarchical Representation Matching for CLIP-based Class-Incremental Learning",
        "summary": "Class-Incremental Learning (CIL) aims to endow models with the ability to\ncontinuously adapt to evolving data streams. Recent advances in pre-trained\nvision-language models (e.g., CLIP) provide a powerful foundation for this\ntask. However, existing approaches often rely on simplistic templates, such as\n\"a photo of a [CLASS]\", which overlook the hierarchical nature of visual\nconcepts. For example, recognizing \"cat\" versus \"car\" depends on coarse-grained\ncues, while distinguishing \"cat\" from \"lion\" requires fine-grained details.\nSimilarly, the current feature mapping in CLIP relies solely on the\nrepresentation from the last layer, neglecting the hierarchical information\ncontained in earlier layers. In this work, we introduce HiErarchical\nRepresentation MAtchiNg (HERMAN) for CLIP-based CIL. Our approach leverages\nLLMs to recursively generate discriminative textual descriptors, thereby\naugmenting the semantic space with explicit hierarchical cues. These\ndescriptors are matched to different levels of the semantic hierarchy and\nadaptively routed based on task-specific requirements, enabling precise\ndiscrimination while alleviating catastrophic forgetting in incremental tasks.\nExtensive experiments on multiple benchmarks demonstrate that our method\nconsistently achieves state-of-the-art performance.",
        "url": "http://arxiv.org/abs/2509.22645v1",
        "published_date": "2025-09-26T17:59:51+00:00",
        "updated_date": "2025-09-26T17:59:51+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Zhen-Hao Wen",
            "Yan Wang",
            "Ji Feng",
            "Han-Jia Ye",
            "De-Chuan Zhan",
            "Da-Wei Zhou"
        ],
        "tldr": "The paper introduces HERMAN, a method for CLIP-based class-incremental learning that uses LLMs to generate hierarchical textual descriptors and match them to different levels of the CLIP feature hierarchy, achieving state-of-the-art performance.",
        "tldr_zh": "该论文介绍了一种名为HERMAN的CLIP-based增量类学习方法，该方法利用LLMs生成分层文本描述符，并将它们与CLIP特征层次结构的不同级别进行匹配，从而实现了最先进的性能。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "SPARK: Synergistic Policy And Reward Co-Evolving Framework",
        "summary": "Recent Large Language Models (LLMs) and Large Vision-Language Models (LVLMs)\nincreasingly use Reinforcement Learning (RL) for post-pretraining, such as RL\nwith Verifiable Rewards (RLVR) for objective tasks and RL from Human Feedback\n(RLHF) for subjective tasks. However, RLHF incurs high costs and potential\nreward-policy mismatch due to reliance on human preferences, while RLVR still\nwastes supervision by discarding rollouts and correctness signals after each\nupdate. To address these challenges, we introduce the Synergistic Policy And\nReward Co-Evolving Framework (SPARK), an efficient, on-policy, and stable\nmethod that builds on RLVR. Instead of discarding rollouts and correctness\ndata, SPARK recycles this valuable information to simultaneously train the\nmodel itself as a generative reward model. This auxiliary training uses a mix\nof objectives, such as pointwise reward score, pairwise comparison, and\nevaluation conditioned on further-reflection responses, to teach the model to\nevaluate and improve its own responses. Our process eliminates the need for a\nseparate reward model and costly human preference data. SPARK creates a\npositive co-evolving feedback loop: improved reward accuracy yields better\npolicy gradients, which in turn produce higher-quality rollouts that further\nrefine the reward model. Our unified framework supports test-time scaling via\nself-reflection without external reward models and their associated costs. We\nshow that SPARK achieves significant performance gains on multiple LLM and LVLM\nmodels and multiple reasoning, reward models, and general benchmarks. For\nexample, SPARK-VL-7B achieves an average 9.7% gain on 7 reasoning benchmarks,\n12.1% on 2 reward benchmarks, and 1.5% on 8 general benchmarks over the\nbaselines, demonstrating robustness and broad generalization.",
        "url": "http://arxiv.org/abs/2509.22624v1",
        "published_date": "2025-09-26T17:50:12+00:00",
        "updated_date": "2025-09-26T17:50:12+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Ziyu Liu",
            "Yuhang Zang",
            "Shengyuan Ding",
            "Yuhang Cao",
            "Xiaoyi Dong",
            "Haodong Duan",
            "Dahua Lin",
            "Jiaqi Wang"
        ],
        "tldr": "The paper introduces SPARK, a synergistic policy and reward co-evolving framework for LLMs and LVLMs that improves performance by recycling rollouts to train a generative reward model, eliminating the need for human preference data and external reward models.",
        "tldr_zh": "该论文介绍了SPARK，一个用于LLM和LVLM的协同策略和奖励共同进化框架，通过循环利用rollouts来训练生成奖励模型，从而提高性能，无需人工偏好数据和外部奖励模型。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "JanusVLN: Decoupling Semantics and Spatiality with Dual Implicit Memory for Vision-Language Navigation",
        "summary": "Vision-and-Language Navigation requires an embodied agent to navigate through\nunseen environments, guided by natural language instructions and a continuous\nvideo stream. Recent advances in VLN have been driven by the powerful semantic\nunderstanding of Multimodal Large Language Models. However, these methods\ntypically rely on explicit semantic memory, such as building textual cognitive\nmaps or storing historical visual frames. This type of method suffers from\nspatial information loss, computational redundancy, and memory bloat, which\nimpede efficient navigation. Inspired by the implicit scene representation in\nhuman navigation, analogous to the left brain's semantic understanding and the\nright brain's spatial cognition, we propose JanusVLN, a novel VLN framework\nfeaturing a dual implicit neural memory that models spatial-geometric and\nvisual-semantic memory as separate, compact, and fixed-size neural\nrepresentations. This framework first extends the MLLM to incorporate 3D prior\nknowledge from the spatial-geometric encoder, thereby enhancing the spatial\nreasoning capabilities of models based solely on RGB input. Then, the\nhistorical key-value caches from the spatial-geometric and visual-semantic\nencoders are constructed into a dual implicit memory. By retaining only the KVs\nof tokens in the initial and sliding window, redundant computation is avoided,\nenabling efficient incremental updates. Extensive experiments demonstrate that\nJanusVLN outperforms over 20 recent methods to achieve SOTA performance. For\nexample, the success rate improves by 10.5-35.5 compared to methods using\nmultiple data types as input and by 3.6-10.8 compared to methods using more RGB\ntraining data. This indicates that the proposed dual implicit neural memory, as\na novel paradigm, explores promising new directions for future VLN research.\nOurs project page: https://miv-xjtu.github.io/JanusVLN.github.io/.",
        "url": "http://arxiv.org/abs/2509.22548v1",
        "published_date": "2025-09-26T16:29:37+00:00",
        "updated_date": "2025-09-26T16:29:37+00:00",
        "categories": [
            "cs.CV",
            "cs.RO"
        ],
        "authors": [
            "Shuang Zeng",
            "Dekang Qi",
            "Xinyuan Chang",
            "Feng Xiong",
            "Shichao Xie",
            "Xiaolong Wu",
            "Shiyi Liang",
            "Mu Xu",
            "Xing Wei"
        ],
        "tldr": "JanusVLN introduces a dual implicit neural memory framework for Vision-Language Navigation, enhancing spatial reasoning and efficiency by decoupling semantics and spatiality, achieving state-of-the-art performance.",
        "tldr_zh": "JanusVLN 引入了一种用于视觉-语言导航的双重隐式神经记忆框架，通过解耦语义和空间性来增强空间推理和效率，从而实现最先进的性能。",
        "relevance_score": 7,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Where MLLMs Attend and What They Rely On: Explaining Autoregressive Token Generation",
        "summary": "Multimodal large language models (MLLMs) have demonstrated remarkable\ncapabilities in aligning visual inputs with natural language outputs. Yet, the\nextent to which generated tokens depend on visual modalities remains poorly\nunderstood, limiting interpretability and reliability. In this work, we present\nEAGLE, a lightweight black-box framework for explaining autoregressive token\ngeneration in MLLMs. EAGLE attributes any selected tokens to compact perceptual\nregions while quantifying the relative influence of language priors and\nperceptual evidence. The framework introduces an objective function that\nunifies sufficiency (insight score) and indispensability (necessity score),\noptimized via greedy search over sparsified image regions for faithful and\nefficient attribution. Beyond spatial attribution, EAGLE performs\nmodality-aware analysis that disentangles what tokens rely on, providing\nfine-grained interpretability of model decisions. Extensive experiments across\nopen-source MLLMs show that EAGLE consistently outperforms existing methods in\nfaithfulness, localization, and hallucination diagnosis, while requiring\nsubstantially less GPU memory. These results highlight its effectiveness and\npracticality for advancing the interpretability of MLLMs. The code is available\nat https://github.com/RuoyuChen10/EAGLE.",
        "url": "http://arxiv.org/abs/2509.22496v1",
        "published_date": "2025-09-26T15:38:42+00:00",
        "updated_date": "2025-09-26T15:38:42+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Ruoyu Chen",
            "Xiaoqing Guo",
            "Kangwei Liu",
            "Siyuan Liang",
            "Shiming Liu",
            "Qunli Zhang",
            "Hua Zhang",
            "Xiaochun Cao"
        ],
        "tldr": "The paper introduces EAGLE, a framework for explaining autoregressive token generation in MLLMs by attributing tokens to visual regions and quantifying the influence of language priors. It outperforms existing methods in faithfulness, localization, and hallucination diagnosis.",
        "tldr_zh": "该论文介绍了一个名为EAGLE的框架，用于解释MLLM中自回归token的生成，通过将token归因于视觉区域并量化语言先验的影响。它在忠实性、定位和幻觉诊断方面优于现有方法。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "RAU: Reference-based Anatomical Understanding with Vision Language Models",
        "summary": "Anatomical understanding through deep learning is critical for automatic\nreport generation, intra-operative navigation, and organ localization in\nmedical imaging; however, its progress is constrained by the scarcity of\nexpert-labeled data. A promising remedy is to leverage an annotated reference\nimage to guide the interpretation of an unlabeled target. Although recent\nvision-language models (VLMs) exhibit non-trivial visual reasoning, their\nreference-based understanding and fine-grained localization remain limited. We\nintroduce RAU, a framework for reference-based anatomical understanding with\nVLMs. We first show that a VLM learns to identify anatomical regions through\nrelative spatial reasoning between reference and target images, trained on a\nmoderately sized dataset. We validate this capability through visual question\nanswering (VQA) and bounding box prediction. Next, we demonstrate that the\nVLM-derived spatial cues can be seamlessly integrated with the fine-grained\nsegmentation capability of SAM2, enabling localization and pixel-level\nsegmentation of small anatomical regions, such as vessel segments. Across two\nin-distribution and two out-of-distribution datasets, RAU consistently\noutperforms a SAM2 fine-tuning baseline using the same memory setup, yielding\nmore accurate segmentations and more reliable localization. More importantly,\nits strong generalization ability makes it scalable to out-of-distribution\ndatasets, a property crucial for medical image applications. To the best of our\nknowledge, RAU is the first to explore the capability of VLMs for\nreference-based identification, localization, and segmentation of anatomical\nstructures in medical images. Its promising performance highlights the\npotential of VLM-driven approaches for anatomical understanding in automated\nclinical workflows.",
        "url": "http://arxiv.org/abs/2509.22404v1",
        "published_date": "2025-09-26T14:32:03+00:00",
        "updated_date": "2025-09-26T14:32:03+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Yiwei Li",
            "Yikang Liu",
            "Jiaqi Guo",
            "Lin Zhao",
            "Zheyuan Zhang",
            "Xiao Chen",
            "Boris Mailhe",
            "Ankush Mukherjee",
            "Terrence Chen",
            "Shanhui Sun"
        ],
        "tldr": "The paper introduces RAU, a VLM-based framework for reference-based anatomical understanding in medical images, demonstrating improved segmentation and localization compared to SAM2 fine-tuning, with strong generalization capabilities.",
        "tldr_zh": "该论文介绍了RAU，一个基于VLM的框架，用于医学图像中基于参考的解剖学理解，与SAM2微调相比，展示了改进的分割和定位，并具有强大的泛化能力。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Beyond Classification Accuracy: Neural-MedBench and the Need for Deeper Reasoning Benchmarks",
        "summary": "Recent advances in vision-language models (VLMs) have achieved remarkable\nperformance on standard medical benchmarks, yet their true clinical reasoning\nability remains unclear. Existing datasets predominantly emphasize\nclassification accuracy, creating an evaluation illusion in which models appear\nproficient while still failing at high-stakes diagnostic reasoning. We\nintroduce Neural-MedBench, a compact yet reasoning-intensive benchmark\nspecifically designed to probe the limits of multimodal clinical reasoning in\nneurology. Neural-MedBench integrates multi-sequence MRI scans, structured\nelectronic health records, and clinical notes, and encompasses three core task\nfamilies: differential diagnosis, lesion recognition, and rationale generation.\nTo ensure reliable evaluation, we develop a hybrid scoring pipeline that\ncombines LLM-based graders, clinician validation, and semantic similarity\nmetrics. Through systematic evaluation of state-of-the-art VLMs, including\nGPT-4o, Claude-4, and MedGemma, we observe a sharp performance drop compared to\nconventional datasets. Error analysis shows that reasoning failures, rather\nthan perceptual errors, dominate model shortcomings. Our findings highlight the\nnecessity of a Two-Axis Evaluation Framework: breadth-oriented large datasets\nfor statistical generalization, and depth-oriented, compact benchmarks such as\nNeural-MedBench for reasoning fidelity. We release Neural-MedBench at\nhttps://neuromedbench.github.io/ as an open and extensible diagnostic testbed,\nwhich guides the expansion of future benchmarks and enables rigorous yet\ncost-effective assessment of clinically trustworthy AI.",
        "url": "http://arxiv.org/abs/2509.22258v1",
        "published_date": "2025-09-26T12:20:01+00:00",
        "updated_date": "2025-09-26T12:20:01+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Miao Jing",
            "Mengting Jia",
            "Junling Lin",
            "Zhongxia Shen",
            "Lijun Wang",
            "Yuanyuan Peng",
            "Huan Gao",
            "Mingkun Xu",
            "Shangyang Li"
        ],
        "tldr": "The paper introduces Neural-MedBench, a new benchmark for evaluating the clinical reasoning abilities of VLMs in neurology, highlighting the limitations of existing benchmarks focused on classification accuracy and the need for deeper reasoning assessments.",
        "tldr_zh": "该论文介绍了 Neural-MedBench，一个新的基准，用于评估视觉语言模型在神经学领域的临床推理能力。它强调了现有专注于分类准确性的基准的局限性，并突出了对更深入的推理评估的需求。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "UrbanFeel: A Comprehensive Benchmark for Temporal and Perceptual Understanding of City Scenes through Human Perspective",
        "summary": "Urban development impacts over half of the global population, making\nhuman-centered understanding of its structural and perceptual changes essential\nfor sustainable development. While Multimodal Large Language Models (MLLMs)\nhave shown remarkable capabilities across various domains, existing benchmarks\nthat explore their performance in urban environments remain limited, lacking\nsystematic exploration of temporal evolution and subjective perception of urban\nenvironment that aligns with human perception. To address these limitations, we\npropose UrbanFeel, a comprehensive benchmark designed to evaluate the\nperformance of MLLMs in urban development understanding and subjective\nenvironmental perception. UrbanFeel comprises 14.3K carefully constructed\nvisual questions spanning three cognitively progressive dimensions: Static\nScene Perception, Temporal Change Understanding, and Subjective Environmental\nPerception. We collect multi-temporal single-view and panoramic street-view\nimages from 11 representative cities worldwide, and generate high-quality\nquestion-answer pairs through a hybrid pipeline of spatial clustering,\nrule-based generation, model-assisted prompting, and manual annotation. Through\nextensive evaluation of 20 state-of-the-art MLLMs, we observe that Gemini-2.5\nPro achieves the best overall performance, with its accuracy approaching human\nexpert levels and narrowing the average gap to just 1.5\\%. Most models perform\nwell on tasks grounded in scene understanding. In particular, some models even\nsurpass human annotators in pixel-level change detection. However, performance\ndrops notably in tasks requiring temporal reasoning over urban development.\nAdditionally, in the subjective perception dimension, several models reach\nhuman-level or even higher consistency in evaluating dimension such as\nbeautiful and safety.",
        "url": "http://arxiv.org/abs/2509.22228v1",
        "published_date": "2025-09-26T11:38:57+00:00",
        "updated_date": "2025-09-26T11:38:57+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jun He",
            "Yi Lin",
            "Zilong Huang",
            "Jiacong Yin",
            "Junyan Ye",
            "Yuchuan Zhou",
            "Weijia Li",
            "Xiang Zhang"
        ],
        "tldr": "The paper introduces UrbanFeel, a new benchmark for evaluating MLLMs on temporal and perceptual understanding of urban environments from a human perspective, revealing limitations in temporal reasoning and human-like perception in current models.",
        "tldr_zh": "该论文介绍了UrbanFeel，一个新的基准，用于评估MLLM在人类视角下对城市环境的时间和感知理解能力，揭示了当前模型在时间推理和类人感知方面的局限性。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "Polysemous Language Gaussian Splatting via Matching-based Mask Lifting",
        "summary": "Lifting 2D open-vocabulary understanding into 3D Gaussian Splatting (3DGS)\nscenes is a critical challenge. However, mainstream methods suffer from three\nkey flaws: (i) their reliance on costly per-scene retraining prevents\nplug-and-play application; (ii) their restrictive monosemous design fails to\nrepresent complex, multi-concept semantics; and (iii) their vulnerability to\ncross-view semantic inconsistencies corrupts the final semantic representation.\nTo overcome these limitations, we introduce MUSplat, a training-free framework\nthat abandons feature optimization entirely. Leveraging a pre-trained 2D\nsegmentation model, our pipeline generates and lifts multi-granularity 2D masks\ninto 3D, where we estimate a foreground probability for each Gaussian point to\nform initial object groups. We then optimize the ambiguous boundaries of these\ninitial groups using semantic entropy and geometric opacity. Subsequently, by\ninterpreting the object's appearance across its most representative viewpoints,\na Vision-Language Model (VLM) distills robust textual features that reconciles\nvisual inconsistencies, enabling open-vocabulary querying via semantic\nmatching. By eliminating the costly per-scene training process, MUSplat reduces\nscene adaptation time from hours to mere minutes. On benchmark tasks for\nopen-vocabulary 3D object selection and semantic segmentation, MUSplat\noutperforms established training-based frameworks while simultaneously\naddressing their monosemous limitations.",
        "url": "http://arxiv.org/abs/2509.22225v1",
        "published_date": "2025-09-26T11:38:05+00:00",
        "updated_date": "2025-09-26T11:38:05+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Jiayu Ding",
            "Xinpeng Liu",
            "Zhiyi Pan",
            "Shiqiang Long",
            "Ge Li"
        ],
        "tldr": "The paper introduces MUSplat, a training-free framework that lifts 2D open-vocabulary understanding into 3D Gaussian Splatting scenes, overcoming limitations of existing methods by using matching-based mask lifting and VLM distillation.",
        "tldr_zh": "该论文介绍了MUSplat，一个无需训练的框架，它将2D开放词汇理解提升到3D高斯溅射场景中，通过使用基于匹配的掩码提升和VLM蒸馏，克服了现有方法的局限性。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Towards Faithful Reasoning in Remote Sensing: A Perceptually-Grounded GeoSpatial Chain-of-Thought for Vision-Language Models",
        "summary": "Vision-Language Models (VLMs) in remote sensing often fail at complex\nanalytical tasks, a limitation stemming from their end-to-end training paradigm\nthat bypasses crucial reasoning steps and leads to unverifiable outputs. To\naddress this limitation, we introduce the Perceptually-Grounded Geospatial\nChain-of-Thought (Geo-CoT), a framework that models remote sensing analysis as\na verifiable, multi-step process. We instill this analytical process through a\ntwo-stage alignment strategy, leveraging Geo-CoT380k, the first large-scale\ndataset of structured Geo-CoT rationales. This strategy first employs\nsupervised fine-tuning (SFT) to instill the foundational cognitive\narchitecture, then leverages Group Reward Policy Optimization (GRPO) to refine\nthe model's reasoning policy towards factual correctness. The resulting model,\nRSThinker, outputs both a final answer and its justifying, verifiable\nanalytical trace. This capability yields dominant performance, significantly\noutperforming state-of-the-art models across a comprehensive range of tasks.\nThe public release of our Geo-CoT380k dataset and RSThinker model upon\npublication serves as a concrete pathway from opaque perception towards\nstructured, verifiable reasoning for Earth Observation.",
        "url": "http://arxiv.org/abs/2509.22221v1",
        "published_date": "2025-09-26T11:34:42+00:00",
        "updated_date": "2025-09-26T11:34:42+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jiaqi Liu",
            "Lang Sun",
            "Ronghao Fu",
            "Bo Yang"
        ],
        "tldr": "The paper introduces Geo-CoT, a framework and dataset (Geo-CoT380k) to enhance reasoning in remote sensing VLMs by modeling analysis as a verifiable multi-step process, resulting in improved performance.",
        "tldr_zh": "该论文介绍了Geo-CoT，一个框架和数据集(Geo-CoT380k)，通过将分析建模为可验证的多步骤过程来增强遥感VLM中的推理能力，从而提高性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "MinerU2.5: A Decoupled Vision-Language Model for Efficient High-Resolution Document Parsing",
        "summary": "We introduce MinerU2.5, a 1.2B-parameter document parsing vision-language\nmodel that achieves state-of-the-art recognition accuracy while maintaining\nexceptional computational efficiency. Our approach employs a coarse-to-fine,\ntwo-stage parsing strategy that decouples global layout analysis from local\ncontent recognition. In the first stage, the model performs efficient layout\nanalysis on downsampled images to identify structural elements, circumventing\nthe computational overhead of processing high-resolution inputs. In the second\nstage, guided by the global layout, it performs targeted content recognition on\nnative-resolution crops extracted from the original image, preserving\nfine-grained details in dense text, complex formulas, and tables. To support\nthis strategy, we developed a comprehensive data engine that generates diverse,\nlarge-scale training corpora for both pretraining and fine-tuning. Ultimately,\nMinerU2.5 demonstrates strong document parsing ability, achieving\nstate-of-the-art performance on multiple benchmarks, surpassing both\ngeneral-purpose and domain-specific models across various recognition tasks,\nwhile maintaining significantly lower computational overhead.",
        "url": "http://arxiv.org/abs/2509.22186v1",
        "published_date": "2025-09-26T10:45:48+00:00",
        "updated_date": "2025-09-26T10:45:48+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Junbo Niu",
            "Zheng Liu",
            "Zhuangcheng Gu",
            "Bin Wang",
            "Linke Ouyang",
            "Zhiyuan Zhao",
            "Tao Chu",
            "Tianyao He",
            "Fan Wu",
            "Qintong Zhang",
            "Zhenjiang Jin",
            "Guang Liang",
            "Rui Zhang",
            "Wenzheng Zhang",
            "Yuan Qu",
            "Zhifei Ren",
            "Yuefeng Sun",
            "Yuanhong Zheng",
            "Dongsheng Ma",
            "Zirui Tang",
            "Boyu Niu",
            "Ziyang Miao",
            "Hejun Dong",
            "Siyi Qian",
            "Junyuan Zhang",
            "Jingzhou Chen",
            "Fangdong Wang",
            "Xiaomeng Zhao",
            "Liqun Wei",
            "Wei Li",
            "Shasha Wang",
            "Ruiliang Xu",
            "Yuanyuan Cao",
            "Lu Chen",
            "Qianqian Wu",
            "Huaiyu Gu",
            "Lindong Lu",
            "Keming Wang",
            "Dechen Lin",
            "Guanlin Shen",
            "Xuanhe Zhou",
            "Linfeng Zhang",
            "Yuhang Zang",
            "Xiaoyi Dong",
            "Jiaqi Wang",
            "Bo Zhang",
            "Lei Bai",
            "Pei Chu",
            "Weijia Li",
            "Jiang Wu",
            "Lijun Wu",
            "Zhenxiang Li",
            "Guangyu Wang",
            "Zhongying Tu",
            "Chao Xu",
            "Kai Chen",
            "Yu Qiao",
            "Bowen Zhou",
            "Dahua Lin",
            "Wentao Zhang",
            "Conghui He"
        ],
        "tldr": "MinerU2.5 is a 1.2B-parameter vision-language model for document parsing that achieves state-of-the-art accuracy with high computational efficiency using a coarse-to-fine, two-stage approach.",
        "tldr_zh": "MinerU2.5是一个1.2B参数的视觉语言模型，用于文档解析，通过粗到精的两阶段方法，在实现卓越的计算效率的同时，达到最先进的准确率。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Lightweight Structured Multimodal Reasoning for Clinical Scene Understanding in Robotics",
        "summary": "Healthcare robotics requires robust multimodal perception and reasoning to\nensure safety in dynamic clinical environments. Current Vision-Language Models\n(VLMs) demonstrate strong general-purpose capabilities but remain limited in\ntemporal reasoning, uncertainty estimation, and structured outputs needed for\nrobotic planning. We present a lightweight agentic multimodal framework for\nvideo-based scene understanding. Combining the Qwen2.5-VL-3B-Instruct model\nwith a SmolAgent-based orchestration layer, it supports chain-of-thought\nreasoning, speech-vision fusion, and dynamic tool invocation. The framework\ngenerates structured scene graphs and leverages a hybrid retrieval module for\ninterpretable and adaptive reasoning. Evaluations on the Video-MME benchmark\nand a custom clinical dataset show competitive accuracy and improved robustness\ncompared to state-of-the-art VLMs, demonstrating its potential for applications\nin robot-assisted surgery, patient monitoring, and decision support.",
        "url": "http://arxiv.org/abs/2509.22014v1",
        "published_date": "2025-09-26T07:49:49+00:00",
        "updated_date": "2025-09-26T07:49:49+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.HC",
            "cs.RO"
        ],
        "authors": [
            "Saurav Jha",
            "Stefan K. Ehrlich"
        ],
        "tldr": "The paper introduces a lightweight multimodal framework combining a smaller VLM (Qwen2.5-VL-3B) with an agent-based orchestration layer for improved scene understanding in healthcare robotics, demonstrating enhanced robustness and accuracy on clinical datasets.",
        "tldr_zh": "本文介绍了一个轻量级多模态框架，将较小的VLM (Qwen2.5-VL-3B)与基于代理的编排层相结合，以改进医疗机器人中的场景理解，并在临床数据集上展示了增强的鲁棒性和准确性。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "CoFFT: Chain of Foresight-Focus Thought for Visual Language Models",
        "summary": "Despite significant advances in Vision Language Models (VLMs), they remain\nconstrained by the complexity and redundancy of visual input. When images\ncontain large amounts of irrelevant information, VLMs are susceptible to\ninterference, thus generating excessive task-irrelevant reasoning processes or\neven hallucinations. This limitation stems from their inability to discover and\nprocess the required regions during reasoning precisely. To address this\nlimitation, we present the Chain of Foresight-Focus Thought (CoFFT), a novel\ntraining-free approach that enhances VLMs' visual reasoning by emulating human\nvisual cognition. Each Foresight-Focus Thought consists of three stages: (1)\nDiverse Sample Generation: generates diverse reasoning samples to explore\npotential reasoning paths, where each sample contains several reasoning steps;\n(2) Dual Foresight Decoding: rigorously evaluates these samples based on both\nvisual focus and reasoning progression, adding the first step of optimal sample\nto the reasoning process; (3) Visual Focus Adjustment: precisely adjust visual\nfocus toward regions most beneficial for future reasoning, before returning to\nstage (1) to generate subsequent reasoning samples until reaching the final\nanswer. These stages function iteratively, creating an interdependent cycle\nwhere reasoning guides visual focus and visual focus informs subsequent\nreasoning. Empirical results across multiple benchmarks using Qwen2.5-VL,\nInternVL-2.5, and Llava-Next demonstrate consistent performance improvements of\n3.1-5.8\\% with controllable increasing computational overhead.",
        "url": "http://arxiv.org/abs/2509.22010v1",
        "published_date": "2025-09-26T07:46:30+00:00",
        "updated_date": "2025-09-26T07:46:30+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Xinyu Zhang",
            "Yuxuan Dong",
            "Lingling Zhang",
            "Chengyou Jia",
            "Zhuohang Dang",
            "Basura Fernando",
            "Jun Liu",
            "Mike Zheng Shou"
        ],
        "tldr": "The paper introduces CoFFT, a training-free approach to improve VLM reasoning by iteratively generating reasoning samples, evaluating them based on visual focus and reasoning progression, and adjusting visual focus, leading to performance improvements on multiple benchmarks.",
        "tldr_zh": "该论文介绍了一种名为CoFFT的免训练方法，通过迭代生成推理样本，根据视觉焦点和推理进度评估这些样本，并调整视觉焦点来改进视觉语言模型的推理能力，从而在多个基准测试中实现了性能提升。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "Exposing Hallucinations To Suppress Them: VLMs Representation Editing With Generative Anchors",
        "summary": "Multimodal large language models (MLLMs) have achieved remarkable success\nacross diverse vision-language tasks, yet they remain highly susceptible to\nhallucinations, producing content that is fluent but inconsistent with visual\nevidence. Such hallucinations, spanning objects, attributes, and relations,\npersist even in larger models, while existing mitigation approaches often\nrequire additional finetuning, handcrafted priors, or trade-offs that\ncompromise informativeness and scalability. To address this limitation, we\npropose a training-free, self-supervised method for hallucination mitigation.\nOur approach introduces a novel hallucination amplification mechanism: a\ncaption is projected into the visual space via a text-to-image model to reveal\nimplicit hallucination signals, serving as a negative anchor, while the\noriginal image provides a positive anchor. Leveraging these dual anchors, we\nedit decoder hidden states by pulling representations toward faithful semantics\nand pushing them away from hallucination directions. This correction requires\nno human priors or additional training costs, ensuring both effectiveness and\nefficiency. Extensive experiments across multiple benchmarks show that our\nmethod significantly reduces hallucinations at the object, attribute, and\nrelation levels while largely preserving recall and caption richness, e.g.,\nachieving a hallucination reduction by over 5% using LLaVA-v1.5-7B on CHAIR.\nFurthermore, results on diverse architectures, including LLaVA-NEXT-7B,\nCambrian-8B, and InstructBLIP-7B, validate strong cross-architecture\ngeneralization. More importantly, when applied to hallucination-free captions,\nour method introduces almost no side effects, underscoring its robustness and\npractical plug-and-play applicability. The implementation will be publicly\navailable.",
        "url": "http://arxiv.org/abs/2509.21997v1",
        "published_date": "2025-09-26T07:24:28+00:00",
        "updated_date": "2025-09-26T07:24:28+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Youxu Shi",
            "Suorong Yang",
            "Dong Liu"
        ],
        "tldr": "This paper proposes a training-free, self-supervised method using generative anchors to mitigate hallucinations in VLMs by editing decoder hidden states, showing strong performance and generalization across various architectures.",
        "tldr_zh": "本文提出了一种无需训练的自监督方法，利用生成锚点通过编辑解码器隐藏状态来减轻视觉语言模型中的幻觉，并在各种架构上表现出强大的性能和泛化能力。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "WAVE: Learning Unified & Versatile Audio-Visual Embeddings with Multimodal LLM",
        "summary": "While embeddings from multimodal large language models (LLMs) excel as\ngeneral-purpose representations, their application to dynamic modalities like\naudio and video remains underexplored. We introduce WAVE (\\textbf{u}nified \\&\n\\textbf{v}ersatile \\textbf{a}udio-\\textbf{v}isual \\textbf{e}mbeddings), the\nfirst LLM-based embedding that creates a unified representation space for text,\naudio, and video modalities. WAVE employs a novel hierarchical feature fusion\nstrategy and a joint multi-modal, multi-task training approach to enable two\nkey capabilities: any-to-any cross-modal retrieval and the generation of\nprompt-aware embeddings tailored to user instructions. Experimentally, WAVE\nsets a new state-of-the-art on the MMEB-v2 video benchmark and achieves\nsuperior results in audio and video-to-audio retrieval. Its prompt-aware nature\nalso yields remarkable performance in multimodal question answering,\nsignificantly outperforming existing embedding models. Ablation studies\nvalidate our joint training strategy, demonstrating improved performance across\nall modalities. With a newly introduced benchmark for versatile audio-visual\nlearning, WAVE opens up broad possibilities for cross-modal, any-to-any\napplications. Our code, checkpoints, and data will be released.",
        "url": "http://arxiv.org/abs/2509.21990v1",
        "published_date": "2025-09-26T07:13:37+00:00",
        "updated_date": "2025-09-26T07:13:37+00:00",
        "categories": [
            "cs.CV",
            "cs.SD"
        ],
        "authors": [
            "Changli Tang",
            "Qinfan Xiao",
            "Ke Mei",
            "Tianyi Wang",
            "Fengyun Rao",
            "Chao Zhang"
        ],
        "tldr": "The paper introduces WAVE, a novel LLM-based embedding model for unified text, audio, and video representations, achieving state-of-the-art results on various cross-modal tasks.",
        "tldr_zh": "该论文介绍了WAVE，一种新型的基于LLM的嵌入模型，用于统一的文本、音频和视频表示，并在各种跨模态任务中取得了最先进的结果。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "From Bias to Balance: Exploring and Mitigating Spatial Bias in LVLMs",
        "summary": "Large Vision-Language Models (LVLMs) have achieved remarkable success across\na wide range of multimodal tasks, yet their robustness to spatial variations\nremains insufficiently understood. In this work, we present a systematic study\nof the spatial bias of LVLMs, focusing on how models respond when identical key\nvisual information is placed at different locations within an image. Through a\ncarefully designed probing dataset, we demonstrate that current LVLMs often\nproduce inconsistent outputs under such spatial shifts, revealing a fundamental\nlimitation in their spatial-semantic understanding. Further analysis shows that\nthis phenomenon originates not from the vision encoder, which reliably\nperceives and interprets visual content across positions, but from the\nunbalanced design of position embeddings in the language model component. In\nparticular, the widely adopted position embedding strategies, such as RoPE,\nintroduce imbalance during cross-modal interaction, leading image tokens at\ndifferent positions to exert unequal influence on semantic understanding. To\nmitigate this issue, we introduce Balanced Position Assignment (BaPA), a simple\nyet effective mechanism that assigns identical position embeddings to all image\ntokens, promoting a more balanced integration of visual information. Extensive\nexperiments show that BaPA enhances the spatial robustness of LVLMs without\nretraining and further boosts their performance across diverse multimodal\nbenchmarks when combined with lightweight fine-tuning. Further analysis of\ninformation flow reveals that BaPA yields balanced attention, enabling more\nholistic visual understanding.",
        "url": "http://arxiv.org/abs/2509.21984v1",
        "published_date": "2025-09-26T07:07:03+00:00",
        "updated_date": "2025-09-26T07:07:03+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Yingjie Zhu",
            "Xuefeng Bai",
            "Kehai Chen",
            "Yang Xiang",
            "Weili Guan",
            "Jun Yu",
            "Min Zhang"
        ],
        "tldr": "This paper identifies and mitigates spatial bias in LVLMs, showing that the models are sensitive to the location of visual information due to unbalanced position embeddings in the language model component. They propose BaPA, a method to improve spatial robustness without retraining.",
        "tldr_zh": "本文发现并缓解了LVLM中的空间偏差，表明由于语言模型组件中不平衡的位置嵌入，模型对视觉信息的位置敏感。 他们提出了BaPA，一种无需重新训练即可提高空间鲁棒性的方法。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Resolving Ambiguity in Gaze-Facilitated Visual Assistant Interaction Paradigm",
        "summary": "With the rise in popularity of smart glasses, users' attention has been\nintegrated into Vision-Language Models (VLMs) to streamline multi-modal\nquerying in daily scenarios. However, leveraging gaze data to model users'\nattention may introduce ambiguity challenges: (1) users' verbal questions\nbecome ambiguous by using pronouns or skipping context, (2) humans' gaze\npatterns can be noisy and exhibit complex spatiotemporal relationships with\ntheir spoken questions. Previous works only consider single image as visual\nmodality input, failing to capture the dynamic nature of the user's attention.\nIn this work, we introduce GLARIFY, a novel method to leverage spatiotemporal\ngaze information to enhance the model's effectiveness in real-world\napplications. Initially, we analyzed hundreds of querying samples with the gaze\nmodality to demonstrate the noisy nature of users' gaze patterns. We then\nutilized GPT-4o to design an automatic data synthesis pipeline to generate the\nGLARIFY-Ambi dataset, which includes a dedicated chain-of-thought (CoT) process\nto handle noisy gaze patterns. Finally, we designed a heatmap module to\nincorporate gaze information into cutting-edge VLMs while preserving their\npretrained knowledge. We evaluated GLARIFY using a hold-out test set.\nExperiments demonstrate that GLARIFY significantly outperforms baselines. By\nrobustly aligning VLMs with human attention, GLARIFY paves the way for a usable\nand intuitive interaction paradigm with a visual assistant.",
        "url": "http://arxiv.org/abs/2509.21980v1",
        "published_date": "2025-09-26T07:02:40+00:00",
        "updated_date": "2025-09-26T07:02:40+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zeyu Wang",
            "Baiyu Chen",
            "Kun Yan",
            "Hongjing Piao",
            "Hao Xue",
            "Flora D. Salim",
            "Yuanchun Shi",
            "Yuntao Wang"
        ],
        "tldr": "The paper introduces GLARIFY, a novel method using spatiotemporal gaze information to resolve ambiguity in gaze-facilitated visual assistant interactions, along with a synthetic dataset (GLARIFY-Ambi) generated using GPT-4o.",
        "tldr_zh": "本文介绍了GLARIFY，一种利用时空注视信息解决注视辅助视觉助手交互中歧义的新方法，以及一个使用GPT-4o生成的合成数据集（GLARIFY-Ambi）。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "Benchmarking and Mitigate Psychological Sycophancy in Medical Vision-Language Models",
        "summary": "Vision language models(VLMs) are increasingly integrated into clinical\nworkflows, but they often exhibit sycophantic behavior prioritizing alignment\nwith user phrasing social cues or perceived authority over evidence based\nreasoning. This study evaluate clinical sycophancy in medical visual question\nanswering through a novel clinically grounded benchmark. We propose a medical\nsycophancy dataset construct from PathVQA, SLAKE, and VQA-RAD stratified by\ndifferent type organ system and modality. Using psychologically motivated\npressure templates including various sycophancy. In our adversarial experiments\non various VLMs, we found that these models are generally vulnerable,\nexhibiting significant variations in the occurrence of adversarial responses,\nwith weak correlations to the model accuracy or size. Imitation and expert\nprovided corrections were found to be the most effective triggers, suggesting\nthat the models possess a bias mechanism independent of visual evidence. To\naddress this, we propose Visual Information Purification for Evidence based\nResponse (VIPER) a lightweight mitigation strategy that filters non evidentiary\ncontent for example social pressures and then generates constrained evidence\nfirst answers. This framework reduces sycophancy by an average amount\noutperforming baselines while maintaining interpretability. Our benchmark\nanalysis and mitigation framework lay the groundwork for robust deployment of\nmedical VLMs in real world clinician interactions emphasizing the need for\nevidence anchored defenses.",
        "url": "http://arxiv.org/abs/2509.21979v1",
        "published_date": "2025-09-26T07:02:22+00:00",
        "updated_date": "2025-09-26T07:02:22+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Zikun Guo",
            "Xinyue Xu",
            "Pei Xiang",
            "Shu Yang",
            "Xin Han",
            "Di Wang",
            "Lijie Hu"
        ],
        "tldr": "This paper introduces a new benchmark for evaluating sycophancy in medical VLMs, demonstrates the vulnerability of existing models, and proposes a mitigation strategy called VIPER which filters non-evidentiary content to improve evidence-based reasoning.",
        "tldr_zh": "本文介绍了一个新的基准，用于评估医学视觉语言模型中的奉承行为，证明了现有模型的脆弱性，并提出了一种名为 VIPER 的缓解策略，该策略过滤非证据内容以改善基于证据的推理。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Customizing Visual Emotion Evaluation for MLLMs: An Open-vocabulary, Multifaceted, and Scalable Approach",
        "summary": "Recently, Multimodal Large Language Models (MLLMs) have achieved exceptional\nperformance across diverse tasks, continually surpassing previous expectations\nregarding their capabilities. Nevertheless, their proficiency in perceiving\nemotions from images remains debated, with studies yielding divergent results\nin zero-shot scenarios. We argue that this inconsistency stems partly from\nconstraints in existing evaluation methods, including the oversight of\nplausible responses, limited emotional taxonomies, neglect of contextual\nfactors, and labor-intensive annotations. To facilitate customized visual\nemotion evaluation for MLLMs, we propose an Emotion Statement Judgment task\nthat overcomes these constraints. Complementing this task, we devise an\nautomated pipeline that efficiently constructs emotion-centric statements with\nminimal human effort. Through systematically evaluating prevailing MLLMs, our\nstudy showcases their stronger performance in emotion interpretation and\ncontext-based emotion judgment, while revealing relative limitations in\ncomprehending perception subjectivity. When compared to humans, even\ntop-performing MLLMs like GPT4o demonstrate remarkable performance gaps,\nunderscoring key areas for future improvement. By developing a fundamental\nevaluation framework and conducting a comprehensive MLLM assessment, we hope\nthis work contributes to advancing emotional intelligence in MLLMs. Project\npage: https://github.com/wdqqdw/MVEI.",
        "url": "http://arxiv.org/abs/2509.21950v1",
        "published_date": "2025-09-26T06:30:39+00:00",
        "updated_date": "2025-09-26T06:30:39+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Daiqing Wu",
            "Dongbao Yang",
            "Sicheng Zhao",
            "Can Ma",
            "Yu Zhou"
        ],
        "tldr": "The paper introduces a novel evaluation framework for assessing visual emotion understanding in MLLMs, addressing limitations in existing methods and revealing performance gaps compared to humans.",
        "tldr_zh": "该论文介绍了一种新颖的评估框架，用于评估MLLM中的视觉情感理解，解决了现有方法的局限性，并揭示了与人类相比的性能差距。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "PANICL: Mitigating Over-Reliance on Single Prompt in Visual In-Context Learning",
        "summary": "Visual In-Context Learning (VICL) uses input-output image pairs, referred to\nas in-context pairs (or examples), as prompts alongside query images to guide\nmodels in performing diverse vision tasks. However, VICL often suffers from\nover-reliance on a single in-context pair, which can lead to biased and\nunstable predictions. We introduce PAtch-based $k$-Nearest neighbor visual\nIn-Context Learning (PANICL), a general training-free framework that mitigates\nthis issue by leveraging multiple in-context pairs. PANICL smooths assignment\nscores across pairs, reducing bias without requiring additional training.\nExtensive experiments on a variety of tasks, including foreground segmentation,\nsingle object detection, colorization, multi-object segmentation, and keypoint\ndetection, demonstrate consistent improvements over strong baselines. Moreover,\nPANICL exhibits strong robustness to domain shifts, including dataset-level\nshift (e.g., from COCO to Pascal) and label-space shift (e.g., FSS-1000), and\ngeneralizes well to other VICL models such as SegGPT, Painter, and LVM,\nhighlighting its versatility and broad applicability.",
        "url": "http://arxiv.org/abs/2509.21926v1",
        "published_date": "2025-09-26T06:13:40+00:00",
        "updated_date": "2025-09-26T06:13:40+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jiahao Zhang",
            "Bowen Wang",
            "Hong Liu",
            "Yuta Nakashima",
            "Hajime Nagahara"
        ],
        "tldr": "The paper introduces PANICL, a training-free framework that improves visual in-context learning by reducing over-reliance on single in-context pairs, leading to more robust and accurate predictions across various vision tasks and domain shifts.",
        "tldr_zh": "该论文介绍了PANICL，一种无需训练的框架，通过减少对单个上下文对的过度依赖，从而改进视觉上下文学习，从而在各种视觉任务和领域转换中实现更强大和准确的预测。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Perception-Consistency Multimodal Large Language Models Reasoning via Caption-Regularized Policy Optimization",
        "summary": "While multimodal large language models excel at tasks that integrate visual\nperception with symbolic reasoning, their performance is often undermined by a\ncritical vulnerability: perception-induced errors that propagate through the\nreasoning chain. Current reinforcement learning (RL) fine-tuning methods, while\nenhancing reasoning abilities, largely fail to address the underlying\nmisalignment between visual grounding and the subsequent reasoning process. To\naddress this challenge, we propose \\textbf{Caption-Regularized Policy\nOptimization (CapPO)}, a novel RL framework that explicitly enforces perceptual\nconsistency during policy optimization. CapPO integrates two key mechanisms:\n(1) a caption-based consistency regularization, which minimizes the divergence\nbetween responses conditioned on raw images and those conditioned on captions,\nthereby anchoring reasoning to semantically faithful visual content; and (2) a\nKL-weighted advantage estimation scheme, which adaptively scales reinforcement\nsignals to strengthen perceptually consistent trajectories while suppressing\nspurious correlations. Extensive experiments on five math-focused and five\ngeneral reasoning benchmarks demonstrate that CapPO achieves competitive\nperformance, yielding gains of +6.0% accuracy on math-related tasks and +2.4%\non general reasoning tasks over the base Qwen2.5-VL-7B model. Moreover,\nablation studies further confirm the effectiveness of each component, while\nerror analysis reveals that CapPO significantly reduces perception-related\nmistakes compared with baselines. Overall, CapPO provides a simple yet\neffective framework for improving multimodal reasoning.",
        "url": "http://arxiv.org/abs/2509.21854v1",
        "published_date": "2025-09-26T04:32:26+00:00",
        "updated_date": "2025-09-26T04:32:26+00:00",
        "categories": [
            "cs.MM",
            "cs.CV",
            "68T07, 68T45",
            "I.2.6; I.2.7; I.2.10"
        ],
        "authors": [
            "Songjun Tu",
            "Qichao Zhang",
            "Jingbo Sun",
            "Yuqian Fu",
            "Linjing Li",
            "Xiangyuan Lan",
            "Dongmei Jiang",
            "Yaowei Wang",
            "Dongbin Zhao"
        ],
        "tldr": "The paper introduces Caption-Regularized Policy Optimization (CapPO), a reinforcement learning framework designed to enhance the perceptual consistency of multimodal large language models, improving their reasoning accuracy in math and general tasks by mitigating perception-induced errors.",
        "tldr_zh": "该论文介绍了一种名为Caption-Regularized Policy Optimization (CapPO) 的强化学习框架，旨在提高多模态大型语言模型的感知一致性，通过减轻感知引起的错误，提高其在数学和通用任务中的推理准确性。",
        "relevance_score": 8,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "Visual Multi-Agent System: Mitigating Hallucination Snowballing via Visual Flow",
        "summary": "Multi-Agent System (MAS) powered by Visual Language Models (VLMs) enables\nchallenging tasks but suffers from a novel failure term, multi-agent visual\nhallucination snowballing, where hallucinations are seeded in a single agent\nand amplified by following ones due to the over-reliance on textual flow to\nrelay visual information. Through turn-, layer-, and token-wise attention\nanalyses, we provide detailed insights into the essence of hallucination\nsnowballing regarding the reduction of visual attention allocation. It leads us\nto identify a subset of vision tokens with a unimodal attention peak in middle\nlayers that best preserve visual evidence but gradually diminish in deeper\nagent turns, resulting in the visual hallucination snowballing in MAS. Thus, we\npropose ViF, a lightweight, plug-and-play mitigation paradigm that relays\ninter-agent messages with Visual Flow powered by the selected visual relay\ntokens and applies attention reallocation to amplify this pattern. The\nexperiment results demonstrate that our method markedly reduces hallucination\nsnowballing, consistently improving the performance across eight benchmarks\nbased on four common MAS structures and ten base models. The source code will\nbe available at: https://github.com/YU-deep/ViF.git.",
        "url": "http://arxiv.org/abs/2509.21789v1",
        "published_date": "2025-09-26T02:43:24+00:00",
        "updated_date": "2025-09-26T02:43:24+00:00",
        "categories": [
            "cs.MA",
            "cs.CV"
        ],
        "authors": [
            "Xinlei Yu",
            "Chengming Xu",
            "Guibin Zhang",
            "Yongbo He",
            "Zhangquan Chen",
            "Zhucun Xue",
            "Jiangning Zhang",
            "Yue Liao",
            "Xiaobin Hu",
            "Yu-Gang Jiang",
            "Shuicheng Yan"
        ],
        "tldr": "This paper identifies and mitigates a novel failure mode in Visual Multi-Agent Systems (MAS) called \"hallucination snowballing,\" where visual hallucinations are amplified across agents due to over-reliance on textual communication. They propose ViF, a method using visual flow to reduce this problem.",
        "tldr_zh": "该论文识别并缓解了视觉多智能体系统（MAS）中的一种新型故障模式，称为“幻觉滚雪球”，即由于过度依赖文本通信，视觉幻觉在智能体之间被放大。他们提出了ViF，一种使用视觉流来减少这个问题的方法。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "MIRG-RL: Multi-Image Reasoning and Grounding with Reinforcement Learning",
        "summary": "Multi-image reasoning and grounding require understanding complex cross-image\nrelationships at both object levels and image levels. Current Large Visual\nLanguage Models (LVLMs) face two critical challenges: the lack of cross-image\nreasoning capabilities and insufficient cross-image reference reward modeling.\nTo address these issues, we propose a unified framework - Multi-Image Reasoning\nand Grounding with Reinforcement Learning (MIRG-RL). Specifically, our\ntwo-stage training paradigm combines supervised fine-tuning with annotated\ntrajectories and image-aware reinforcement learning optimization, progressively\ndeveloping multi-image reasoning capabilities. Furthermore, we innovatively\npropose a method for constructing the trajectory data, which integrates\nobject-level and image-level annotation information, and use this method to\ngenerate a lightweight reasoning-enhanced dataset. To effectively resolve\ncross-image ambiguities, we design an image-aware RL policy with dual reward\nfunctions for objects and images. Experiments demonstrate that MIRG-RL achieves\nstate-of-the-art (SOTA) performance in multi-image grounding benchmarks,\nattaining 64.82% on cross-image reasoning tasks - exceeding the previous best\nmethod by 1%. The code and dataset have been released at\nhttps://github.com/ZEUS2035/MIRG-RL.",
        "url": "http://arxiv.org/abs/2509.21788v1",
        "published_date": "2025-09-26T02:43:22+00:00",
        "updated_date": "2025-09-26T02:43:22+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Lihao Zheng",
            "Jiawei Chen",
            "Xintian Shen",
            "Hao Ma",
            "Tao Wei"
        ],
        "tldr": "The paper introduces MIRG-RL, a reinforcement learning-based framework for multi-image reasoning and grounding in LVLMs, achieving SOTA performance on cross-image reasoning tasks by addressing the challenges of cross-image reasoning and reward modeling.",
        "tldr_zh": "该论文提出了MIRG-RL，一个基于强化学习的框架，用于LVLM中的多图像推理和定位。通过解决跨图像推理和奖励建模的挑战，该框架在跨图像推理任务上实现了SOTA性能。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "DeHate: A Stable Diffusion-based Multimodal Approach to Mitigate Hate Speech in Images",
        "summary": "The rise in harmful online content not only distorts public discourse but\nalso poses significant challenges to maintaining a healthy digital environment.\nIn response to this, we introduce a multimodal dataset uniquely crafted for\nidentifying hate in digital content. Central to our methodology is the\ninnovative application of watermarked, stability-enhanced, stable diffusion\ntechniques combined with the Digital Attention Analysis Module (DAAM). This\ncombination is instrumental in pinpointing the hateful elements within images,\nthereby generating detailed hate attention maps, which are used to blur these\nregions from the image, thereby removing the hateful sections of the image. We\nrelease this data set as a part of the dehate shared task. This paper also\ndescribes the details of the shared task. Furthermore, we present DeHater, a\nvision-language model designed for multimodal dehatification tasks. Our\napproach sets a new standard in AI-driven image hate detection given textual\nprompts, contributing to the development of more ethical AI applications in\nsocial media.",
        "url": "http://arxiv.org/abs/2509.21787v1",
        "published_date": "2025-09-26T02:42:59+00:00",
        "updated_date": "2025-09-26T02:42:59+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Dwip Dalal",
            "Gautam Vashishtha",
            "Anku Ranui",
            "Aishwarya Reganti",
            "Parth Patwa",
            "Mohd Sarique",
            "Chandan Gupta",
            "Keshav Nath",
            "Viswanatha Reddy",
            "Vinija Jain",
            "Aman Chadha",
            "Amitava Das",
            "Amit Sheth",
            "Asif Ekbal"
        ],
        "tldr": "This paper introduces a multimodal dataset and a vision-language model (DeHater) using stable diffusion and DAAM to detect and mitigate hate speech in images based on textual prompts, contributing to ethical AI applications on social media. They also release the dataset for a shared task.",
        "tldr_zh": "本文介绍了一个多模态数据集和一个视觉语言模型 (DeHater)，它使用稳定扩散和 DAAM 来检测和减轻图像中基于文本提示的仇恨言论，从而为社交媒体中符合道德规范的 AI 应用做出贡献。他们还发布了用于共享任务的数据集。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "UniVid: Unifying Vision Tasks with Pre-trained Video Generation Models",
        "summary": "Large language models, trained on extensive corpora, successfully unify\ndiverse linguistic tasks within a single generative framework. Inspired by\nthis, recent works like Large Vision Model (LVM) extend this paradigm to vision\nby organizing tasks into sequential visual sentences, where visual prompts\nserve as the context to guide outputs. However, such modeling requires\ntask-specific pre-training across modalities and sources, which is costly and\nlimits scalability to unseen tasks. Given that pre-trained video generation\nmodels inherently capture temporal sequence dependencies, we explore a more\nunified and scalable alternative: can a pre-trained video generation model\nadapt to diverse image and video tasks? To answer this, we propose UniVid, a\nframework that fine-tunes a video diffusion transformer to handle various\nvision tasks without task-specific modifications. Tasks are represented as\nvisual sentences, where the context sequence defines both the task and the\nexpected output modality. We evaluate the generalization of UniVid from two\nperspectives: (1) cross-modal inference with contexts composed of both images\nand videos, extending beyond LVM's uni-modal setting; (2) cross-source tasks\nfrom natural to annotated data, without multi-source pre-training. Despite\nbeing trained solely on natural video data, UniVid generalizes well in both\nsettings. Notably, understanding and generation tasks can easily switch by\nsimply reversing the visual sentence order in this paradigm. These findings\nhighlight the potential of pre-trained video generation models to serve as a\nscalable and unified foundation for vision modeling. Our code will be released\nat https://github.com/CUC-MIPG/UniVid.",
        "url": "http://arxiv.org/abs/2509.21760v1",
        "published_date": "2025-09-26T01:43:40+00:00",
        "updated_date": "2025-09-26T01:43:40+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Lan Chen",
            "Yuchao Gu",
            "Qi Mao"
        ],
        "tldr": "The paper introduces UniVid, a framework that fine-tunes a video diffusion transformer for diverse vision tasks, unifying image and video processing without task-specific pre-training by representing tasks as visual sentences.",
        "tldr_zh": "该论文介绍了 UniVid，一个通过微调视频扩散Transformer来处理各种视觉任务的框架。它通过将任务表示为视觉语句，统一了图像和视频处理，而无需特定于任务的预训练。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "X-Streamer: Unified Human World Modeling with Audiovisual Interaction",
        "summary": "We introduce X-Streamer, an end-to-end multimodal human world modeling\nframework for building digital human agents capable of infinite interactions\nacross text, speech, and video within a single unified architecture. Starting\nfrom a single portrait, X-Streamer enables real-time, open-ended video calls\ndriven by streaming multimodal inputs. At its core is a Thinker-Actor\ndual-transformer architecture that unifies multimodal understanding and\ngeneration, turning a static portrait into persistent and intelligent\naudiovisual interactions. The Thinker module perceives and reasons over\nstreaming user inputs, while its hidden states are translated by the Actor into\nsynchronized multimodal streams in real time. Concretely, the Thinker leverages\na pretrained large language-speech model, while the Actor employs a chunk-wise\nautoregressive diffusion model that cross-attends to the Thinker's hidden\nstates to produce time-aligned multimodal responses with interleaved discrete\ntext and audio tokens and continuous video latents. To ensure long-horizon\nstability, we design inter- and intra-chunk attentions with time-aligned\nmultimodal positional embeddings for fine-grained cross-modality alignment and\ncontext retention, further reinforced by chunk-wise diffusion forcing and\nglobal identity referencing. X-Streamer runs in real time on two A100 GPUs,\nsustaining hours-long consistent video chat experiences from arbitrary\nportraits and paving the way toward unified world modeling of interactive\ndigital humans.",
        "url": "http://arxiv.org/abs/2509.21574v1",
        "published_date": "2025-09-25T20:53:27+00:00",
        "updated_date": "2025-09-25T20:53:27+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "You Xie",
            "Tianpei Gu",
            "Zenan Li",
            "Chenxu Zhang",
            "Guoxian Song",
            "Xiaochen Zhao",
            "Chao Liang",
            "Jianwen Jiang",
            "Hongyi Xu",
            "Linjie Luo"
        ],
        "tldr": "X-Streamer is a framework for building interactive digital human agents that can engage in real-time multimodal conversations using a dual-transformer architecture, enabling open-ended video calls from a single portrait.",
        "tldr_zh": "X-Streamer是一个用于构建交互式数字人代理的框架，它使用双Transformer架构进行实时多模态对话，从而能够从单个肖像进行开放式视频通话。",
        "relevance_score": 8,
        "novelty_claim_score": 9,
        "clarity_score": 8,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Reasoning-Enhanced Domain-Adaptive Pretraining of Multimodal Large Language Models for Short Video Content Moderation",
        "summary": "Short video platforms are evolving rapidly, making the identification of\ninappropriate content increasingly critical. Existing approaches typically\ntrain separate and small classification models for each type of issue, which\nrequires extensive human-labeled data and lacks cross-issue generalization. We\npropose a reasoning-enhanced multimodal large language model (MLLM) pretraining\nparadigm for unified inappropriate content detection. To address the\ndistribution gap between short video content and the original pretraining data\nof MLLMs, as well as the complex issue definitions, we introduce three targeted\npretraining tasks: (1) \\textit{Caption}, to enhance the MLLM's perception of\nvideo details; (2) \\textit{Visual Question Answering (VQA)}, to deepen the\nMLLM's understanding of issue definitions and annotation guidelines; (3)\n\\textit{Chain-of-Thought (CoT)}, to enhance the MLLM's reasoning capability.\nExperimental results show that our pretraining approach significantly improves\nthe MLLM's performance in both zero-shot and supervised fine-tuning (SFT)\nsettings. In addition, our pretrained model demonstrates strong generalization\ncapabilities to emergent, previously unseen issues.",
        "url": "http://arxiv.org/abs/2509.21486v1",
        "published_date": "2025-09-25T19:46:34+00:00",
        "updated_date": "2025-09-25T19:46:34+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zixuan Wang",
            "Yu Sun",
            "Hongwei Wang",
            "Baoyu Jing",
            "Xiang Shen",
            "Xin Dong",
            "Zhuolin Hao",
            "Hongyu Xiong",
            "Yang Song"
        ],
        "tldr": "This paper proposes a reasoning-enhanced multimodal large language model (MLLM) pretraining paradigm for inappropriate short video content detection, using captioning, VQA, and CoT pretraining tasks to improve performance and generalization.",
        "tldr_zh": "本文提出了一种用于检测不当短视频内容的，基于推理增强的多模态大型语言模型（MLLM）预训练范式。通过使用字幕、VQA和CoT预训练任务，旨在提高模型性能和泛化能力。",
        "relevance_score": 7,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Learning Human-Perceived Fakeness in AI-Generated Videos via Multimodal LLMs",
        "summary": "Can humans identify AI-generated (fake) videos and provide grounded reasons?\nWhile video generation models have advanced rapidly, a critical dimension --\nwhether humans can detect deepfake traces within a generated video, i.e.,\nspatiotemporal grounded visual artifacts that reveal a video as machine\ngenerated -- has been largely overlooked. We introduce DeeptraceReward, the\nfirst fine-grained, spatially- and temporally- aware benchmark that annotates\nhuman-perceived fake traces for video generation reward. The dataset comprises\n4.3K detailed annotations across 3.3K high-quality generated videos. Each\nannotation provides a natural-language explanation, pinpoints a bounding-box\nregion containing the perceived trace, and marks precise onset and offset\ntimestamps. We consolidate these annotations into 9 major categories of\ndeepfake traces that lead humans to identify a video as AI-generated, and train\nmultimodal language models (LMs) as reward models to mimic human judgments and\nlocalizations. On DeeptraceReward, our 7B reward model outperforms GPT-5 by\n34.7% on average across fake clue identification, grounding, and explanation.\nInterestingly, we observe a consistent difficulty gradient: binary fake v.s.\nreal classification is substantially easier than fine-grained deepfake trace\ndetection; within the latter, performance degrades from natural language\nexplanations (easiest), to spatial grounding, to temporal labeling (hardest).\nBy foregrounding human-perceived deepfake traces, DeeptraceReward provides a\nrigorous testbed and training signal for socially aware and trustworthy video\ngeneration.",
        "url": "http://arxiv.org/abs/2509.22646v1",
        "published_date": "2025-09-26T17:59:54+00:00",
        "updated_date": "2025-09-26T17:59:54+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL"
        ],
        "authors": [
            "Xingyu Fu",
            "Siyi Liu",
            "Yinuo Xu",
            "Pan Lu",
            "Guangqiuse Hu",
            "Tianbo Yang",
            "Taran Anantasagar",
            "Christopher Shen",
            "Yikai Mao",
            "Yuanzhe Liu",
            "Keyush Shah",
            "Chung Un Lee",
            "Yejin Choi",
            "James Zou",
            "Dan Roth",
            "Chris Callison-Burch"
        ],
        "tldr": "The paper introduces DeeptraceReward, a benchmark dataset for human-perceived fake traces in AI-generated videos, and trains multimodal LMs to identify and explain these traces, outperforming GPT-5 in this task.",
        "tldr_zh": "该论文介绍了DeeptraceReward，一个用于衡量AI生成视频中人类感知到的伪造痕迹的基准数据集。论文使用多模态语言模型来识别和解释这些痕迹，并且在该任务上优于GPT-5。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "LABELING COPILOT: A Deep Research Agent for Automated Data Curation in Computer Vision",
        "summary": "Curating high-quality, domain-specific datasets is a major bottleneck for\ndeploying robust vision systems, requiring complex trade-offs between data\nquality, diversity, and cost when researching vast, unlabeled data lakes. We\nintroduce Labeling Copilot, the first data curation deep research agent for\ncomputer vision. A central orchestrator agent, powered by a large multimodal\nlanguage model, uses multi-step reasoning to execute specialized tools across\nthree core capabilities: (1) Calibrated Discovery sources relevant,\nin-distribution data from large repositories; (2) Controllable Synthesis\ngenerates novel data for rare scenarios with robust filtering; and (3)\nConsensus Annotation produces accurate labels by orchestrating multiple\nfoundation models via a novel consensus mechanism incorporating non-maximum\nsuppression and voting. Our large-scale validation proves the effectiveness of\nLabeling Copilot's components. The Consensus Annotation module excels at object\ndiscovery: on the dense COCO dataset, it averages 14.2 candidate proposals per\nimage-nearly double the 7.4 ground-truth objects-achieving a final annotation\nmAP of 37.1%. On the web-scale Open Images dataset, it navigated extreme class\nimbalance to discover 903 new bounding box categories, expanding its capability\nto over 1500 total. Concurrently, our Calibrated Discovery tool, tested at a\n10-million sample scale, features an active learning strategy that is up to 40x\nmore computationally efficient than alternatives with equivalent sample\nefficiency. These experiments validate that an agentic workflow with optimized,\nscalable tools provides a robust foundation for curating industrial-scale\ndatasets.",
        "url": "http://arxiv.org/abs/2509.22631v1",
        "published_date": "2025-09-26T17:55:26+00:00",
        "updated_date": "2025-09-26T17:55:26+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Debargha Ganguly",
            "Sumit Kumar",
            "Ishwar Balappanawar",
            "Weicong Chen",
            "Shashank Kambhatla",
            "Srinivasan Iyengar",
            "Shivkumar Kalyanaraman",
            "Ponnurangam Kumaraguru",
            "Vipin Chaudhary"
        ],
        "tldr": "The paper introduces Labeling Copilot, a deep research agent that automates data curation in computer vision through calibrated discovery, controllable synthesis, and consensus annotation, demonstrating significant improvements in annotation accuracy and efficiency on large datasets.",
        "tldr_zh": "该论文介绍了Labeling Copilot，一个深度研究代理，通过校准发现、可控合成和共识注释来自动化计算机视觉中的数据管理，并在大型数据集上展示了注释准确性和效率的显著提升。",
        "relevance_score": 6,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Vision-Language Alignment from Compressed Image Representations using 2D Gaussian Splatting",
        "summary": "Modern vision language pipelines are driven by RGB vision encoders trained on\nmassive image text corpora. While these pipelines have enabled impressive zero\nshot capabilities and strong transfer across tasks, they still inherit two\nstructural inefficiencies from the pixel domain: (i) transmitting dense RGB\nimages from edge devices to the cloud is energy intensive and costly, and (ii)\npatch based tokenization explodes sequence length, stressing attention budgets\nand context limits. We explore 2D Gaussian Splatting (2DGS) as an alternative\nvisual substrate for alignment: a compact, spatially adaptive representation\nthat parameterizes images by a set of colored anisotropic Gaussians. We develop\na scalable 2DGS pipeline with structured initialization, luminance aware\npruning, and batched CUDA kernels, achieving over 90x faster fitting and about\n97% GPU utilization compared to prior implementations. We further adapt\ncontrastive language image pretraining (CLIP) to 2DGS by reusing a frozen\nRGB-based transformer backbone with a lightweight splat aware input stem and a\nperceiver resampler, training only about 7% of the total parameters. On large\nDataComp subsets, GS encoders yield meaningful zero shot ImageNet-1K\nperformance while compressing inputs 3 to 20x relative to pixels. While\naccuracy currently trails RGB encoders, our results establish 2DGS as a viable\nmultimodal substrate, pinpoint architectural bottlenecks, and open a path\ntoward representations that are both semantically powerful and transmission\nefficient for edge cloud learning.",
        "url": "http://arxiv.org/abs/2509.22615v1",
        "published_date": "2025-09-26T17:41:57+00:00",
        "updated_date": "2025-09-26T17:41:57+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL"
        ],
        "authors": [
            "Yasmine Omri",
            "Connor Ding",
            "Tsachy Weissman",
            "Thierry Tambe"
        ],
        "tldr": "This paper explores using 2D Gaussian Splatting (2DGS) as a compact image representation for vision-language models, achieving significant compression and speedup while maintaining reasonable zero-shot ImageNet performance.",
        "tldr_zh": "本文探索使用 2D 高斯溅射 (2DGS) 作为视觉语言模型的紧凑图像表示，在保持合理的零样本 ImageNet 性能的同时，实现了显著的压缩和加速。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Color Names in Vision-Language Models",
        "summary": "Color serves as a fundamental dimension of human visual perception and a\nprimary means of communicating about objects and scenes. As vision-language\nmodels (VLMs) become increasingly prevalent, understanding whether they name\ncolors like humans is crucial for effective human-AI interaction. We present\nthe first systematic evaluation of color naming capabilities across VLMs,\nreplicating classic color naming methodologies using 957 color samples across\nfive representative models. Our results show that while VLMs achieve high\naccuracy on prototypical colors from classical studies, performance drops\nsignificantly on expanded, non-prototypical color sets. We identify 21 common\ncolor terms that consistently emerge across all models, revealing two distinct\napproaches: constrained models using predominantly basic terms versus expansive\nmodels employing systematic lightness modifiers. Cross-linguistic analysis\nacross nine languages demonstrates severe training imbalances favoring English\nand Chinese, with hue serving as the primary driver of color naming decisions.\nFinally, ablation studies reveal that language model architecture significantly\ninfluences color naming independent of visual processing capabilities.",
        "url": "http://arxiv.org/abs/2509.22524v1",
        "published_date": "2025-09-26T16:04:18+00:00",
        "updated_date": "2025-09-26T16:04:18+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Alexandra Gomez-Villa",
            "Pablo Hernández-Cámara",
            "Muhammad Atif Butt",
            "Valero Laparra",
            "Jesus Malo",
            "Javier Vazquez-Corral"
        ],
        "tldr": "This paper systematically evaluates color naming capabilities in VLMs, revealing performance drops on non-prototypical colors, identifying common color terms, and highlighting cross-linguistic imbalances and the influence of language model architecture.",
        "tldr_zh": "本文系统地评估了视觉语言模型（VLM）的颜色命名能力，揭示了其在非典型颜色上的性能下降，识别了常用颜色术语，并强调了跨语言不平衡以及语言模型架构的影响。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Explaining multimodal LLMs via intra-modal token interactions",
        "summary": "Multimodal Large Language Models (MLLMs) have achieved remarkable success\nacross diverse vision-language tasks, yet their internal decision-making\nmechanisms remain insufficiently understood. Existing interpretability research\nhas primarily focused on cross-modal attribution, identifying which image\nregions the model attends to during output generation. However, these\napproaches often overlook intra-modal dependencies. In the visual modality,\nattributing importance to isolated image patches ignores spatial context due to\nlimited receptive fields, resulting in fragmented and noisy explanations. In\nthe textual modality, reliance on preceding tokens introduces spurious\nactivations. Failing to effectively mitigate these interference compromises\nattribution fidelity. To address these limitations, we propose enhancing\ninterpretability by leveraging intra-modal interaction. For the visual branch,\nwe introduce \\textit{Multi-Scale Explanation Aggregation} (MSEA), which\naggregates attributions over multi-scale inputs to dynamically adjust receptive\nfields, producing more holistic and spatially coherent visual explanations. For\nthe textual branch, we propose \\textit{Activation Ranking Correlation} (ARC),\nwhich measures the relevance of contextual tokens to the current token via\nalignment of their top-$k$ prediction rankings. ARC leverages this relevance to\nsuppress spurious activations from irrelevant contexts while preserving\nsemantically coherent ones. Extensive experiments across state-of-the-art MLLMs\nand benchmark datasets demonstrate that our approach consistently outperforms\nexisting interpretability methods, yielding more faithful and fine-grained\nexplanations of model behavior.",
        "url": "http://arxiv.org/abs/2509.22415v1",
        "published_date": "2025-09-26T14:39:13+00:00",
        "updated_date": "2025-09-26T14:39:13+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Jiawei Liang",
            "Ruoyu Chen",
            "Xianghao Jiao",
            "Siyuan Liang",
            "Shiming Liu",
            "Qunli Zhang",
            "Zheng Hu",
            "Xiaochun Cao"
        ],
        "tldr": "This paper proposes novel intra-modal interpretability methods, Multi-Scale Explanation Aggregation (MSEA) for visual branches and Activation Ranking Correlation (ARC) for textual branches, to improve the faithfulness and granularity of explanations in MLLMs.",
        "tldr_zh": "该论文提出了新的模内可解释性方法，即视觉分支的多尺度解释聚合（MSEA）和文本分支的激活排名相关性（ARC），以提高MLLM中解释的忠实性和细粒度。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "GPT-4 for Occlusion Order Recovery",
        "summary": "Occlusion remains a significant challenge for current vision models to\nrobustly interpret complex and dense real-world images and scenes. To address\nthis limitation and to enable accurate prediction of the occlusion order\nrelationship between objects, we propose leveraging the advanced capability of\na pre-trained GPT-4 model to deduce the order. By providing a specifically\ndesigned prompt along with the input image, GPT-4 can analyze the image and\ngenerate order predictions. The response can then be parsed to construct an\nocclusion matrix which can be utilized in assisting with other occlusion\nhandling tasks and image understanding. We report the results of evaluating the\nmodel on COCOA and InstaOrder datasets. The results show that by using semantic\ncontext, visual patterns, and commonsense knowledge, the model can produce more\naccurate order predictions. Unlike baseline methods, the model can reason about\nocclusion relationships in a zero-shot fashion, which requires no annotated\ntraining data and can easily be integrated into occlusion handling frameworks.",
        "url": "http://arxiv.org/abs/2509.22383v1",
        "published_date": "2025-09-26T14:11:39+00:00",
        "updated_date": "2025-09-26T14:11:39+00:00",
        "categories": [
            "cs.CV",
            "I.4.5"
        ],
        "authors": [
            "Kaziwa Saleh",
            "Zhyar Rzgar K Rostam",
            "Sándor Szénási",
            "Zoltán Vámossy"
        ],
        "tldr": "This paper explores using GPT-4 for zero-shot occlusion order recovery in images by prompting the model with images and parsing its response to construct occlusion matrices, showing improved accuracy on COCOA and InstaOrder datasets.",
        "tldr_zh": "本文探索了使用 GPT-4 通过提示模型图像并解析其响应以构建遮挡矩阵，从而在图像中进行零样本遮挡顺序恢复，并在 COCOA 和 InstaOrder 数据集上显示出更高的准确性。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Effectiveness of Large Multimodal Models in Detecting Disinformation: Experimental Results",
        "summary": "The proliferation of disinformation, particularly in multimodal contexts\ncombining text and images, presents a significant challenge across digital\nplatforms. This study investigates the potential of large multimodal models\n(LMMs) in detecting and mitigating false information. We propose to approach\nmultimodal disinformation detection by leveraging the advanced capabilities of\nthe GPT-4o model. Our contributions include: (1) the development of an\noptimized prompt incorporating advanced prompt engineering techniques to ensure\nprecise and consistent evaluations; (2) the implementation of a structured\nframework for multimodal analysis, including a preprocessing methodology for\nimages and text to comply with the model's token limitations; (3) the\ndefinition of six specific evaluation criteria that enable a fine-grained\nclassification of content, complemented by a self-assessment mechanism based on\nconfidence levels; (4) a comprehensive performance analysis of the model across\nmultiple heterogeneous datasets Gossipcop, Politifact, Fakeddit, MMFakeBench,\nand AMMEBA highlighting GPT-4o's strengths and limitations in disinformation\ndetection; (5) an investigation of prediction variability through repeated\ntesting, evaluating the stability and reliability of the model's\nclassifications; and (6) the introduction of confidence-level and\nvariability-based evaluation methods. These contributions provide a robust and\nreproducible methodological framework for automated multimodal disinformation\nanalysis.",
        "url": "http://arxiv.org/abs/2509.22377v1",
        "published_date": "2025-09-26T14:07:06+00:00",
        "updated_date": "2025-09-26T14:07:06+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yasmina Kheddache",
            "Marc Lalonde"
        ],
        "tldr": "This paper investigates the effectiveness of GPT-4o in detecting multimodal disinformation using optimized prompts, a structured framework, and confidence-level based evaluation across several datasets, revealing its strengths and limitations.",
        "tldr_zh": "本文研究了GPT-4o在多模态虚假信息检测中的有效性，通过优化提示、结构化框架和基于置信度的评估方法，并在多个数据集上进行了实验，揭示了其优势和局限性。",
        "relevance_score": 7,
        "novelty_claim_score": 6,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 7
    },
    {
        "title": "Rule-Based Reinforcement Learning for Document Image Classification with Vision Language Models",
        "summary": "Rule-based reinforcement learning has been gaining popularity ever since\nDeepSeek-R1 has demonstrated its success through simple verifiable rewards. In\nthe domain of document analysis, reinforcement learning is not as prevalent,\neven though many downstream tasks may benefit from the emerging properties of\nreinforcement learning, particularly the enhanced reason capabilities. We study\nthe effects of rule-based reinforcement learning with the task of Document\nImage Classification which is one of the most commonly studied downstream tasks\nin document analysis. We find that reinforcement learning tends to have better\ngeneralisation capabilities to out-of-distritbution data, which we examine in\nthree different scenarios, namely out-of-distribution images, unseen classes\nand different modalities. Our code is available at\nhttps://github.com/jungomi/vision-finetune.",
        "url": "http://arxiv.org/abs/2509.22283v1",
        "published_date": "2025-09-26T12:46:24+00:00",
        "updated_date": "2025-09-26T12:46:24+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Michael Jungo",
            "Andreas Fischer"
        ],
        "tldr": "This paper explores rule-based reinforcement learning for document image classification using Vision Language Models, demonstrating improved generalization on out-of-distribution data. The code is available.",
        "tldr_zh": "本文研究了基于规则的强化学习在文档图像分类中的应用，并使用视觉语言模型，证明了其在分布外数据上具有更好的泛化能力。代码已开源。",
        "relevance_score": 8,
        "novelty_claim_score": 6,
        "clarity_score": 8,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "MultiMat: Multimodal Program Synthesis for Procedural Materials using Large Multimodal Models",
        "summary": "Material node graphs are programs that generate the 2D channels of procedural\nmaterials, including geometry such as roughness and displacement maps, and\nreflectance such as albedo and conductivity maps. They are essential in\ncomputer graphics for representing the appearance of virtual 3D objects\nparametrically and at arbitrary resolution. In particular, their directed\nacyclic graph structures and intermediate states provide an intuitive\nunderstanding and workflow for interactive appearance modeling. Creating such\ngraphs is a challenging task and typically requires professional training.\nWhile recent neural program synthesis approaches attempt to simplify this\nprocess, they solely represent graphs as textual programs, failing to capture\nthe inherently visual-spatial nature of node graphs that makes them accessible\nto humans. To address this gap, we present MultiMat, a multimodal program\nsynthesis framework that leverages large multimodal models to process both\nvisual and textual graph representations for improved generation of procedural\nmaterial graphs. We train our models on a new dataset of production-quality\nprocedural materials and combine them with a constrained tree search inference\nalgorithm that ensures syntactic validity while efficiently navigating the\nprogram space. Our experimental results show that our multimodal program\nsynthesis method is more efficient in both unconditional and conditional graph\nsynthesis with higher visual quality and fidelity than text-only baselines,\nestablishing new state-of-the-art performance.",
        "url": "http://arxiv.org/abs/2509.22151v1",
        "published_date": "2025-09-26T10:10:25+00:00",
        "updated_date": "2025-09-26T10:10:25+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Jonas Belouadi",
            "Tamy Boubekeur",
            "Adrien Kaiser"
        ],
        "tldr": "The paper introduces MultiMat, a multimodal program synthesis framework using large multimodal models to generate procedural material graphs by processing both visual and textual graph representations, achieving state-of-the-art performance.",
        "tldr_zh": "该论文介绍了MultiMat，一个多模态程序合成框架，它使用大型多模态模型通过处理视觉和文本图表示来生成程序化材质图，并实现了最先进的性能。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "EgoInstruct: An Egocentric Video Dataset of Face-to-face Instructional Interactions with Multi-modal LLM Benchmarking",
        "summary": "Analyzing instructional interactions between an instructor and a learner who\nare co-present in the same physical space is a critical problem for educational\nsupport and skill transfer. Yet such face-to-face instructional scenes have not\nbeen systematically studied in computer vision. We identify two key reasons: i)\nthe lack of suitable datasets and ii) limited analytical techniques. To address\nthis gap, we present a new egocentric video dataset of face-to-face instruction\nand provide ground-truth annotations for two fundamental tasks that serve as a\nfirst step toward a comprehensive understanding of instructional interactions:\nprocedural step segmentation and conversation-state classification. Using this\ndataset, we benchmark multimodal large language models (MLLMs) against\nconventional task-specific models. Since face-to-face instruction involves\nmultiple modalities (speech content and prosody, gaze and body motion, and\nvisual context), effective understanding requires methods that handle verbal\nand nonverbal communication in an integrated manner. Accordingly, we evaluate\nrecently introduced MLLMs that jointly process images, audio, and text. This\nevaluation quantifies the extent to which current machine learning models\nunderstand face-to-face instructional scenes. In experiments, MLLMs outperform\nspecialized baselines even without task-specific fine-tuning, suggesting their\npromise for holistic understanding of instructional interactions.",
        "url": "http://arxiv.org/abs/2509.22019v1",
        "published_date": "2025-09-26T07:52:26+00:00",
        "updated_date": "2025-09-26T07:52:26+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yuki Sakai",
            "Ryosuke Furuta",
            "Juichun Yen",
            "Yoichi Sato"
        ],
        "tldr": "The paper introduces EgoInstruct, a new egocentric video dataset for face-to-face instructional interactions, and benchmarks multimodal large language models (MLLMs) for procedural step segmentation and conversation-state classification, showing MLLMs outperform specialized baselines.",
        "tldr_zh": "该论文介绍了一个新的以自我为中心的视频数据集EgoInstruct，用于面对面教学互动，并对多模态大型语言模型（MLLM）在程序步骤分割和会话状态分类方面进行了基准测试，表明MLLM优于专门的基线。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Geo-R1: Improving Few-Shot Geospatial Referring Expression Understanding with Reinforcement Fine-Tuning",
        "summary": "Referring expression understanding in remote sensing poses unique challenges,\nas it requires reasoning over complex object-context relationships. While\nsupervised fine-tuning (SFT) on multimodal large language models achieves\nstrong performance with massive labeled datasets, they struggle in data-scarce\nscenarios, leading to poor generalization. To address this limitation, we\npropose Geo-R1, a reasoning-centric reinforcement fine-tuning (RFT) paradigm\nfor few-shot geospatial referring. Geo-R1 enforces the model to first generate\nexplicit, interpretable reasoning chains that decompose referring expressions,\nand then leverage these rationales to localize target objects. This \"reason\nfirst, then act\" process enables the model to make more effective use of\nlimited annotations, enhances generalization, and provides interpretability. We\nvalidate Geo-R1 on three carefully designed few-shot geospatial referring\nbenchmarks, where our model consistently and substantially outperforms SFT\nbaselines. It also demonstrates strong cross-dataset generalization,\nhighlighting its robustness. Code and data will be released at\nhttp://geo-r1.github.io.",
        "url": "http://arxiv.org/abs/2509.21976v1",
        "published_date": "2025-09-26T07:01:12+00:00",
        "updated_date": "2025-09-26T07:01:12+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Zilun Zhang",
            "Zian Guan",
            "Tiancheng Zhao",
            "Haozhan Shen",
            "Tianyu Li",
            "Yuxiang Cai",
            "Zhonggen Su",
            "Zhaojun Liu",
            "Jianwei Yin",
            "Xiang Li"
        ],
        "tldr": "The paper introduces Geo-R1, a reinforcement fine-tuning method for few-shot geospatial referring expression understanding, which uses a 'reason first, then act' approach to improve generalization and interpretability with limited data.",
        "tldr_zh": "该论文介绍了Geo-R1，一种用于少样本地理空间指代表达式理解的强化微调方法，该方法采用“先推理，后行动”的方法，以在有限数据下提高泛化能力和可解释性。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Spatial Reasoning in Foundation Models: Benchmarking Object-Centric Spatial Understanding",
        "summary": "Spatial understanding is a critical capability for vision foundation models.\nWhile recent advances in large vision models or vision-language models (VLMs)\nhave expanded recognition capabilities, most benchmarks emphasize localization\naccuracy rather than whether models capture how objects are arranged and\nrelated within a scene. This gap is consequential; effective scene\nunderstanding requires not only identifying objects, but reasoning about their\nrelative positions, groupings, and depth. In this paper, we present a\nsystematic benchmark for object-centric spatial reasoning in foundation models.\nUsing a controlled synthetic dataset, we evaluate state-of-the-art vision\nmodels (e.g., GroundingDINO, Florence-2, OWLv2) and large VLMs (e.g., InternVL,\nLLaVA, GPT-4o) across three tasks: spatial localization, spatial reasoning, and\ndownstream retrieval tasks. We find a stable trade-off: detectors such as\nGroundingDINO and OWLv2 deliver precise boxes with limited relational\nreasoning, while VLMs like SmolVLM and GPT-4o provide coarse layout cues and\nfluent captions but struggle with fine-grained spatial context. Our study\nhighlights the gap between localization and true spatial understanding, and\npointing toward the need for spatially-aware foundation models in the\ncommunity.",
        "url": "http://arxiv.org/abs/2509.21922v1",
        "published_date": "2025-09-26T06:06:19+00:00",
        "updated_date": "2025-09-26T06:06:19+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Vahid Mirjalili",
            "Ramin Giahi",
            "Sriram Kollipara",
            "Akshay Kekuda",
            "Kehui Yao",
            "Kai Zhao",
            "Jianpeng Xu",
            "Kaushiki Nag",
            "Sinduja Subramaniam",
            "Topojoy Biswas",
            "Evren Korpeoglu",
            "Kannan Achan"
        ],
        "tldr": "This paper introduces a benchmark for evaluating spatial reasoning capabilities in vision foundation models, revealing a trade-off between localization accuracy and relational reasoning across different model types.",
        "tldr_zh": "本文提出了一个用于评估视觉基础模型中空间推理能力的基准，揭示了不同模型类型在定位精度和关系推理之间存在权衡。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "LG-CD: Enhancing Language-Guided Change Detection through SAM2 Adaptation",
        "summary": "Remote Sensing Change Detection (RSCD) typically identifies changes in land\ncover or surface conditions by analyzing multi-temporal images. Currently, most\ndeep learning-based methods primarily focus on learning unimodal visual\ninformation, while neglecting the rich semantic information provided by\nmultimodal data such as text. To address this limitation, we propose a novel\nLanguage-Guided Change Detection model (LG-CD). This model leverages natural\nlanguage prompts to direct the network's attention to regions of interest,\nsignificantly improving the accuracy and robustness of change detection.\nSpecifically, LG-CD utilizes a visual foundational model (SAM2) as a feature\nextractor to capture multi-scale pyramid features from high-resolution to\nlow-resolution across bi-temporal remote sensing images. Subsequently,\nmulti-layer adapters are employed to fine-tune the model for downstream tasks,\nensuring its effectiveness in remote sensing change detection. Additionally, we\ndesign a Text Fusion Attention Module (TFAM) to align visual and textual\ninformation, enabling the model to focus on target change regions using text\nprompts. Finally, a Vision-Semantic Fusion Decoder (V-SFD) is implemented,\nwhich deeply integrates visual and semantic information through a\ncross-attention mechanism to produce highly accurate change detection masks.\nOur experiments on three datasets (LEVIR-CD, WHU-CD, and SYSU-CD) demonstrate\nthat LG-CD consistently outperforms state-of-the-art change detection methods.\nFurthermore, our approach provides new insights into achieving generalized\nchange detection by leveraging multimodal information.",
        "url": "http://arxiv.org/abs/2509.21894v1",
        "published_date": "2025-09-26T05:30:11+00:00",
        "updated_date": "2025-09-26T05:30:11+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Yixiao Liu",
            "Yizhou Yang",
            "Jinwen Li",
            "Jun Tao",
            "Ruoyu Li",
            "Xiangkun Wang",
            "Min Zhu",
            "Junlong Cheng"
        ],
        "tldr": "The paper introduces LG-CD, a language-guided change detection model leveraging a visual foundation model (SAM2) and textual prompts to improve accuracy and robustness in remote sensing change detection, outperforming state-of-the-art methods on three datasets.",
        "tldr_zh": "该论文介绍了LG-CD，一种语言引导的变化检测模型，利用视觉基础模型(SAM2)和文本提示来提高遥感变化检测的准确性和鲁棒性，并在三个数据集上优于最先进的方法。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Unlocking the Essence of Beauty: Advanced Aesthetic Reasoning with Relative-Absolute Policy Optimization",
        "summary": "Multimodal large language models (MLLMs) are well suited to image aesthetic\nassessment, as they can capture high-level aesthetic features leveraging their\ncross-modal understanding capacity. However, the scarcity of multimodal\naesthetic reasoning data and the inherently subjective nature of aesthetic\njudgment make it difficult for MLLMs to generate accurate aesthetic judgments\nwith interpretable rationales. To this end, we propose Aes-R1, a comprehensive\naesthetic reasoning framework with reinforcement learning (RL). Concretely,\nAes-R1 integrates a pipeline, AesCoT, to construct and filter high-quality\nchain-of-thought aesthetic reasoning data used for cold-start. After teaching\nthe model to generate structured explanations prior to scoring, we then employ\nthe Relative-Absolute Policy Optimization (RAPO), a novel RL algorithm that\njointly optimizes absolute score regression and relative ranking order,\nimproving both per-image accuracy and cross-image preference judgments. Aes-R1\nenables MLLMs to generate grounded explanations alongside faithful scores,\nthereby enhancing aesthetic scoring and reasoning in a unified framework.\nExtensive experiments demonstrate that Aes-R1 improves the backbone's average\nPLCC/SRCC by 47.9%/34.8%, surpassing state-of-the-art baselines of similar\nsize. More ablation studies validate Aes-R1's robust generalization under\nlimited supervision and in out-of-distribution scenarios.",
        "url": "http://arxiv.org/abs/2509.21871v1",
        "published_date": "2025-09-26T04:55:00+00:00",
        "updated_date": "2025-09-26T04:55:00+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Boyang Liu",
            "Yifan Hu",
            "Senjie Jin",
            "Shihan Dou",
            "Gonglei Shi",
            "Jie Shao",
            "Tao Gui",
            "Xuanjing Huang"
        ],
        "tldr": "The paper introduces Aes-R1, a reinforcement learning framework for multimodal large language models (MLLMs) to improve image aesthetic assessment by generating structured explanations and optimizing both absolute score regression and relative ranking order.",
        "tldr_zh": "该论文介绍了一种名为Aes-R1的强化学习框架，用于多模态大型语言模型（MLLM），通过生成结构化解释并优化绝对分数回归和相对排序，从而提高图像美学评估。",
        "relevance_score": 6,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "VLCE: A Knowledge-Enhanced Framework for Image Description in Disaster Assessment",
        "summary": "Immediate damage assessment is essential after natural catastrophes; yet,\nconventional hand evaluation techniques are sluggish and perilous. Although\nsatellite and unmanned aerial vehicle (UAV) photos offer extensive perspectives\nof impacted regions, current computer vision methodologies generally yield just\nclassification labels or segmentation masks, so constraining their capacity to\ndeliver a thorough situational comprehension. We introduce the Vision Language\nCaption Enhancer (VLCE), a multimodal system designed to produce comprehensive,\ncontextually-informed explanations of disaster imagery. VLCE employs a\ndual-architecture approach: a CNN-LSTM model with a ResNet50 backbone\npretrained on EuroSat satellite imagery for the xBD dataset, and a Vision\nTransformer (ViT) model pretrained on UAV pictures for the RescueNet dataset.\nBoth systems utilize external semantic knowledge from ConceptNet and WordNet to\nexpand vocabulary coverage and improve description accuracy. We assess VLCE in\ncomparison to leading vision-language models (LLaVA and QwenVL) utilizing\nCLIPScore for semantic alignment and InfoMetIC for caption informativeness.\nExperimental findings indicate that VLCE markedly surpasses baseline models,\nattaining a maximum of 95.33% on InfoMetIC while preserving competitive\nsemantic alignment. Our dual-architecture system demonstrates significant\npotential for improving disaster damage assessment by automating the production\nof actionable, information-dense descriptions from satellite and drone photos.",
        "url": "http://arxiv.org/abs/2509.21609v1",
        "published_date": "2025-09-25T21:21:00+00:00",
        "updated_date": "2025-09-25T21:21:00+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Md. Mahfuzur Rahman",
            "Kishor Datta Gupta",
            "Marufa Kamal",
            "Fahad Rahman",
            "Sunzida Siddique",
            "Ahmed Rafi Hasan",
            "Mohd Ariful Haque",
            "Roy George"
        ],
        "tldr": "The paper introduces VLCE, a dual-architecture vision-language model that enhances disaster damage assessment by generating comprehensive descriptions from satellite and drone imagery using external knowledge sources, outperforming existing models.",
        "tldr_zh": "该论文介绍了VLCE，一种双架构视觉语言模型，通过使用外部知识源从卫星和无人机图像生成全面的描述来增强灾害损失评估，并且性能优于现有模型。",
        "relevance_score": 7,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 7
    },
    {
        "title": "X-CoT: Explainable Text-to-Video Retrieval via LLM-based Chain-of-Thought Reasoning",
        "summary": "Prevalent text-to-video retrieval systems mainly adopt embedding models for\nfeature extraction and compute cosine similarities for ranking. However, this\ndesign presents two limitations. Low-quality text-video data pairs could\ncompromise the retrieval, yet are hard to identify and examine. Cosine\nsimilarity alone provides no explanation for the ranking results, limiting the\ninterpretability. We ask that can we interpret the ranking results, so as to\nassess the retrieval models and examine the text-video data? This work proposes\nX-CoT, an explainable retrieval framework upon LLM CoT reasoning in place of\nthe embedding model-based similarity ranking. We first expand the existing\nbenchmarks with additional video annotations to support semantic understanding\nand reduce data bias. We also devise a retrieval CoT consisting of pairwise\ncomparison steps, yielding detailed reasoning and complete ranking. X-CoT\nempirically improves the retrieval performance and produces detailed\nrationales. It also facilitates the model behavior and data quality analysis.\nCode and data are available at: https://github.com/PrasannaPulakurthi/X-CoT.",
        "url": "http://arxiv.org/abs/2509.21559v1",
        "published_date": "2025-09-25T20:39:45+00:00",
        "updated_date": "2025-09-25T20:39:45+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Prasanna Reddy Pulakurthi",
            "Jiamian Wang",
            "Majid Rabbani",
            "Sohail Dianat",
            "Raghuveer Rao",
            "Zhiqiang Tao"
        ],
        "tldr": "The paper introduces X-CoT, a framework for explainable text-to-video retrieval using LLM-based Chain-of-Thought reasoning, addressing the limitations of embedding-based methods by providing rationales for ranking and improving data quality analysis.",
        "tldr_zh": "该论文介绍了 X-CoT，一个基于 LLM 链式思考推理的可解释文本到视频检索框架，通过为排名提供理由并改进数据质量分析，解决了基于嵌入方法的局限性。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Learning GUI Grounding with Spatial Reasoning from Visual Feedback",
        "summary": "Graphical User Interface (GUI) grounding is commonly framed as a coordinate\nprediction task -- given a natural language instruction, generate on-screen\ncoordinates for actions such as clicks and keystrokes. However, recent Vision\nLanguage Models (VLMs) often fail to predict accurate numeric coordinates when\nprocessing high-resolution GUI images with complex layouts. To address this\nissue, we reframe GUI grounding as an \\emph{interactive search task}, where the\nVLM generates actions to move a cursor in the GUI to locate UI elements. At\neach step, the model determines the target object, evaluates the spatial\nrelations between the cursor and the target, and moves the cursor closer to the\ntarget conditioned on the movement history. In this interactive process, the\nrendered cursor provides visual feedback to help the model align its\npredictions with the corresponding on-screen locations. We train our GUI\ngrounding model, GUI-Cursor, using multi-step online reinforcement learning\nwith a dense trajectory-based reward function. Our experimental results show\nthat GUI-Cursor, based on Qwen2.5-VL-7B, improves the GUI grounding accuracy\nand achieves state-of-the-art results on ScreenSpot-v2 ($88.8\\% \\rightarrow\n93.9\\%$) and ScreenSpot-Pro ($26.8\\% \\rightarrow 56.5\\%$). Moreover, we observe\nthat GUI-Cursor learns to solve the problem within two steps for 95\\% of\ninstances and can adaptively conduct more steps on more difficult examples.",
        "url": "http://arxiv.org/abs/2509.21552v1",
        "published_date": "2025-09-25T20:38:01+00:00",
        "updated_date": "2025-09-25T20:38:01+00:00",
        "categories": [
            "cs.CV",
            "cs.CL"
        ],
        "authors": [
            "Yu Zhao",
            "Wei-Ning Chen",
            "Huseyin Atahan Inan",
            "Samuel Kessler",
            "Lu Wang",
            "Lukas Wutschitz",
            "Fangkai Yang",
            "Chaoyun Zhang",
            "Pasquale Minervini",
            "Saravan Rajmohan",
            "Robert Sim"
        ],
        "tldr": "The paper reframes GUI grounding as an interactive search task using a cursor-based VLM with reinforcement learning, achieving state-of-the-art results on ScreenSpot datasets.",
        "tldr_zh": "该论文将GUI grounding重新定义为一个交互式搜索任务，使用基于光标的VLM和强化学习，在ScreenSpot数据集上取得了最先进的结果。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    },
    {
        "title": "Gender Stereotypes in Professional Roles Among Saudis: An Analytical Study of AI-Generated Images Using Language Models",
        "summary": "This study investigates the extent to which contemporary Text-to-Image\nartificial intelligence (AI) models perpetuate gender stereotypes and cultural\ninaccuracies when generating depictions of professionals in Saudi Arabia. We\nanalyzed 1,006 images produced by ImageFX, DALL-E V3, and Grok for 56 diverse\nSaudi professions using neutral prompts. Two trained Saudi annotators evaluated\neach image on five dimensions: perceived gender, clothing and appearance,\nbackground and setting, activities and interactions, and age. A third senior\nresearcher adjudicated whenever the two primary raters disagreed, yielding\n10,100 individual judgements. The results reveal a strong gender imbalance,\nwith ImageFX outputs being 85\\% male, Grok 86.6\\% male, and DALL-E V3 96\\%\nmale, indicating that DALL-E V3 exhibited the strongest overall gender\nstereotyping. This imbalance was most evident in leadership and technical\nroles. Moreover, cultural inaccuracies in clothing, settings, and depicted\nactivities were frequently observed across all three models.\nCounter-stereotypical images often arise from cultural misinterpretations\nrather than genuinely progressive portrayals. We conclude that current models\nmirror societal biases embedded in their training data, generated by humans,\noffering only a limited reflection of the Saudi labour market's gender dynamics\nand cultural nuances. These findings underscore the urgent need for more\ndiverse training data, fairer algorithms, and culturally sensitive evaluation\nframeworks to ensure equitable and authentic visual outputs.",
        "url": "http://arxiv.org/abs/2509.21466v1",
        "published_date": "2025-09-25T19:30:51+00:00",
        "updated_date": "2025-09-25T19:30:51+00:00",
        "categories": [
            "cs.CV",
            "cs.AI",
            "cs.CL"
        ],
        "authors": [
            "Khaloud S. AlKhalifah",
            "Malak Mashaabi",
            "Hend Al-Khalifa"
        ],
        "tldr": "This paper analyzes gender stereotypes and cultural inaccuracies in AI-generated images of Saudi professionals using ImageFX, DALL-E V3, and Grok, revealing significant biases in gender representation and cultural depiction. The study highlights the need for more diverse training data and culturally sensitive AI models.",
        "tldr_zh": "本文分析了使用ImageFX、DALL-E V3和Grok生成的沙特专业人士的AI图像中的性别刻板印象和文化不准确性，揭示了性别表征和文化描绘方面的重大偏差。该研究强调了对更多样化的训练数据和对文化敏感的AI模型的需求。",
        "relevance_score": 4,
        "novelty_claim_score": 6,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 6
    },
    {
        "title": "Drag4D: Align Your Motion with Text-Driven 3D Scene Generation",
        "summary": "We introduce Drag4D, an interactive framework that integrates object motion\ncontrol within text-driven 3D scene generation. This framework enables users to\ndefine 3D trajectories for the 3D objects generated from a single image,\nseamlessly integrating them into a high-quality 3D background. Our Drag4D\npipeline consists of three stages. First, we enhance text-to-3D background\ngeneration by applying 2D Gaussian Splatting with panoramic images and\ninpainted novel views, resulting in dense and visually complete 3D\nreconstructions. In the second stage, given a reference image of the target\nobject, we introduce a 3D copy-and-paste approach: the target instance is\nextracted in a full 3D mesh using an off-the-shelf image-to-3D model and\nseamlessly composited into the generated 3D scene. The object mesh is then\npositioned within the 3D scene via our physics-aware object position learning,\nensuring precise spatial alignment. Lastly, the spatially aligned object is\ntemporally animated along a user-defined 3D trajectory. To mitigate motion\nhallucination and ensure view-consistent temporal alignment, we develop a\npart-augmented, motion-conditioned video diffusion model that processes\nmultiview image pairs together with their projected 2D trajectories. We\ndemonstrate the effectiveness of our unified architecture through evaluations\nat each stage and in the final results, showcasing the harmonized alignment of\nuser-controlled object motion within a high-quality 3D background.",
        "url": "http://arxiv.org/abs/2509.21888v1",
        "published_date": "2025-09-26T05:23:45+00:00",
        "updated_date": "2025-09-26T05:23:45+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Minjun Kang",
            "Inkyu Shin",
            "Taeyeop Lee",
            "In So Kweon",
            "Kuk-Jin Yoon"
        ],
        "tldr": "Drag4D is an interactive framework for text-driven 3D scene generation, allowing users to define 3D trajectories for objects and seamlessly integrate them into high-quality 3D backgrounds using a novel copy-and-paste approach and a motion-conditioned video diffusion model.",
        "tldr_zh": "Drag4D是一个交互式框架，用于文本驱动的3D场景生成，允许用户为对象定义3D轨迹，并使用新颖的复制粘贴方法和运动条件视频扩散模型将它们无缝集成到高质量的3D背景中。",
        "relevance_score": 3,
        "novelty_claim_score": 7,
        "clarity_score": 8,
        "potential_impact_score": 6,
        "overall_priority_score": 5
    }
]