[
    {
        "title": "Compositional Video Synthesis by Temporal Object-Centric Learning",
        "summary": "We present a novel framework for compositional video synthesis that leverages\ntemporally consistent object-centric representations, extending our previous\nwork, SlotAdapt, from images to video. While existing object-centric approaches\neither lack generative capabilities entirely or treat video sequences\nholistically, thus neglecting explicit object-level structure, our approach\nexplicitly captures temporal dynamics by learning pose invariant object-centric\nslots and conditioning them on pretrained diffusion models. This design enables\nhigh-quality, pixel-level video synthesis with superior temporal coherence, and\noffers intuitive compositional editing capabilities such as object insertion,\ndeletion, or replacement, maintaining consistent object identities across\nframes. Extensive experiments demonstrate that our method sets new benchmarks\nin video generation quality and temporal consistency, outperforming previous\nobject-centric generative methods. Although our segmentation performance\nclosely matches state-of-the-art methods, our approach uniquely integrates this\ncapability with robust generative performance, significantly advancing\ninteractive and controllable video generation and opening new possibilities for\nadvanced content creation, semantic editing, and dynamic scene understanding.",
        "url": "http://arxiv.org/abs/2507.20855v1",
        "published_date": "2025-07-28T14:11:04+00:00",
        "updated_date": "2025-07-28T14:11:04+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Adil Kaan Akan",
            "Yucel Yemez"
        ],
        "tldr": "This paper introduces a novel framework for compositional video synthesis using temporally consistent, object-centric representations and diffusion models, enabling high-quality video generation with object-level editing capabilities.",
        "tldr_zh": "该论文提出了一种新颖的组合视频合成框架，该框架利用时间上一致的、以对象为中心的表示和扩散模型，从而能够生成高质量的视频并具有对象级别的编辑功能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]