[
    {
        "title": "Back to the Features: DINO as a Foundation for Video World Models",
        "summary": "We present DINO-world, a powerful generalist video world model trained to\npredict future frames in the latent space of DINOv2. By leveraging a\npre-trained image encoder and training a future predictor on a large-scale\nuncurated video dataset, DINO-world learns the temporal dynamics of diverse\nscenes, from driving and indoor scenes to simulated environments. We show that\nDINO-world outperforms previous models on a variety of video prediction\nbenchmarks, e.g. segmentation and depth forecasting, and demonstrates strong\nunderstanding of intuitive physics. Furthermore, we show that it is possible to\nfine-tune the predictor on observation-action trajectories. The resulting\naction-conditioned world model can be used for planning by simulating candidate\ntrajectories in latent space.",
        "url": "http://arxiv.org/abs/2507.19468v1",
        "published_date": "2025-07-25T17:54:10+00:00",
        "updated_date": "2025-07-25T17:54:10+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Federico Baldassarre",
            "Marc Szafraniec",
            "Basile Terver",
            "Vasil Khalidov",
            "Francisco Massa",
            "Yann LeCun",
            "Patrick Labatut",
            "Maximilian Seitzer",
            "Piotr Bojanowski"
        ],
        "tldr": "DINO-world is a video world model trained on DINOv2's latent space, demonstrating superior performance in video prediction benchmarks and enabling action-conditioned planning through fine-tuning.",
        "tldr_zh": "DINO-world是一个在DINOv2的潜在空间中训练的视频世界模型，它在视频预测基准测试中表现出色，并通过微调实现动作条件下的规划。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 9
    },
    {
        "title": "PINO: Person-Interaction Noise Optimization for Long-Duration and Customizable Motion Generation of Arbitrary-Sized Groups",
        "summary": "Generating realistic group interactions involving multiple characters remains\nchallenging due to increasing complexity as group size expands. While existing\nconditional diffusion models incrementally generate motions by conditioning on\npreviously generated characters, they rely on single shared prompts, limiting\nnuanced control and leading to overly simplified interactions. In this paper,\nwe introduce Person-Interaction Noise Optimization (PINO), a novel,\ntraining-free framework designed for generating realistic and customizable\ninteractions among groups of arbitrary size. PINO decomposes complex group\ninteractions into semantically relevant pairwise interactions, and leverages\npretrained two-person interaction diffusion models to incrementally compose\ngroup interactions. To ensure physical plausibility and avoid common artifacts\nsuch as overlapping or penetration between characters, PINO employs\nphysics-based penalties during noise optimization. This approach allows precise\nuser control over character orientation, speed, and spatial relationships\nwithout additional training. Comprehensive evaluations demonstrate that PINO\ngenerates visually realistic, physically coherent, and adaptable multi-person\ninteractions suitable for diverse animation, gaming, and robotics applications.",
        "url": "http://arxiv.org/abs/2507.19292v1",
        "published_date": "2025-07-25T14:06:42+00:00",
        "updated_date": "2025-07-25T14:06:42+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Sakuya Ota",
            "Qing Yu",
            "Kent Fujiwara",
            "Satoshi Ikehata",
            "Ikuro Sato"
        ],
        "tldr": "PINO is a training-free framework for generating realistic and customizable interactions among groups of arbitrary size by decomposing complex group interactions into pairwise interactions and using physics-based penalties during noise optimization.",
        "tldr_zh": "PINO是一个无需训练的框架，通过将复杂的群体互动分解为成对互动，并在噪声优化过程中采用基于物理的惩罚，来生成任意大小的群体中逼真且可定制的互动。",
        "relevance_score": 6,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]