[
    {
        "title": "Causality-Aware Temporal Projection for Video Understanding in Video-LLMs",
        "summary": "Recent Video Large Language Models (Video-LLMs) have shown strong multimodal reasoning capabilities, yet remain challenged by video understanding tasks that require consistent temporal ordering and causal coherence. Many parameter-efficient Video-LLMs rely on unconstrained bidirectional projectors to model inter-frame interactions, which can blur temporal ordering by allowing later frames to influence earlier representations, without explicit architectural mechanisms to respect the directional nature of video reasoning. To address this limitation, we propose V-CORE, a parameter-efficient framework that introduces explicit temporal ordering constraints for video understanding. V-CORE consists of two key components: (1) Learnable Spatial Aggregation (LSA), which adaptively selects salient spatial tokens to reduce redundancy, and (2) a Causality-Aware Temporal Projector (CATP), which enforces structured unidirectional information flow via block-causal attention and a terminal dynamic summary token acting as a causal sink. This design preserves intra-frame spatial interactions while ensuring that temporal information is aggregated in a strictly ordered manner. With 4-bit QLoRA and a frozen LLM backbone, V-CORE can be trained efficiently on a single consumer GPU. Experiments show that V-CORE achieves strong performance on the challenging NExT-QA benchmark, reaching 61.2% accuracy, and remains competitive across MSVD-QA, MSRVTT-QA, and TGIF-QA, with gains concentrated in temporal and causal reasoning subcategories (+3.5% and +5.2% respectively), directly validating the importance of explicit temporal ordering constraints.",
        "url": "http://arxiv.org/abs/2601.01804v1",
        "published_date": "2026-01-05T05:30:13+00:00",
        "updated_date": "2026-01-05T05:30:13+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Zhengjian Kang",
            "Qi Chen",
            "Rui Liu",
            "Kangtong Mo",
            "Xingyu Zhang",
            "Xiaoyu Deng",
            "Ye Zhang"
        ],
        "tldr": "The paper introduces V-CORE, a parameter-efficient framework for Video-LLMs that enforces temporal ordering constraints using a causality-aware temporal projector, achieving improved performance on video understanding tasks, particularly those requiring temporal and causal reasoning.",
        "tldr_zh": "该论文介绍了V-CORE，一个用于视频大语言模型的参数高效框架，它通过一个因果感知时间投影器来强制执行时间顺序约束，从而在视频理解任务上实现了改进的性能，尤其是在需要时间和因果推理的任务上。",
        "relevance_score": 8,
        "novelty_claim_score": 7,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 8
    },
    {
        "title": "VerLM: Explaining Face Verification Using Natural Language",
        "summary": "Face verification systems have seen substantial advancements; however, they often lack transparency in their decision-making processes. In this paper, we introduce an innovative Vision-Language Model (VLM) for Face Verification, which not only accurately determines if two face images depict the same individual but also explicitly explains the rationale behind its decisions. Our model is uniquely trained using two complementary explanation styles: (1) concise explanations that summarize the key factors influencing its decision, and (2) comprehensive explanations detailing the specific differences observed between the images. We adapt and enhance a state-of-the-art modeling approach originally designed for audio-based differentiation to suit visual inputs effectively. This cross-modal transfer significantly improves our model's accuracy and interpretability. The proposed VLM integrates sophisticated feature extraction techniques with advanced reasoning capabilities, enabling clear articulation of its verification process. Our approach demonstrates superior performance, surpassing baseline methods and existing models. These findings highlight the immense potential of vision language models in face verification set up, contributing to more transparent, reliable, and explainable face verification systems.",
        "url": "http://arxiv.org/abs/2601.01798v1",
        "published_date": "2026-01-05T05:16:07+00:00",
        "updated_date": "2026-01-05T05:16:07+00:00",
        "categories": [
            "cs.CV",
            "cs.AI"
        ],
        "authors": [
            "Syed Abdul Hannan",
            "Hazim Bukhari",
            "Thomas Cantalapiedra",
            "Eman Ansar",
            "Massa Baali",
            "Rita Singh",
            "Bhiksha Raj"
        ],
        "tldr": "The paper introduces VerLM, a Vision-Language Model for face verification that provides natural language explanations for its decisions, trained with concise and comprehensive explanation styles, achieving superior performance compared to baselines.",
        "tldr_zh": "该论文介绍了一种用于人脸验证的视觉语言模型 VerLM，该模型能够为其决策提供自然语言解释。该模型通过简洁和全面的解释风格进行训练，与基线方法相比，实现了卓越的性能。",
        "relevance_score": 9,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "CTIS-QA: Clinical Template-Informed Slide-level Question Answering for Pathology",
        "summary": "In this paper, we introduce a clinical diagnosis template-based pipeline to systematically collect and structure pathological information. In collaboration with pathologists and guided by the the College of American Pathologists (CAP) Cancer Protocols, we design a Clinical Pathology Report Template (CPRT) that ensures comprehensive and standardized extraction of diagnostic elements from pathology reports. We validate the effectiveness of our pipeline on TCGA-BRCA. First, we extract pathological features from reports using CPRT. These features are then used to build CTIS-Align, a dataset of 80k slide-description pairs from 804 WSIs for vision-language alignment training, and CTIS-Bench, a rigorously curated VQA benchmark comprising 977 WSIs and 14,879 question-answer pairs. CTIS-Bench emphasizes clinically grounded, closed-ended questions (e.g., tumor grade, receptor status) that reflect real diagnostic workflows, minimize non-visual reasoning, and require genuine slide understanding. We further propose CTIS-QA, a Slide-level Question Answering model, featuring a dual-stream architecture that mimics pathologists' diagnostic approach. One stream captures global slide-level context via clustering-based feature aggregation, while the other focuses on salient local regions through attention-guided patch perception module. Extensive experiments on WSI-VQA, CTIS-Bench, and slide-level diagnostic tasks show that CTIS-QA consistently outperforms existing state-of-the-art models across multiple metrics. Code and data are available at https://github.com/HLSvois/CTIS-QA.",
        "url": "http://arxiv.org/abs/2601.01769v1",
        "published_date": "2026-01-05T03:54:02+00:00",
        "updated_date": "2026-01-05T03:54:02+00:00",
        "categories": [
            "cs.CV"
        ],
        "authors": [
            "Hao Lu",
            "Ziniu Qian",
            "Yifu Li",
            "Yang Zhou",
            "Bingzheng Wei",
            "Yan Xu"
        ],
        "tldr": "This paper introduces CTIS-QA, a clinical template-informed slide-level question answering model for pathology, along with two new datasets: CTIS-Align and CTIS-Bench. The model leverages a dual-stream architecture mimicking pathologists' diagnostic approach and demonstrates superior performance on various benchmarks.",
        "tldr_zh": "该论文介绍了CTIS-QA，一个基于临床模板的病理切片级别问答模型，并发布了两个新的数据集：CTIS-Align 和 CTIS-Bench。该模型采用双流架构，模拟病理学家的诊断方法，并在多个基准测试中表现出优越的性能。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    },
    {
        "title": "Crafting Adversarial Inputs for Large Vision-Language Models Using Black-Box Optimization",
        "summary": "Recent advancements in Large Vision-Language Models (LVLMs) have shown groundbreaking capabilities across diverse multimodal tasks. However, these models remain vulnerable to adversarial jailbreak attacks, where adversaries craft subtle perturbations to bypass safety mechanisms and trigger harmful outputs. Existing white-box attacks methods require full model accessibility, suffer from computing costs and exhibit insufficient adversarial transferability, making them impractical for real-world, black-box settings. To address these limitations, we propose a black-box jailbreak attack on LVLMs via Zeroth-Order optimization using Simultaneous Perturbation Stochastic Approximation (ZO-SPSA). ZO-SPSA provides three key advantages: (i) gradient-free approximation by input-output interactions without requiring model knowledge, (ii) model-agnostic optimization without the surrogate model and (iii) lower resource requirements with reduced GPU memory consumption. We evaluate ZO-SPSA on three LVLMs, including InstructBLIP, LLaVA and MiniGPT-4, achieving the highest jailbreak success rate of 83.0% on InstructBLIP, while maintaining imperceptible perturbations comparable to white-box methods. Moreover, adversarial examples generated from MiniGPT-4 exhibit strong transferability to other LVLMs, with ASR reaching 64.18%. These findings underscore the real-world feasibility of black-box jailbreaks and expose critical weaknesses in the safety mechanisms of current LVLMs",
        "url": "http://arxiv.org/abs/2601.01747v1",
        "published_date": "2026-01-05T02:49:33+00:00",
        "updated_date": "2026-01-05T02:49:33+00:00",
        "categories": [
            "cs.CR",
            "cs.AI",
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Jiwei Guan",
            "Haibo Jin",
            "Haohan Wang"
        ],
        "tldr": "This paper introduces a black-box adversarial attack on Large Vision-Language Models (LVLMs) using Zeroth-Order optimization, demonstrating its effectiveness in jailbreaking safety mechanisms with imperceptible perturbations and good transferability.",
        "tldr_zh": "本文提出了一种针对大型视觉语言模型（LVLM）的黑盒对抗攻击方法，该方法利用零阶优化，证明了其能够有效地破解安全机制，同时保持扰动不可察觉并具有良好的迁移性。",
        "relevance_score": 7,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 8,
        "overall_priority_score": 8
    }
]