[
    {
        "title": "ShapeR: Robust Conditional 3D Shape Generation from Casual Captures",
        "summary": "Recent advances in 3D shape generation have achieved impressive results, but most existing methods rely on clean, unoccluded, and well-segmented inputs. Such conditions are rarely met in real-world scenarios. We present ShapeR, a novel approach for conditional 3D object shape generation from casually captured sequences. Given an image sequence, we leverage off-the-shelf visual-inertial SLAM, 3D detection algorithms, and vision-language models to extract, for each object, a set of sparse SLAM points, posed multi-view images, and machine-generated captions. A rectified flow transformer trained to effectively condition on these modalities then generates high-fidelity metric 3D shapes. To ensure robustness to the challenges of casually captured data, we employ a range of techniques including on-the-fly compositional augmentations, a curriculum training scheme spanning object- and scene-level datasets, and strategies to handle background clutter. Additionally, we introduce a new evaluation benchmark comprising 178 in-the-wild objects across 7 real-world scenes with geometry annotations. Experiments show that ShapeR significantly outperforms existing approaches in this challenging setting, achieving an improvement of 2.7x in Chamfer distance compared to state of the art.",
        "url": "http://arxiv.org/abs/2601.11514v1",
        "published_date": "2026-01-16T18:51:24+00:00",
        "updated_date": "2026-01-16T18:51:24+00:00",
        "categories": [
            "cs.CV",
            "cs.LG"
        ],
        "authors": [
            "Yawar Siddiqui",
            "Duncan Frost",
            "Samir Aroudj",
            "Armen Avetisyan",
            "Henry Howard-Jenkins",
            "Daniel DeTone",
            "Pierre Moulon",
            "Qirui Wu",
            "Zhengqin Li",
            "Julian Straub",
            "Richard Newcombe",
            "Jakob Engel"
        ],
        "tldr": "ShapeR introduces a novel approach for generating high-fidelity 3D object shapes from casually captured image sequences using SLAM, 3D detection, and vision-language models, outperforming existing methods in challenging real-world scenarios.",
        "tldr_zh": "ShapeR 提出了一种新方法，利用 SLAM、3D 检测和视觉语言模型，从随意拍摄的图像序列中生成高保真 3D 对象形状，在具有挑战性的现实场景中优于现有方法。",
        "relevance_score": 6,
        "novelty_claim_score": 8,
        "clarity_score": 9,
        "potential_impact_score": 7,
        "overall_priority_score": 7
    }
]